{"problem_id": "115B1", "problem_text_en": "Which of the following combinations of risk factors and diseases is correct?", "choices_en": ["Alcohol consumption increases the risk of esophageal cancer.", "Low body weight --------- sleep apnea syndrome", "Weight gain --------- Frailty", "Intake of dietary fiber --------- Diabetes", "Intake of n-3 polyunsaturated fatty acids - Ischemic heart disease."], "answer": ["a"]}
{"problem_id": "115B2", "problem_text_en": "Which of the following is the correct purpose of asking about the interpretive model during a medical interview?", "choices_en": ["Prevent patient misidentification.", "Evaluate the credibility of the patient's complaints.", "Screen for mental illness.", "To understand the dissatisfaction with medical institutions.", "Understand the patient's thoughts on the condition and treatment."], "answer": ["e"]}
{"problem_id": "115B3", "problem_text_en": "Which of the following is not regulated by the Medical Practitioners Act?", "choices_en": ["Military service obligation", "Duty of confidentiality", "Clinical training", "Issuance of a prescription", "Recording of medical charts"], "answer": ["b"]}
{"problem_id": "115B4", "problem_text_en": "Which of the following is not observed as an extra-articular symptom of rheumatoid arthritis?", "choices_en": ["Subcutaneous nodule", "Skin ulcer", "Pericarditis", "Interstitial pneumonia", "Retroperitoneal fibrosis"], "answer": ["e"]}
{"problem_id": "115B5", "problem_text_en": "Which of the following is correct regarding second opinion?", "choices_en": ["Based on patient rights.", "Performed under insurance-covered medical treatment.", "Only malignant tumors are targeted.", "The purpose is to change the attending physician.", "Can refuse a request from a patient under their care."], "answer": ["a"]}
{"problem_id": "115B6", "problem_text_en": "Which of the following is correct about Randomized Controlled Trials (RCTs)?", "choices_en": ["High internal validity.", "Requires double-blind testing.", "Used in Phase 1 clinical trials.", "A type of meta-analysis.", "Compared to observational studies, the impact of confounding factors is greater."], "answer": ["a"]}
{"problem_id": "115B7", "problem_text_en": "Which of the following statements about home care for a 52-year-old patient with end-stage pancreatic cancer is incorrect?", "choices_en": ["You can apply for long-term care insurance.", "Patient's consent is necessary.", "You can receive intravenous drip at home.", "It is necessary for family members to live together.", "It is possible to receive rehabilitation at home."], "answer": ["d"]}
{"problem_id": "115B8", "problem_text_en": "Show the changes in maternal blood hormone levels during pregnancy, delivery, and the postpartum period. Which line represents the solid line A? However, each line corresponds to either a, b, c, d, or e.", "choices_en": ["Estrogen", "Prolactin", "Progesterone", "Thyroid-stimulating hormone (TSH)", "Chorionic gonadotropin (hCG)"], "answer": ["b"]}
{"problem_id": "115B9", "problem_text_en": "What findings strongly suggest endometriosis?", "choices_en": ["Muscular defense in the lower abdomen", "A hard uterus with tenderness", "Soft and enlarged uterus", "Painful hardening of the rectovaginal septum (Douglas pouch)", "Soft movable painless spherical mass."], "answer": ["d"]}
{"problem_id": "115B10", "problem_text_en": "Which of the following can be evaluated by a 24-hour urine collection test?", "choices_en": ["Lipids.", "Table salt", "Dietary fiber", "Energy", "Fat-soluble vitamins"], "answer": ["b"]}
{"problem_id": "115B11", "problem_text_en": "Which of the following is inappropriate consideration for a resident when requesting a consultation?", "choices_en": ["Try to be concise during consultation.", "Make an effort to maintain good relationships with others.", "Asking for opinions without specifying the problem.", "Gathering information about the patient.", "To be done with consideration of urgency."], "answer": ["c"]}
{"problem_id": "115B12", "problem_text_en": "A separate photo of the patient's nails showing anemia is presented. What could be the possible conditions?", "choices_en": ["Renal anemia", "Sickle cell anemia", "Iron-deficiency anemia.", "Megaloblastic anemia", "Paroxysmal nocturnal hemoglobinuria"], "answer": ["c"]}
{"problem_id": "115B13", "problem_text_en": "Which of the following does not cause dysphagia in elderly people?", "choices_en": ["Decrease in sense of smell", "Tooth loss", "Hypoglossal movement disorder.", "Hypofunction of salivary glands", "Decreased pharyngeal contractility"], "answer": ["a"]}
{"problem_id": "115B14", "problem_text_en": "What is the gait of a patient who shows spasticity in both lower extremities?", "choices_en": ["Scissoring gait", "Ataxic gait", "Shuffling gait", "Scissoring gait", "Shuffling gait."], "answer": ["d"]}
{"problem_id": "115B15", "problem_text_en": "What is the most common cause of acute cough?", "choices_en": ["COPD (Chronic Obstructive Pulmonary Disease)", "Cough variant asthma", "Gastroesophageal reflux disease (GERD)", "Sinobronchial syndrome", "Mycoplasma pneumonia"], "answer": ["e"]}
{"problem_id": "115B16", "problem_text_en": "Which of the following is correct regarding the process of decision-making at the end of life?", "choices_en": ["The subject (of the study) are cancer patients.", "The decision-making process does not change.", "Active euthanasia may be one of the choices.", "Patients who wish to maintain their lives as much as possible are not eligible.", "In case the individual's intention cannot be confirmed, the presumed intention of their family or others will be respected."], "answer": ["e"]}
{"problem_id": "115B17", "problem_text_en": "Which of the following combinations of diseases and symptoms is less likely?", "choices_en": ["Cerebellar stroke --------- Homonymous hemianopsia", "Acoustic neuroma --------- decreased speech clarity", "Sudden deafness - tinnitus", "Panic disorder --------- palpitations", "Benign paroxysmal positional vertigo (BPPV) - Dizziness when turning over in bed"], "answer": ["a"]}
{"problem_id": "115B18", "problem_text_en": "Which of the following is correct about obsessive-compulsive behaviors observed in patients with obsessive-compulsive disorder?", "choices_en": ["No memory of the event.", "Symptoms worsen in the evening.", "Anxiety is alleviated by behavior.", "The patient considers the behavior to be rational.", "Being commanded from outside to \"perform an act\" with words that are being imposed inside the head."], "answer": ["c"]}
{"problem_id": "115B19", "problem_text_en": "Which of the following reduces the preload on the left ventricle?", "choices_en": ["Mitral stenosis", "Aortic valve stenosis", "Tricuspid regurgitation", "Mitral valve regurgitation", "Aortic valve regurgitation"], "answer": ["a"]}
{"problem_id": "115B20", "problem_text_en": "When transferring blood samples to containers, which of the following factors has the greatest impact on measurement values due to insufficient sample volume?", "choices_en": ["Alanine aminotransferase (ALT)", "White blood cell count", "Sodium", "Creatinine", "Activated partial thromboplastin time (APTT)"], "answer": ["e"]}
{"problem_id": "115B21", "problem_text_en": "When a child who is not in life-threatening danger but suspected of being abused presents at the hospital, what is the agency that should be reported first?", "choices_en": ["Police station", "Elementary school", "Public health center", "Child consultation center", "Municipal Health Center"], "answer": ["d"]}
{"problem_id": "115B22", "problem_text_en": "Which abdominal tumor moves with respiration upon palpation?", "choices_en": ["Pancreatic cyst", "Gallbladder cancer", "Abdominal aortic aneurysm.", "Pseudomyxoma peritonei", "Krukenberg tumor"], "answer": ["b"]}
{"problem_id": "115B23", "problem_text_en": "Which of the following principles is appropriate for appropriate use of antibiotics for community-acquired pneumonia?", "choices_en": ["Choosing an antibiotic based on body temperature.", "Choose antibiotics based on white blood cell count.", "Start after the final result of sputum culture is available.", "Begin after confirming Gram staining of sputum.", "The judgment of treatment effectiveness is based on the normalization of CRP as an indicator."], "answer": ["d"]}
{"problem_id": "115B24", "problem_text_en": "Which of the following does not cause hepatic encephalopathy in patients with liver cirrhosis?", "choices_en": ["Infection", "Dehydration", "Constipation", "Protein restriction", "Gastrointestinal bleeding"], "answer": ["d"]}
{"problem_id": "115B25", "problem_text_en": "In a 54-year-old female patient with repeated sudden sweating, daytime fatigue, and palpitations as chief complaints, which hormone is considered to be elevated?", "choices_en": ["GH stands for Growth Hormone.", "Follicle-stimulating hormone (FSH)", "Oxytocin", "Prolactin", "Progesterone"], "answer": ["b"]}
{"problem_id": "115B26", "problem_text_en": "An 82-year-old man presented to the hospital with a chief complaint of fever, vomiting, and watery diarrhea. He has had a fever of around 38℃, vomiting, and eight episodes of watery diarrhea per day that have persisted for three days. He was admitted to the hospital because oral fluid intake is difficult for him. Norovirus antigen was detected in his stool on admission. During the examination, (1) alcohol hand disinfection was performed, followed by (2) wearing a vinyl gown and (3) wearing plastic gloves. Then the abdomen was auscultated and palpated. After the examination, (4) the stethoscope was put into the pocket of the coat, and (5) hand washing was performed with soap and running water. Which of the underlined action is incorrect for infection control measures?\n\n(Note: The original text is a question, but to better suit the translation, it has been modified to a statement.)\n", "choices_en": ["① (This is not a translation, it is a reference to a specific choice in a multiple-choice question, often represented by a number or letter.)", "This choice cannot be translated without context. It is a numerical symbol and does not have a meaning by itself.", "Sorry, I cannot translate \"③\" without more context. It is just a number and could correspond to anything.", "Sorry, ④ is not a word or phrase that can be translated without context. It is a numerical symbol often used to represent a choice in a multiple-choice question or a list item.", "Unfortunately, without additional context or information, it is impossible to accurately translate or interpret this choice. It appears to be a number or symbol without any accompanying text or content. Please provide more context or information for me to assist you better."], "answer": ["d"]}
{"problem_id": "115B27", "problem_text_en": "An 82-year-old male patient complained of feeling dizzy and was brought to the hospital. He can only walk with a cane for about 5 minutes for maximum daily activity. His medical checkup, done two months ago, showed he had atrial fibrillation for the first time, but as he had few symptoms, he hadn’t consulted a medical institution. He had two episodes of temporary loss of consciousness and falling down in his house yesterday, which caused his family to worry and bring him to the hospital. He was conscious when he arrived, with a pulse rate of 96 beats per minute, irregular. His blood pressure was 136/78 mmHg, respiratory rate 16/min, and SpO2 97% (room air). No abnormalities were observed in his heart sounds and breath sounds. Which of the following examinations is not appropriate at this time?", "choices_en": ["Blood test", "Echocardiography test", "Holter electrocardiogram", "12-lead electrocardiogram", "Master Two-Step Exercise Test"], "answer": ["e"]}
{"problem_id": "115B28", "problem_text_en": "A 63-year-old man was found collapsed in the waiting room of the hospital by medical staff. The patient was unconscious with no spontaneous breathing and no carotid pulse was detected. Cardiopulmonary resuscitation (CPR) was initiated as cardiac arrest was suspected. The patient was immediately placed on a cardiac monitor and chest compressions were briefly interrupted to check the monitor screen, which showed a waveform with a heart rate of 20 beats per minute. The patient remained unconscious and no carotid pulse was detected. What should be the next step in management?", "choices_en": ["Tracheal intubation", "Chest compression", "Electrical defibrillation", "Intravenous atropine", "Intravenous lidocaine"], "answer": ["b"]}
{"problem_id": "115B29", "problem_text_en": "A 60-year-old man presented with sudden severe occipital headache, nausea, and vomiting. Although the headache had slightly improved since onset, it had persisted even after taking over-the-counter analgesics, leading to his visit. He was conscious and alert without any nuchal rigidity on admission. A head CT scan is shown separately. What is the most likely diagnosis?", "choices_en": ["Meningitis", "Migraine", "Brainstem hemorrhage", "Subarachnoid hemorrhage", "Acute subdural hematoma"], "answer": ["d"]}
{"problem_id": "115B30", "problem_text_en": "A 2-year-old boy was brought to the hospital by his mother with a chief complaint of fever, cough, and wheezing. He had runny nose and cough for a few days and developed a fever this morning. He appeared to be struggling to breathe, prompting the visit. The patient was alert and oriented. His vital signs were as follows: ① temperature, 37.8°C; ② blood pressure, 120/80 mmHg; ③ respiratory rate, 48 breaths/min; ④ SpO2, 98% (room air); and ⑤ capillary refill time, 1 second. Expiratory wheezing was auscultated. The patient's face appeared slightly pale, but there was no evidence of cyanosis. Redness was observed in the throat. Retraction breathing was observed in the upper sternum and intercostal spaces. Which of the underlined factors suggest a high degree of urgency?", "choices_en": ["① (This is not a word or phrase, but a numbered choice in a multiple-choice question. In this context, it has no translation.)", "Option 2 or Choice 2 (Note: This translation is context-dependent and assumes that the choices are labeled with numbers.)", "I'm sorry, it is not possible to translate the answer without the context of the multiple-choice question, as ③ could refer to any option. Please provide more information or the full question, if possible.", "Choice 4", "It is impossible to give you an accurate translation for this choice without any context. It is simply the numeral 5 in Japanese. Please provide more information."], "answer": ["c"]}
{"problem_id": "115B31", "problem_text_en": "A 42-year-old man presents with fever and cough as his primary complaints. Three days ago, he developed a cough and fever in the 38°C range. Yesterday, his symptoms worsened with the production of yellow-colored sputum, prompting him to seek medical attention. Three years ago, he was diagnosed with hypertension and has been taking antihypertensive medication. He is alert and oriented. His body temperature is 38.2°C, pulse rate 98 beats/minute and regular, blood pressure 126/68 mmHg, respiratory rate 26 breaths/minute, and oxygen saturation 93% on room air. His conjunctivae are pale. No heart murmurs are heard. Coarse crackles are heard in the lower right lung. His abdomen is flat, soft, and non-tender with no palpable hepatic or splenic edge. His laboratory results include red blood cells 2.9 million, hemoglobin 8.2 g/dL, hematocrit 26%, white blood cells 54,300 (blasts 95%, metamyelocytes granulocytes 1%, monocytes 1%, lymphocytes 3%), and platelets 32,000. His biochemical laboratory results include total protein 7.8 g/dL, albumin 3.3 g/dL, AST 38 U/L, ALT 20 U/L, LD 1,863 U/L (normal range 120-245), ALP 288 U/L (normal range 115-359), blood urea nitrogen 35 mg/dL, creatinine 0.8 mg/dL, and C-reactive protein 12 mg/dL. The sputum Gram stain showed Gram-positive diplococci. The urinary pneumococcal antigen test was positive. Chest x-ray shows consolidation in the lower right lung field. Which of the following is not an appropriate problem to include in the problem list for this patient's medical records?", "choices_en": ["Hypertension", "Thrombocytopenia", "Administration of antibiotics", "Pneumonia caused by Streptococcus pneumoniae", "Leukocytosis with left shift"], "answer": ["c"]}
{"problem_id": "115B32", "problem_text_en": "A 60-year-old man complained of having sensory disturbance in his fingers and toes. He lived alone and drank alcohol every day. His daily alcohol intake was more than 60g. He also experienced muscle weakness and a burning sensation in his extremities. Examination revealed nystagmus and heart failure. Which of the following vitamins is likely related to his symptoms?", "choices_en": ["ビタミンA", "Thiamine", "ビタミンB6 (Vitamin B6)", "ビタミンC", "ビタミンD"], "answer": ["b"]}
{"problem_id": "115B33", "problem_text_en": "A 26-year-old male resident physician reported to his supervisor that he had been exposed to fluids from a patient who tested positive for HIV antigen and antibodies during treatment. The resident physician had provided care to a 38-year-old male patient who was brought in by ambulance after a motorcycle accident resulted in multiple traumatic injuries. Initially, the patient's basic information was unavailable due to loss of consciousness, but it was later discovered that he was an HIV-positive individual by his family who had arrived at the hospital. Before the facts were known, the resident physician performed endotracheal intubation, peripheral venous access, blood sampling, and urethral catheterization. Standard precautions were taken, including wearing gloves, surgical masks, and plastic aprons. There were no injuries such as needle sticks, but the patient's urine scattered onto the resident physician's arm during the urethral catheterization. Which of the following actions by the supervisor is incorrect in response to the resident physician's exposure?\n\nNote: This translation includes some medical terminology and abbreviations that are difficult to translate, as they are specific to the Japanese medical system.", "choices_en": ["Wash the skin with running water and soap to remove urine.", "Check if there is any trauma to the skin that has urine attached to it.", "Confirm that there is no patient's blood adhering.", "Start immediate administration of antiretroviral therapy (ART) for HIV.", "Consideration of psychological reactions of resident physicians."], "answer": ["d"]}
{"problem_id": "115B34", "problem_text_en": "A 4-year-old boy was brought to the clinic by his mother with a chief complaint of cough persisting for a week. The following is a conversation between the mother and the examining physician. Physician: \"What brings you in today?\" Mother: \"My son has had a cough for a week.\" Physician: \"① Can you tell me more about the symptoms?\" Mother: \"He coughs mostly at night when he is asleep or in the early morning. He doesn't cough much during the day. He feels wheezing in his chest when he coughs.\" Physician: \"② Does he have a fever or runny nose?\" Mother: \"No, he doesn't.\" Physician: \"③ Are there any other people around him with similar symptoms?\" Mother: \"No, there aren't.\" Physician: \"④ Does he have any food or drug allergies?\" Mother: \"He's allergic to eggs.\" Physician: \"⑤ Do either of his parents have any allergies?\" Mother: \"I have atopic dermatitis.\" Which of the underlined questions is an open-ended question?\n\nThe open-ended question is \"Can you tell me more about the symptoms?\" (①)", "choices_en": ["① (this is not a translation, but rather a reference to a specific option in a multiple-choice question)", "Sorry, ② is a number and it cannot be translated without context. It would be helpful to provide additional information or the full sentence for me to give an accurate translation.", "Sorry, as a language model AI, I cannot translate a choice in a multiple-choice question with only \"③\" provided. Please provide me with more context or information so that I can assist you better.", "Sorry, ④ is a number or symbol and cannot be translated without context. It is used as a reference to an option in a multiple-choice question. Please provide more information or the entire question so I can assist you better.", "Sorry, since the choice is just a number without any context, it is impossible to translate. Please provide more information or context."], "answer": ["a"]}
{"problem_id": "115B35", "problem_text_en": "A 68-year-old woman presents with jaundice as the chief complaint. She has had fatigue for two weeks and cold symptoms with over-the-counter cold medicine use for one week. She visited the clinic because of her family's pointing out the yellowing of her eyes. She has type 2 diabetes treated with oral medication since her 50s. She is conscious, her body temperature is 36.7°C, pulse rate is 76/min regular, and blood pressure is 136/80 mmHg, respiratory rate is 12/min. There is no anemia in the palpebral conjunctiva. Yellowing is seen in the bulbar conjunctiva of the eyes. No abnormalities are heard in heart or breath sounds. The abdomen is flat and soft, and the liver is palpated 1 cm below the right costal margin. Laboratory findings include: RBCs 4.13 million/μL, Hb 13.8 g/dL, Ht 41%, WBCs 8,300/μL, platelets 200,000/μL, protein 7.1 g/dL, albumin 3.8 g/dL, TBil 5.9 mg/dL, DBil 4.7 mg/dL, AST 292 IU/L, ALT 356 IU/L, LD 577 IU/L (normal range 120-245), ALP 693 IU/L (normal range 115-359), γ-GT 352 IU/L (normal range 8-50), amylase 95 IU/L (normal range 37-160), BUN 34 mg/dL, Cr 1.3 mg/dL, glucose 118 mg/dL, HbA1c 7.8% (normal range 4.6-6.2), TC 226 mg/dL, TG 160 mg/dL, Na 138 mEq/L, K 4.3 mEq/L, Cl 101 mEq/L. Immunologically, CRP 1.9 mg/dL is detected, HBs antigen is negative, and HCV antibody is negative. What should be done first?", "choices_en": ["Abdominal contrast-enhanced CT scan", "Coombs test", "Abdominal ultrasound examination", "Tumor marker measurement", "Drug lymphocyte stimulation test"], "answer": ["c"]}
{"problem_id": "115B36", "problem_text_en": "A 38-year-old woman presents with shortness of breath upon exertion. She has been experiencing shortness of breath while walking to the nearest train station for her commute for the past three days. Yesterday, she also felt lightheaded while walking and sought medical attention. The electrocardiogram (ECG) done during her visit is shown separately. What is the classic finding on chest auscultation?", "choices_en": ["I sound cannonade", "Increased intensity of the second heart sound (S2)", "Third heart sound", "Fourth heart sound (S4)", "Pericardial friction sound"], "answer": ["a"]}
{"problem_id": "115B37", "problem_text_en": "An 82-year-old woman is hospitalized due to pneumococcal meningitis. Since she has a prolonged disturbance of consciousness, it has been decided to initiate enteral nutrition via a nasogastric tube. Her consciousness level has improved from JCS I-3 to II-10. Her body temperature is 36.8℃, pulse rate is 76/min, blood pressure is 120/80 mmHg, respiratory rate is 12/min, and SpO2 is 98% on room air. She spends her days in a semi-sitting position in bed. Which of the following statements about nasogastric tube feeding is incorrect?", "choices_en": ["Insert the patient in a left lateral position.", "Aspirate gastric contents and confirm pH.", "The initial nutritional administration is to be conducted during daytime.", "Verify the presence of air bubble sounds using a stethoscope before administering nutrition.", "Confirm the position with an X-ray after placement."], "answer": ["a"]}
{"problem_id": "115B38", "problem_text_en": "A 59-year-old female patient visited the hospital complaining of swelling in her fingers. Three weeks ago, her fingertips suddenly swelled, her nails became raised, and she began to experience some mild pain, so she decided to see a doctor. Similar symptoms began to appear in her toes a few days ago. There is no joint pain. A photo of the fingers is presented separately. What should be investigated?", "choices_en": ["Uterine cancer", "Renal cell carcinoma", "Breast cancer", "Lung cancer", "Ovarian cancer"], "answer": ["d"]}
{"problem_id": "115B39", "problem_text_en": "A 68-year-old man presents with left shoulder pain. He first experienced pain in his left shoulder two months ago and reported its worsening, prompting him to seek medical attention. He smoked 30 cigarettes per day for 40 years but quit two years ago. His pulse is regular at 60 beats per minute, blood pressure is 120/88 mmHg, and respiratory rate is 16/min. Chest X-ray (A) and contrast-enhanced chest CT scan (B) are presented separately. Lung adenocarcinoma was diagnosed by transbronchial lung biopsy. Which of the following is the most likely condition?", "choices_en": ["Left fixed and dilated pupil", "Facial edema/swelling", "Left ptosis of the eyelid", "Edema of the left upper limb", "Increased sweating on the left side"], "answer": ["c"]}
{"problem_id": "115B40", "problem_text_en": "A 20-year-old female presents to the clinic with a complaint of rash on her extremities. The rash started on her palms 2 weeks ago and has since spread to her lower legs. She denies fever, night sweats, abdominal pain, or weight loss. She reports a previous history of pelvic peritonitis due to Chlamydia 2 years ago. The patient is alert and oriented. Vital signs are within normal limits. Heart and lung sounds are unremarkable. Her abdomen is soft and flat without palpable liver or spleen. There is lymphadenopathy in the bilateral cervical, axillary, and inguinal regions. Pictures of the rash on the palms and soles are included separately. Serum RPR is positive. What is the causative pathogen?", "choices_en": ["Haemophilus ducreyi", "Staphylococcus aureus", "Streptococcus agalactiae", "Treponema pallidum", "Vibrio cholerae"], "answer": ["d"]}
{"problem_id": "115B41", "problem_text_en": "Read the following passage and answer the question below. \n\nA 59-year-old man was brought into the emergency department by ambulance due to 1 hour of continuous precordial chest pain. His present illness started 1 month ago when he noticed chest tightness during stair climbing, which disappeared after approximately 5 minutes of rest. He awakened with chest tightness early this morning, which gradually increased to the point that he was unable to walk and required ambulance transfer. His past history included hypertension treated with antihypertensive medication for the past 5 years, and he is a self-employed businessman who has smoked 20 cigarettes per day for 39 years and drinks 500 mL of beer per day. He was alert and oriented with a height of 168 cm, weight of 82 kg, temperature of 36.6°C, heart rate of 104 beats per minute, regular, blood pressure of 160/94 mmHg, respiratory rate of 24 per minute, and SpO2 of 96% on room air. He was sweating and had cold extremities. There was no cardiac murmur, but an S3 gallop was heard. The lung fields were clear, the abdomen was flat, and no hepatosplenomegaly was detected. There was no edema in the lower extremities. An electrocardiogram did not reveal any obvious ST-T changes. Acute myocardial infarction (AMI) was suspected and a measurement of serum cardiac troponin T (cTnT) was ordered. Assuming a sensitivity of 60% and a specificity of 90% from the time of onset, with a pretest probability of 80% in this patient, the result was negative. What is the probability of AMI in this patient despite the negative result?\n\nAnswer: Despite the negative result, what is the probability of AMI in this patient?", "choices_en": ["0.8", "0.72 (it is the numerical representation of a value and does not require translation)", "0.64 (It is already in numerical form, and does not require translation)", "0.54", "0.5"], "answer": ["c"]}
{"problem_id": "115B42", "problem_text_en": "Although the test results were negative, the doctor in charge determined that it was not possible to rule out the possibility of acute coronary syndrome based on the patient's medical history and symptoms, and decided to explain the situation to the patient. Which of the following statements made by the doctor confirms the patient's understanding of the explanation?", "choices_en": ["\"Do you have any preferences regarding the treatment method?\"", "\"Is there anything you don't understand from the explanation so far?\"", "\"Is it better to discuss with your family about the future?\"", "\"Why do you think you got this illness?\"", "\"Would it be all right for you to receive examination and treatment at this hospital?\""], "answer": ["b"]}
{"problem_id": "115B43", "problem_text_en": "Read the following text and answer the question below: \n\nA 36-year-old woman presented with a chief complaint of headache. Current illness: She began to see flickering lights in her vision around 7 AM on the same day, followed by headache and nausea. The headache appeared gradually and has not worsened since then. She has experienced similar headaches several times a year since she was 21 years old, and the headache usually resolves within a day. She also mentioned that she has had a headache more severe than this one. Past medical history: Appendectomy at the age of 5. Personal history: She has never smoked and consumes alcohol only occasionally. Family history: Her mother has a history of headaches. Physical exam: She is alert and oriented. Her height is 160 cm, weight is 50 kg. Body temperature is 36.5°C. Pulse rate is 72, regular. Blood pressure is 126/76 mmHg. Respiratory rate is 12. SpO2 is 98% on room air. Conjunctivae are not anemic. Her pupils are equal in size and reactive to light. Her ocular movements are normal. Her cardiac and respiratory sounds are normal. No meningeal irritation is observed. Muscle strength is preserved and no sensory disturbance is observed. Her tendon reflexes are normal and no pathological reflexes are observed. Laboratory findings: Hemoglobin is 12.2 g/dL, hematocrit is 40%, white blood cell count is 6,800/mm³, and platelet count is 160,000/mm³. AST is 29 U/L, ALT is 21 U/L, LD is 171 U/L, ALP is 350 U/L, BUN is 10 mg/dL, creatinine is 0.5 mg/dL, Na is 135 mEq/L, K is 4.2 mEq/L, Cl is 98 mEq/L, and CRP is 0.1 mg/dL. A literature search about headaches showed that the likelihood ratios for severe headaches caused by serious causes, based on the following three items, \"sudden onset,\" \"progressively worsening,\" and \"worst headache ever experienced\" were as follows:   Number of applicable items  0 → likelihood ratio 0.1  1 → likelihood ratio 2.1  2 → likelihood ratio 9.1  3 → likelihood ratio 12.5   What is an appropriate change in the post-test probability compared to the pre-test probability for the possibility that this patient has a headache caused by serious causes?\n\nAnswer: It is appropriate to calculate the post-test probability based on the likelihood ratios and the pre-test probability and the number of applicable items.", "choices_en": ["Will become higher.", "It becomes lower.", "No change.", "Incalculable.", "It varies depending on the pre-odds."], "answer": ["b"]}
{"problem_id": "115B44", "problem_text_en": "What are the characteristics of this headache?", "choices_en": ["More common in males.", "Common in elderly people.", "Accompanied by photosensitivity.", "NSAIDs are ineffective.", "The pain is relieved when moving around."], "answer": ["c"]}
{"problem_id": "115B45", "problem_text_en": "Read the following passage and answer the questions below it. \n\nA 43-year-old man was brought in by ambulance for burns. Present illness: caught on fire while cooking fried food and was rescued by his colleagues who called for an ambulance. Medical history: undergoing dietary treatment for hypertension and lipid disorder. Social history: works in a restaurant kitchen. Smokes 10 cigarettes per day for 10 years, drinks 350 mL of beer per day. Lives with his wife. Family history: both parents have hypertension. Present condition: JCS II-10. He is 170cm tall and weighs 70kg. His body temperature is 37.1℃. Heart rate 90/min, regular. Blood pressure 90/60mmHg. Respiratory rate 36/min. SpO2 93% (with a reservoir mask at 10L/min oxygen). The front of his hair and eyebrows are burned. Burns of II-III degree, 38% TBSA, are observed on his face, both upper limbs, and trunk. There was soot adhering to the mucous membranes of the mouth and throat. Hoarseness was observed. Laboratory findings: Blood tests: red blood cell count 5.5 million, Hb 17.0g/dL, Ht 49%, white blood cell count 7,200, and platelets 300,000. Blood biochemistry tests: total protein 6.1 g/dL, AST 45U/L, ALT 17U/L, LD 499U/L (standard 120-245), blood urea nitrogen 22mg/dL, creatinine 0.5mg/dL, Na 132mEq/L, K 4.4mEq/L, and Cl 99mEq/L. Which fluid is appropriate for infusion at the time of admission?\n\nAnswer: It is appropriate to administer which of the following fluids at admission?", "choices_en": ["10% saline solution", "Fresh frozen plasma", "5% glucose solution", "Lactated Ringer's solution", "25% albumin solution"], "answer": ["d"]}
{"problem_id": "115B46", "problem_text_en": "What is considered as an indication that the endotracheal tube was not properly inserted into the trachea during ventilation, after the diagnosis of airway burns and performing endotracheal intubation?", "choices_en": ["CO2 is detected in the exhalation.", "The movement of the chest is symmetrical on both sides.", "Breath sounds heard in the epigastric region.", "Equal breath sounds heard in both lung fields.", "Fogging of the inner wall of the tracheal tube during expiration."], "answer": ["c"]}
{"problem_id": "115B47", "problem_text_en": "Read the following passage and answer the question below.\n\nA 37-year-old woman presented to the hospital with a chief complaint of general fatigue and headache. Her medical history revealed that she had been experiencing fatigue for the past 6 months and headaches for the last 3 months. Over the last month, she had been taking days off from work because of overwhelming fatigue that persisted even after sleeping, and for which she had no explanation. The headaches were mild, but about 2 months ago, she was involved in a cycling accident where she collided with a wire fence while unaware of her surroundings. What is the question that would be relevant in a system review?\n\nWhat are the questions related to a system review?", "choices_en": ["\"Among the blood-related family members, is there anyone who has any illness?\"", "\"What kind of illness are you concerned about?\"", "\"Have you ever had a serious illness before?\"", "\"What type of pain is your headache?\"", "\"How is your appetite and sleep?\""], "answer": ["e"]}
{"problem_id": "115B48", "problem_text_en": "Further medical interview and examination were conducted. Current medical history: The patient reports a headache that feels like pressure and pain behind the eyes. She has not menstruated for three months and has lost 3 kg in body weight over the past 6 months due to decreased appetite. She is concerned that she may have cancer but reports no sleep disturbances. She has experienced worsening constipation for the past 3 months. Past medical history: Nothing noteworthy. Lifestyle: She is a company worker and lives with her husband and child. She has no history of smoking or drinking. Family history: Nothing noteworthy. Current symptoms: The patient is alert and oriented. She is 153 cm tall and weighs 48.2 kg, with a heart rate of 72 beats per minute and a blood pressure of 98/56 mmHg. There are no abnormalities found in the conjunctiva or eyeballs, and no thyroid nodules are found on examination. Milky discharge is observed due to nipple compression during chest examination. No abnormalities are found in the abdominal examination, but bilateral partial blindness is observed. Lab findings: Blood test shows 3.57 million red blood cells, Hb 11.1 g/dL, Hct 34%, 4,200 white blood cells per microliter, and platelets 180,000 per microliter. Blood biochemistry shows AST 21 U/L, ALT 14 U/L, LD 146 U/L (normal range 120-245), blood urea nitrogen 15 mg/dL, creatinine 0.7 mg/dL, blood glucose 78 mg/dL, Na 131 mEq/L, K 4.4 mEq/L, and Cl 97mEq/L. The endocrine test results show ACTH 9 pg/mL (normal range below 60), cortisol 1.9 μg/dL (normal range 5.2-12.6), TSH 0.76 μU/mL (normal range 0.500-5.00), FT3 2.27 pg/mL (normal range 2.30-4.30), FT4 0.51 ng/dL (normal range 0.90-1.70), LH 0.3 mIU/mL (normal range 1.8-7.6), FSH 4.4 mIU/mL (normal range 5.2-14.4), estradiol <10 pg/mL (normal range 11-230), progesterone 0.2 ng/mL (normal range below 0.5), and prolactin 198 ng/mL (normal range below 0.5). A head contrast MRI shows a pituitary adenoma. Which of the treatments is incorrect?", "choices_en": ["Tumor shrinkage can be expected with drug therapy.", "Reduce adrenal cortex steroid supplementation when experiencing a fever.", "If surgery is performed, pituitary function assessment should be done in advance.", "Hormone replacement should be initiated with adrenal cortex steroids.", "After starting the adrenal cortex steroid replacement therapy, caution should be taken for the onset of diabetes insipidus."], "answer": ["b"]}
{"problem_id": "115B49", "problem_text_en": "Read the following passage and answer the question below. \n\nA 52-year-old man presented with abdominal distension. His current symptoms began three weeks previously. Although he has an appetite, he feels full quickly and has decreased his food intake. He has no abdominal pain or nausea, and his bowel movements are regular with normal stool consistency. Over the past month, he has lost 1 kg. His medical history is unremarkable, he is an office worker, and he has never smoked cigarettes, but he drinks alcoholic beverages occasionally. His father has hypertension, and his mother has diabetes. On physical examination, he appears alert, is 174 cm tall, weighs 67 kg, and is afebrile with a temperature of 36.3°C. His pulse is 76 beats/min and regular. His blood pressure is 124/78 mmHg, and his respiratory rate is 18 breaths/min with a pulse oxygen saturation of 98% (room air). His eyes and ears are normal. His heart and lung sounds are unremarkable. His abdomen is slightly distended, and his liver is palpable 1 cm below the right costal margin, while the spleen is palpable 2 cm below the left costal margin. There is an 8 cm diameter, elastic hard, and painless mass on the left side of his umbilicus that does not change with respiration, that has no pulsations, and that cannot be moved manually. Multiple 2-3 cm diameter lymph nodes are palpable in both sides of his neck and in the groin. They are all elastic hard, freely movable, and non-tender. There is no edema in his legs. Laboratory data are as follows: Urine analysis shows negative protein and negative blood. Hematologic parameters show red blood cells 4.52 million/μL, hemoglobin 14.5 g/dL, hematocrit 41%, white blood cells 7,200/μL (neutrophils 68%, eosinophils 2%, basophils 0%, monocytes 4%, lymphocytes 26%), and platelets 370,000/μL. The serum biochemistry parameters show a total protein level of 6.5 g/dL, a serum albumin level of 4.0 g/dL, a total bilirubin level of 0.3 mg/dL, an AST level of 18 U/L, an ALT level of 16 U/L, an LD level of 765 U/L (normal range 120-245), an ALP level of 221 U/L (normal range 115-359), a γ-GT level of 28 U/L (normal range 8-50), a blood urea nitrogen level of 32 mg/dL, a creatinine level of 0.6 mg/dL, and a blood glucose level of 98 mg/dL. His carcinoembryonic antigen (CEA) level is 3 ng/mL (normal range ≤5) and his cancer antigen 19-9 (CA19-9) level is 12 U/mL (normal range ≤37). His C-reactive protein level is 0.1 mg/dL and his soluble interleukin-2 receptor level is high (5,920 U/mL; normal range 157-474). \n\nWhat are the physical examination findings in this patient?", "choices_en": ["Rebound tenderness", "Increased bowel sounds", "Dilated abdominal wall veins", "The dullness of Traube's space", "Tenderness over costovertebral angle (CVA)"], "answer": ["d"]}
{"problem_id": "115B50", "problem_text_en": "On chest and abdominal CT, tumors were found in the retroperitoneal and mediastinal regions. Which is the most important test to determine the future treatment plan?", "choices_en": ["Abdominal MRI", "FDG-PET (Fluorodeoxyglucose-Positron Emission Tomography)", "Abdominal angiography", "Histological examination from superficial lymph nodes", "CT-guided percutaneous needle biopsy of retroperitoneal tumor for cytology."], "answer": ["d"]}
