{"problem_id": "115E1", "problem_text_en": "Which of the following is not required to be documented in an admission medical treatment plan?", "choices_en": ["Medical diagnosis at the time of hospitalization.", "Estimated hospitalization expenses", "Estimated length of hospitalization", "Discharge support plan", "Tests planned during hospitalization"], "answer": ["b"]}
{"problem_id": "115E2", "problem_text_en": "Show the severity classification of chronic kidney disease. What is the index that determines the subdivision in the direction (horizontal axis) from A1 to A3?", "choices_en": ["eGFR stands for estimated glomerular filtration rate.", "Age", "Proteinuria", "Body mass index", "Average blood pressure"], "answer": ["c"]}
{"problem_id": "115E3", "problem_text_en": "Which of the following statements regarding the management and handling of narcotics in medical institutions is incorrect?", "choices_en": ["Store it in a secure facility with locks.", "The remaining injection medication should be discarded by one resident alone.", "If it is lost, report it to the governor of the prefecture.", "Record the necessary items in the medical records at the time of administration or delivery.", "A narcotic user license is required for administration or distribution."], "answer": ["b"]}
{"problem_id": "115E4", "problem_text_en": "Which of the following suggests that a patient with hypertension and obesity has entered the preparation stage for behavior change?", "choices_en": ["Can't stop eating salty pickles with every meal.", "I have been continuing to restrict my salt intake in my diet for a week.", "Has been walking every day for more than 1 year.", "I intend to start jogging after meals from tomorrow.", "I'm planning to reduce snacking from six months before my upcoming birthday."], "answer": ["d"]}
{"problem_id": "115E5", "problem_text_en": "Which of the following statements is true regarding informed consent for adults?", "choices_en": ["Consent of both oneself and family is necessary.", "The patient can withdraw consent at any time.", "Explanation about prognosis is not necessary.", "Done with the purpose of avoiding physician's liability for negligence.", "Must recommend the latest treatment options."], "answer": ["b"]}
{"problem_id": "115E6", "problem_text_en": "Which of the following statements about lumbar puncture is correct?", "choices_en": ["Patients with brain hernia are suitable candidates.", "Puncture the epidural space above the Jacoby line at the lumbar vertebral level.", "Collecting cerebrospinal fluid by suction with a syringe.", "Thinner puncture needles have a higher risk of post-dural puncture headache.", "Make the patient lie on their side and assume a fetal position by bending both knees and bringing them close to their chest while bending the head forward."], "answer": ["e"]}
{"problem_id": "115E7", "problem_text_en": "Show the text of Article 1 of the Medical Practitioners Act. \"Doctors contribute to the improvement and promotion of public health by managing medical care and health guidance, and aim to ensure the healthy lives of the people. (A)\" What should be inserted in the place of (A)?", "choices_en": ["Public health", "Social security", "Life Science", "Appropriate medical care/treatment", "Clinical medicine"], "answer": ["a"]}
{"problem_id": "115E8", "problem_text_en": "Which of the following actions by medical personnel is incorrect? The patient with impaired consciousness due to hemorrhagic shock was transported to the emergency room without a companion and determined to require emergency surgery. It was found that the patient had a history of visits to another hospital.", "choices_en": ["Attempted to contact the family before surgery.", "We discussed the necessity of an emergency surgery within the hospital.", "Inquired about medical information from a medical institution where the patient has a history of visiting.", "Used antihypertensive drug for clinical trial before obtaining consent form for participation.", "Because the blood type was unknown until the start of the transfusion, transfusion of O type Rh (-) red blood cells was performed."], "answer": ["d"]}
{"problem_id": "115E9", "problem_text_en": "What is confirmed by the Rapid Ultrasound for Trauma and Emergencies (RUSH) during the initial assessment of trauma patients?", "choices_en": ["Pneumothorax", "Fracture", "Organ damage", "Aortic diameter", "Intracavitary hemorrhage"], "answer": ["e"]}
{"problem_id": "115E10", "problem_text_en": "Which of the following statements about benign paroxysmal positional vertigo is correct?", "choices_en": ["Accompanied by hearing loss.", "It occurs predominantly in children.", "Accompanied by transient loss of consciousness.", "Showing nystagmus when changing the head position.", "Floating ear stones are derived from the semicircular canals."], "answer": ["d"]}
{"problem_id": "115E11", "problem_text_en": "Which of the following is the correct method for collecting blood culture samples from adult patients?", "choices_en": ["Collect a specimen after administering an antimicrobial agent.", "Take blood from one place for both sets.", "Perform blood collection before the disinfectant dries after disinfecting the skin at the puncture site.", "Blood collected should be placed into aerobic bottle first, followed by anaerobic bottle.", "After injecting the specimen into the bottle, shake the medium and blood in the bottle to mix it."], "answer": ["e"]}
{"problem_id": "115E12", "problem_text_en": "Which joint is measured for internal and external rotation in joint range of motion?", "choices_en": ["Shoulder joint", "Elbow joint", "Wrist joint", "Knee joint", "Ankle joint"], "answer": ["a"]}
{"problem_id": "115E13", "problem_text_en": "Which condition causes polyuria through osmotic diuresis?", "choices_en": ["Hyperglycemia", "Psychogenic polydipsia", "Nephrogenic diabetes insipidus", "Central diabetes insipidus", "Hypokalemia"], "answer": ["a"]}
{"problem_id": "115E14", "problem_text_en": "Which of the following is useful for diagnosis in peripheral nerve conduction tests?", "choices_en": ["Cubital tunnel syndrome", "Parkinson's disease", "Polymyositis", "Spinal cord injury", "Cerebral infarction (stroke)"], "answer": ["a"]}
{"problem_id": "115E15", "problem_text_en": "Which infectious disease, causing a global pandemic, was feared as the Black Death in medieval Europe?", "choices_en": ["Tuberculosis", "Cholera", "Smallpox", "Plague", "Rickettsialpox"], "answer": ["d"]}
{"problem_id": "115E16", "problem_text_en": "What should be confirmed before performing a procedure on a patient with an implanted cardiac pacemaker?", "choices_en": ["Esophageal biopsy", "FDG-PET (Fluorodeoxyglucose-Positron Emission Tomography)", "Abdominal contrast-enhanced CT", "Endoscopic ultrasonography", "Magnetic resonance cholangiopancreatography (MRCP)"], "answer": ["e"]}
{"problem_id": "115E17", "problem_text_en": "Which of the following statements is incorrect regarding bias and confounding in clinical research?", "choices_en": ["Information bias arises when obtaining information from subjects.", "Selection bias arises from the method of selecting subjects.", "Confounding factors can be adjusted for by study design.", "Confounding factors are related to both the cause and the outcome.", "Information bias can be adjusted by statistical methods."], "answer": ["e"]}
{"problem_id": "115E18", "problem_text_en": "Which of the following symptoms are included in depression?", "choices_en": ["Loss of appetite.", "Experiencing hallucinations at the time of falling asleep.", "Getting motivated only for things you like to do.", "Gives incorrect answers even for simple calculations.", "Receiving orders to commit suicide via telepathy"], "answer": ["a"]}
{"problem_id": "115E19", "problem_text_en": "Which of the following is not an appropriate measure to prevent human errors, which are a cause of medical accidents?", "choices_en": ["Training system for ensuring medical safety", "Regular review of various manuals", "Concentrating work towards capable personnel", "Hazard prediction training", "Confirming the name of the drug by pointing"], "answer": ["c"]}
{"problem_id": "115E20", "problem_text_en": "What is the composition of the intravenous solution that should be chosen for a peripherally inserted central catheter (PICC) instead of a peripheral intravenous route?", "choices_en": ["Na 154 mEq/L\n\nThis is not a choice in a multiple-choice question, but rather a measurement of the concentration of sodium (Na) in milliequivalents (mEq) per liter (L) of solution.", "Potassium 20 milliequivalents per liter", "Chloride 35 milliequivalents per liter", "Lactate 20mEq/L", "20% glucose"], "answer": ["e"]}
{"problem_id": "115E21", "problem_text_en": "Which one is internal hernia?", "choices_en": ["Inguinal hernia", "Femoral hernia", "Inguinal hernia", "Hiatal hernia", "Abdominal scar hernia"], "answer": ["d"]}
{"problem_id": "115E22", "problem_text_en": "Which of the following is correct regarding Japanese dietary intake standards?", "choices_en": ["Not applicable to individuals.", "Targeting those under 65 years old.", "Not dealing with pregnancy or lactation.", "The target range for BMI is between 18 and 20.", "It indicates standards for the intake of energy and nutrients."], "answer": ["e"]}
{"problem_id": "115E23", "problem_text_en": "Which disease does not cause urinary retention symptoms?", "choices_en": ["Kidney stones", "Cerebral infarction or stroke", "Spinal cord injury", "Parkinson's disease", "Interstitial cystitis"], "answer": ["a"]}
{"problem_id": "115E24", "problem_text_en": "What is a disease for which smoking is a causal factor?", "choices_en": ["Hypersensitivity pneumonia", "Legionella pneumonia", "Acute eosinophilic pneumonia", "Nontuberculous mycobacterial infection", "Mycoplasma pneumonia"], "answer": ["c"]}
{"problem_id": "115E25", "problem_text_en": "Which of the following correctly shows the position (1-5) of each eyeball when a patient with left oculomotor nerve paralysis looks left?", "choices_en": ["① - This is a numbered choice and it does not have a specific meaning on its own. It represents an option in a list of choices.", "This is not a multiple-choice question, it is a number in parenthesis. It is not possible to translate it without more context.", "I'm sorry, I cannot translate \"③\" without context. It is a symbol used to represent a choice in a multiple-choice question, but it does not have a specific meaning without further information.", "This is not a word or phrase that can be translated without context. It appears to be a numeral in Japanese, but its meaning can only be determined based on the information provided in the surrounding text.", "This question cannot be translated as it only contains a number (5), which has no meaning without context."], "answer": ["c"]}
{"problem_id": "115E26", "problem_text_en": "A 70-year-old man was admitted with a chief complaint of disturbance of consciousness. Subsequently, he was diagnosed with cerebral infarction and treated, but as a result of complications, he is now completely unable to communicate and has lost his swallowing function. He is unable to take food orally, and there is no prospect of improvement. Upon checking with his family, they found a document with the patient's own indication of willingness for gastrostomy. What is the most important factor to consider when deciding whether to perform gastrostomy in this patient?", "choices_en": ["Level of care required (by a patient)", "Physician's judgement/decision", "Family's wishes or Family's hope", "One's own will or intention", "Acceptance facility conditions"], "answer": ["d"]}
{"problem_id": "115E27", "problem_text_en": "A 40-year-old woman complains of itching in her external genital area. She has had itching and a mucous discharge for one month. She has no pain. Her height is 158 cm, weight 64 kg. Her body temperature is 36.5°C, pulse rate is 72 beats/minute and regular, blood pressure is 124/76 mmHg, and respiratory rate is 18 breaths/minute. On pelvic examination, there are no abnormalities observed in the uterus or adnexa bilaterally. The discharge is yellow and frothy. There is no redness of the external genitalia. What is the most likely diagnosis?", "choices_en": ["Atrophic vaginitis", "Bacterial vaginosis", "Candidal vaginitis", "Trichomonas vaginitis (vaginal inflammation)", "Chlamydia cervicitis"], "answer": ["d"]}
{"problem_id": "115E28", "problem_text_en": "A 53-year-old man presented with consciousness disorders after surgery. He was diagnosed with diabetes 10 years ago and was taking oral hypoglycemic drugs. He underwent surgical resection for esophageal cancer and was started on intravenous insulin therapy after surgery. Although his postoperative course was stable, he developed consciousness disorders on the second postoperative day, and a simple blood glucose test revealed a value of 32 mg/dL. Upon checking the instructions for insulin administration from the attending physician, it was found that 10 units of rapid-acting insulin were to be mixed into the intravenous fluid bag for maintenance infusion, but the ward physician who was in charge had actually added 100 units of insulin. The attending physician administered intravenous infusion of 50% glucose, and the patient's consciousness was restored, and his blood glucose level also increased to 100 mg/dL. What would be an appropriate remark for the attending physician to make to the ward physician in charge?", "choices_en": ["\"A report to the risk manager is necessary\"", "\"It is something that you caused, so it's not related to me.\"", "\"To avoid causing unnecessary worries to the family, let's refrain from contacting them.\"", "\"Please write in the medical record that the initial instructions were to mix 10 units.\"", "\"If the patient asks, let's answer that the cause of the disturbance of consciousness is unknown\""], "answer": ["a"]}
{"problem_id": "115E29", "problem_text_en": "A 21-year-old woman comes to the hospital seeking medical examination for health damages caused by sexual violence. Last night she went to a bar alone. She was approached by a group of men at the next table and, while talking with them over cocktails, suddenly became dizzy. When she realized at 2am, she was lying on a hotel bed. From the situation, it was suspected that she had been sexually assaulted while unconscious. After returning home, she was accompanied by her mother to the emergency room at 5am at her mother's strong urging. She is alert and coherent. She is calm and composed, saying \"It's my fault for drinking with strangers.\" Which of the following is inappropriate as a physician's words in this case?", "choices_en": ["\"You don't need to blame yourself\"", "\"It must have taken courage to come to the hospital, right?\"", "\"Do you wish to receive examination by a gynecologist?\"", "\"Even though you were in pain, you spoke well.\"", "\"It's not a big deal, so you should forget it quickly.\""], "answer": ["e"]}
{"problem_id": "115E30", "problem_text_en": "A 14-year-old girl is being asked to participate in a clinical research study that involves drawing blood. The patient has no intellectual or cognitive impairments. Which of the following statements is incorrect?", "choices_en": ["Explain to the patient so that they can understand.", "It is necessary to obtain informed consent.", "A written consent requires a signature, seal or handwritten name.", "The degree of invasiveness caused by blood sampling is determined by the ethics committee.", "Participation in the research is possible if the individual agrees, even if the guardian does not agree."], "answer": ["e"]}
{"problem_id": "115E31", "problem_text_en": "An 83-year-old woman underwent surgery for a right femoral neck fracture. She was alert on the night of the surgery, but exhibited strange behavior the following night, such as stating that she wanted to go home to make her husband's food despite him having passed away. She has not previously been diagnosed with dementia. Which of the following statements about this condition is incorrect?", "choices_en": ["Accompanied by hallucinations.", "It can occur during the day as well.", "Caused by bodily illness.", "Rapidly fluctuating level of consciousness.", "Benzodiazepine drugs are effective."], "answer": ["e"]}
{"problem_id": "115E32", "problem_text_en": "An 84-year-old man presented with fever and cough as his chief complaints and was diagnosed with aspiration pneumonia, leading to hospitalization. He is alert and oriented with a height of 173 cm, weight of 60 kg, body temperature of 38.5℃, heart rate of 96 beats per minute, regular rhythm, blood pressure of 120/80 mmHg, respiratory rate of 22 breaths per minute, and SpO2 of 96% (with 2 L/minute oxygen administration via nasal cannula). Upon admission, multiple professionals were involved in supporting his treatment for aspiration pneumonia. Which combination of professionals and their job duties involved in this patient's care is inaccurate?", "choices_en": ["Nurse prescribing of antibiotics", "Registered dietitian - assessment of the dietary status.", "Speech therapist - Swallowing training", "Pharmacist - Consideration of the formulation of oral medication.", "Physical therapist --------- respiratory rehabilitation."], "answer": ["a"]}
{"problem_id": "115E33", "problem_text_en": "A 2-month-old boy was brought to the hospital by his mother with complaints of right inguinal swelling and vomiting. Two weeks ago, she noticed a swelling in his right inguinal region during bathing, but it disappeared after a while. The previous evening, during a diaper change, she noticed that it was swollen again. Today, the swelling from the right inguinal region to the scrotum was larger than the day before. The baby was brought to the hospital in the afternoon due to frequent vomiting after breastfeeding. He appeared to be in poor spirits. He had a height of 54 cm, a weight of 4.4 kg, and a body temperature of 37.3°C. His heart rate was 150 beats per minute, regular. His blood pressure was 106/50 mmHg, and his respiratory rate was 40 breaths per minute. His abdomen was distended. A swelling was observed from the right inguinal region to the scrotum, and he was uncomfortable with palpation. An external photo (A) is shown separately. Blood test shows a red blood cell count of 4.2 million, Hb of 12.3 g/dL, Ht of 36%, WBC of 18,000, and platelets of 220,000. Biochemical test shows a urea nitrogen level of 10 mg/dL, a creatinine level of 0.5 mg/dL, a Na level of 135 mEq/L, a K level of 4.2 mEq/L, a Cl level of 102 mEq/L, and a CRP level of 5.0 mg/dL. An abdominal X-ray photograph (B; supine position) is shown separately. Which of the following is the appropriate response?", "choices_en": ["Scrotal puncture or aspiration.", "Observation (watchful waiting)", "Emergency surgery", "Manual therapy or manual manipulation", "Antibacterial drug administration"], "answer": ["c"]}
{"problem_id": "115E34", "problem_text_en": "A 37-year-old primigravida (G1P0) at 26 weeks of gestation was referred for a abnormal blood sugar test result. She has been attending antenatal check-ups since early pregnancy. At 24 weeks of gestation, she was referred for further evaluation after a 50g glucose challenge test showed a blood sugar level of 156mg/dL. She has no significant medical history. Her height is 156cm, weight is 75kg (pre-pregnancy 69kg). Her temperature is 37.0°C, pulse rate is 76 beats per minute and regular, blood pressure is 122/76 mmHg, and respiratory rate is 18 breaths per minute. Urinalysis showed negative protein and (+) glucose. A 75g oral glucose tolerance test (OGTT) performed after the referral showed a fasting blood sugar level of 90mg/dL, 1 hour value of 192mg/dL, and 2-hour value of 138mg/dL. What is the first step in managing this patient?", "choices_en": ["Physical therapy", "Observation/follow-up", "Diet therapy", "Insulin injection/administration", "Oral hypoglycemic agent administration"], "answer": ["c"]}
{"problem_id": "115E35", "problem_text_en": "A 38-year-old man developed low back pain and pain radiating down the right leg after bending down to pick up some papers that had fallen on the floor at work. There is no significant medical history. He is 165 cm tall and weighs 58 kg. His body temperature is 36.7℃, and his pulse rate is 80 beats per minute and regular. No abnormalities were noted on lumbosacral X-ray, but lumbar MRI revealed herniation of the intervertebral disc between the fourth and fifth lumbar vertebrae on the right side. Which of the following is not present in this patient?", "choices_en": ["Intermittent claudication", "Abnormal sensation in the perineal area", "Numbness of the outer side of the right lower leg.", "Decreased dorsiflexion muscle strength of the right hallux", "Positive for straight leg raise test on the right lower limb"], "answer": ["b"]}
{"problem_id": "115E36", "problem_text_en": "A 78-year-old woman presents with left anterior chest pain. She reports experiencing sudden-onset pain in her left anterior chest at around 6 a.m. while brushing her teeth. This symptom was the first time and presented as a tightening pain across the entire left anterior chest. She felt a radiating pain from the throat to the left shoulder and had cold sweats. While resting horizontally, the symptoms disappeared in about 20 minutes. Worried, she visited the hospital with her family at 10:30 a.m. Her body temperature is 36.5°C. Her pulse rate is 76 beats/min and regular, blood pressure is 100/78 mmHg, respiratory rate is 18 breaths/min, and SpO2 is 98% on room air. There are no abnormalities in her heart sounds or breath sounds, and her abdomen is normal on examination. An immediately conducted electrocardiogram is shown separately. A heart echo study showed a slight decrease in wall motion from the anterior wall to the apex. What should be confirmed first at this time?", "choices_en": ["FDG-PET", "Exercise stress test electrocardiogram", "Myocardial scintigraphy", "Cardiac troponin T", "Brain natriuretic peptide (BNP)"], "answer": ["d"]}
{"problem_id": "115E37", "problem_text_en": "A 23-year-old man presents with a chief complaint of cough and hemoptysis. He began to have dry cough 3 days ago, and it became severe enough to cause paroxysmal coughing. He came to the hospital because he was worried after seeing a small amount of hemoptysis during coughing this morning. He has no nausea or vomiting and has good appetite. He has no history of weight loss or night sweats. He has no history of tuberculosis exposure or overseas travel in the past month. He has no significant medical history, no history of smoking, and no history of alcohol consumption. His consciousness is clear. During examination, he coughs occasionally, but there is no hemoptysis. His height is 160 cm, weight is 72 kg. His body temperature is 36.1 degrees Celsius. His pulse rate is 72 beats per minute, regular. His blood pressure is 122/58 mmHg. His respiratory rate is 12 breaths per minute. There is no abnormality in the oral cavity or pharynx, and there is no swelling of the cervical lymph nodes. No abnormality is detected in his heart sound and breath sounds. Based on the information given, what is the most likely diagnosis at this point?", "choices_en": ["Lung cancer", "Bronchial asthma", "Acute bronchitis.", "Goodpasture syndrome", "Eosinophilic granulomatosis with polyangiitis (Churg-Strauss syndrome)"], "answer": ["c"]}
{"problem_id": "115E38", "problem_text_en": "A 9-month-old boy is hospitalized due to respiratory distress and cyanosis caused by an RS virus infection. He was born at 40 weeks of gestation with a birth weight of 3,250 g. When the alarm on the respiratory and heart rate monitor sounded, the doctor went to the room and noticed that the infant's color was bad, and took measures to open the airway. A peripheral venous route was secured and preparations for resuscitation were made. The heart rate was 50 beats/min and regular, and the respiratory rate was 10 breaths/min. The SpO2 was at 60% (under 40% oxygen administration via an oxygen tent). Breath sounds were weak bilaterally with wheezing. The pulse in the right brachial artery was palpable. What is the immediate treatment that needs to be performed?", "choices_en": ["Defibrillation", "Chest compression", "Intravenous adrenaline", "Increase in inhaled oxygen concentration", "Bag-valve-mask ventilation"], "answer": ["e"]}
{"problem_id": "115E39", "problem_text_en": "A 70-year-old woman visited the hospital with the chief complaint of lower back pain. She underwent a mastectomy for right breast cancer a year ago, but subsequent metastases were detected in her liver, lungs, and lumbar spine. She opted not to undergo drug-based anticancer treatment and wished to receive care at home without visiting the hospital. She became aware of dull pain in her right lower back a month ago, and she visited the hospital one week ago to increase the dosage of medication. Although NSAIDs were administered for pain relief, she could not sleep due to the pain, and today during her visit, morphine sulfate was added. Which of the following symptoms does not need to be carefully monitored in the future?", "choices_en": ["Jaundice", "Nausea", "Diarrhea", "Paralysis of lower limbs", "Difficulty breathing"], "answer": ["c"]}
{"problem_id": "115E40", "problem_text_en": "A 60-year-old man was brought in by an ambulance complaining of right-sided paralysis and speech disorder. He is currently being treated for hypertension with oral medication. He noticed poor movement of his right hand and foot, and difficulty in speaking one hour after waking up this morning. He is conscious with a Japan Coma Scale of I-1. His body temperature is 36.5°C, pulse rate is 90/min and regular, blood pressure is 160/94 mmHg, respiratory rate is 16/min, and SpO2 is 96% on room air. He has motor aphasia. The muscle strength of both upper and lower limbs is 3 in manual muscle testing. His electrocardiogram shows sinus rhythm. His chest X-ray shows no abnormalities. His head CT scan shows no abnormalities. His laboratory data are as follows: Red blood cells: 4.5 million/mL, Hb: 14.2 g/dL, Hct: 42%, white blood cells: 8,800 cells/mL, platelets: 180,000/mL, PT-INR: 1.0 (reference range: 0.9-1.1). Blood chemistry: Blood urea nitrogen: 15 mg/dL, Creatinine: 0.8 mg/dL, Glucose: 102 mg/dL, Na: 140 mEq/L, K: 3.7 mEq/L, Cl: 99 mEq/L. Diffusion-weighted imaging of cranial MRI performed before the results of blood examination showed a mildly high-intensity area with a limited range in the left middle cerebral artery area. 90 minutes have passed since the onset of symptoms. What medication should be rapidly administered by intravenous infusion first?", "choices_en": ["Beta blockers", "Verapamil", "Potassium chloride", "Adrenal cortex steroid", "tissue plasminogen activator (t-PA)"], "answer": ["e"]}
{"problem_id": "115E41", "problem_text_en": "Read the following passage and answer the questions below. A 75-year-old man presented with dyspnea as the chief complaint. His medical history revealed he had traveled by airplane for a 2-day trip and returned 2 days prior. He sat for approximately 3 hours on the plane. The day after returning, he developed pain and edema in his right lower leg. On the morning of the day when he presented to the clinic, he suddenly experienced dyspnea on exertion and sought treatment. He has a history of gastric cancer that was treated with total gastrectomy when he was 60 years old. He remained recurrence-free during the 5-year follow-up period and discontinued his regular outpatient visits. From age 70, he has been receiving treatment for hypertension and diabetes with antihypertensive and oral hypoglycemic agents. He has no known allergies. He smoked 40 cigarettes per day for 40 years and then quit 15 years ago. He drinks one cup of sake per week. He lives with his wife, who has no recent history of illness. He has no eating habits or preferences. There is no noteworthy family history. On physical examination, he is alert and oriented. His height is 162 cm, and his body weight is 60 kg. His body temperature is 36.1°C, his heart rate is 112 beats/min and regular, his blood pressure is 90/55 mmHg without any differences between the left and right sides, his respiratory rate is 28 breaths/min, and his SpO2 is 91% on room air. His conjunctiva is pale, and sclera is not jaundiced. No abnormalities are found in the mouth or pharynx. Jugular venous distention is observed. The thyroid gland and cervical lymph nodes are not palpable. No abnormal heart sounds or breath sounds are heard. The abdomen is flat, soft, with a midline surgical scar. The right lower leg is swollen with pitting edema, warmth, and redness. Both dorsalis pedis pulses are palpable. Laboratory findings are as follows: urine analysis: negative for protein, glucose, ketone, and occult blood; hemoglobin: 8.4 g/dL; hematocrit: 33%; mean corpuscular volume (MCV): 132 fL; leukocyte count: 10,200/mm3 (80% neutrophils, 1% eosinophils, 1% basophils, 2% monocytes, and 16% lymphocytes with immature granulocytes); platelet count: 100,000/mm3; prothrombin time/international normalized ratio (PT/INR): 1.0 (reference range: 0.9-1.1); activated partial thromboplastin time (APTT): 31.6 seconds (reference range: 25.3-32.2); D-dimer: 2.3 µg/mL (reference range: less than 1.0 µg/mL); serum total bilirubin: 1.0 mg/dL; aspartate aminotransferase (AST): 21 U/L; alanine aminotransferase (ALT): 9 U/L; lactate dehydrogenase (LDH): 306 U/L (reference range: 120-245 U/L); alkaline phosphatase (ALP): 187 U/L (reference range: 115-359 U/L); creatine kinase (CK): 60 U/L (reference range: 30-140 U/L); blood urea nitrogen (BUN): 11 mg/dL; creatinine: 0.6 mg/dL; glucose: 114 mg/dL; glycated hemoglobin (HbA1c): 6.9% (reference range: 4.6-6.2%); sodium: 140 mEq/L; potassium: 4.1 mEq/L; chloride: 105 mEq/L; calcium: 8.4 mg/dL; and C-reactive protein (CRP): 2.9 mg/dL. Electrocardiogram (A) and chest radiograph with an anterior-posterior view (B) are shown separately. What is the diagnosis?", "choices_en": ["Acute coronary syndrome", "Fat embolism", "Pericarditis", "Aortic dissection", "Pulmonary embolism"], "answer": ["e"]}
{"problem_id": "115E42", "problem_text_en": "After being admitted, the patient's respiratory status stabilized. When the patient resumed walking around the ward, they fell in the bathroom while washing their face. Further inquiry revealed that the patient had experienced dizziness in the dark at night before. What is the expected finding on examination?", "choices_en": ["Resting tremor", "Ocular motor dysfunction", "Positive Horner's sign.", "Positive Romberg sign", "Positive Chvostek's sign"], "answer": ["d"]}
{"problem_id": "115E43", "problem_text_en": "Please read the following passage and answer the following question.  \nAn 84-year-old man came to the hospital with fever and left chest pain as the main complaints. Current medical history: He has had sore throat and low-grade fever of around 37 degrees Celsius since 5 days ago, took over-the-counter cold medicine, but the fever persisted. Gradual, persistent left chest pain appeared since 2 days ago. The pain worsens with breathing. This morning, he became more concerned as the left chest pain has become stronger and thus came to receive medical attention. There is no cold sweat or loss of consciousness. Past medical history: He has been taking anticoagulants, angiotensin-converting enzyme (ACE) inhibitors, and diuretics for atrial fibrillation with bradycardia, second-degree mitral valve regurgitation, heart failure, and hypertension. He received a pacemaker implantation surgery for bradycardia-type atrial fibrillation 5 years ago. Family history: His father died of cerebral hemorrhage at the age of 85, and his mother died of gastric cancer at the age of 80. Current findings: Conscious, height 158 cm, weight 56 kg. Body temperature 37.6 degrees Celsius. Pulse rate 60/min, regular. Blood pressure 120/80 mmHg. Respiratory rate 18/min. SpO2 98% (room air). Dullness on percussion, decreased breath sounds, and pleural friction sounds were heard in the left lower chest. There was no tenderness in the chest. The heart sounds include an S3 and a Levine 3/6 holosystolic murmur that is strongest at the apex. The ECG (A) and chest X-ray image (B) are shown separately. Which of the following is a correct finding on the ECG?", "choices_en": ["Sinus rhythm", "Ventricular fibrillation", "Ventricular pacing", "Complete right bundle branch block", "Complete atrioventricular block"], "answer": ["c"]}
{"problem_id": "115E44", "problem_text_en": "Here are the test results: Urinalysis: protein (-), glucose (-). Blood test: RBC count 4.5 million/uL, Hb 13.3 g/dL, Ht 40%, WBC count 9,800 (2% segmented neutrophils, 58% banded neutrophils, 3% eosinophils, 1% basophils, 8% monocytes, 28% lymphocytes), platelet count 180,000/uL. Biochemical test: AST 36 U/L, ALT 38 U/L, LD 263 U/L (normal range 120-245), CK 88 U/L (normal range 30-140), blood urea nitrogen 12 mg/dL, creatinine 0.8 mg/dL. CRP 8.2 mg/dL. What is the most likely condition?", "choices_en": ["Pneumothorax", "Pleurisy", "Aortic dissection", "Pulmonary embolism", "Viral myocarditis"], "answer": ["b"]}
{"problem_id": "115E45", "problem_text_en": "Read the following passage and answer the question below. \n\nA 28-year-old female was brought in by ambulance due to loss of consciousness. Medical history: She was found lying on her back in her room by her friend. The friend called an ambulance since she responded poorly. Her friend had argued with her over the phone three hours earlier, during which she had talked about wanting to die. After that, the friend was unable to contact her. When the ambulance arrived, there were many empty pill packets in the cupboard of her room. Past history: She has been diagnosed with depression and has been taking tricyclic antidepressants and benzodiazepine hypnotics for three months. A month ago, she was urgently admitted to another hospital due to loss of consciousness caused by overmedication. Lifestyle: She has no history of smoking or drinking. She has been working in an administrative position, and since being transferred to another department six months ago, she has felt more stressed. Family history: Nothing noteworthy. Current symptoms: Her level of consciousness is JCS III-100. She is 158 cm tall and weighs 45 kg. Her temperature is 36.7 ℃. Her heart rate is 108 bpm and regular. Her blood pressure is 108/60 mmHg. Her respiratory rate is 24 breaths/min. Her SpO2 is 91% (with a reservoir mask and 10 L/min of oxygen administration). She has strong hypopharyngeal muscle weakness and is breathing in a snoring manner. Her skin is somewhat dry. There is no abnormality in the conjunctiva or globe of the eye. The pupil diameter is 6.0 mm in both eyes and the light reflex is delayed in both. No jugular vein distension or palpable thyroid nodules or cervical lymph nodes are observed. There is no abnormality in the heart sounds. The abdomen is flat, soft, and the liver and spleen are not palpable. Bowel sounds are somewhat weak. There is no paralysis in the limbs and tendon reflexes are normal. The electrocardiogram shows sinus rhythm without an arrhythmia, but the QRS width is widened and the QT interval is prolonged. No ST-T changes are observed. What treatment should be performed immediately?\n\nAnswer: The patient should have gastric lavage immediately.", "choices_en": ["Gastric lavage", "Tracheal intubation", "Atropine intravenous injection", "Intravenous furosemide", "Intravenous prednisolone"], "answer": ["b"]}
{"problem_id": "115E46", "problem_text_en": "Which of the following does not match the signs of aspiration pneumonia suspected by examination?", "choices_en": ["Dullness on chest percussion", "Subcutaneous crepitus on chest palpation", "Visible vomitus residue in the oral cavity by inspection (visual observation)", "Detection of coarse crackles by auscultation", "Decreased breath sounds on auscultation"], "answer": ["b"]}
{"problem_id": "115E47", "problem_text_en": "Read the following passage and answer the following question. A 75-year-old man was brought in by ambulance due to fever, abdominal pain, and diarrhea. Past medical history: He was admitted 10 days ago for cellulitis of the left lower leg and received intravenous antibiotics, which subsequently improved, and was switched to oral antibiotics and discharged 4 days ago. Two days ago, he developed fever, abdominal pain, and watery diarrhea five or more times a day. His wife called an ambulance because he had difficulty taking food orally and was unable to move. He has no recent history of consuming food that could cause food poisoning, and no one around him has the same symptoms. He has a history of hypertension and has been taking antihypertensive medication since his 50s. He was diagnosed with type 2 diabetes at the age of 66 and has been treated with insulin for the past year. Lifestyle: Two-person household with his wife. He has never smoked and drinks alcohol on occasion. Family history: His brother is undergoing treatment for diabetes. Presenting symptoms: He is alert and oriented. His height is 168 cm, weight is 73 kg. His body temperature is 38.6℃. His heart rate is 120/min, regular. Blood pressure is 136/70 mmHg. His respiratory rate is 20/min. His SpO2 is 96% (room air). His skin is less supple. His conjunctiva and eyeball are normal. His oral cavity is dry. His heart and lung sounds are normal. His abdomen is flat and soft, and the liver and spleen cannot be palpated. There is tenderness in the lower abdomen, but no rebound tenderness. Bowel sounds are increased. There is no redness or warmth in his lower limbs. Laboratory data: Complete blood count: Red blood cells 4.9 million, Hb 14.3 g/dL, Ht 42%, white blood cells 18,200 (neutrophils 84%, eosinophils 1%, monocytes 3%, lymphocytes 12%), platelets 200,000. Blood biochemistry: Total protein 6.2 g/dL, albumin 3.8 g/dL, total bilirubin 0.4 mg/dL, AST 30 U/L, ALT 38 U/L, urea nitrogen 40 mg/dL, creatinine 1.8 mg/dL, uric acid 9.6 mg/dL, glucose 158 mg/dL. CRP 4.3 mg/dL. Which infection prevention measure is improperly performed during the examination?", "choices_en": ["Consultation in a private room", "Wearing of goggles during rectal examination", "Wearing disposable gowns upon entering the room", "Wearing a surgical mask when collecting a stool sample", "Hand disinfection with sodium hypochlorite after examination"], "answer": ["e"]}
{"problem_id": "115E48", "problem_text_en": "Amongst tests that use stool samples, which one is the most useful for diagnosis?", "choices_en": ["Fat staining", "Occult blood", "Parasitic eggs", "Detection of toxins", "Culture (of cells, bacteria, etc.)"], "answer": ["d"]}
{"problem_id": "115E49", "problem_text_en": "Read the following passage and answer the question below. \n\nA 68-year-old man presents with dizziness as the main complaint. Present history: The patient noticed feeling dizzy upon waking this morning, so he came for a consultation. Past history: Two years ago, he was diagnosed with diabetes at a medical clinic near his home, but has not sought treatment since then. Personal history: He lives with his eldest son and his son's wife. He has an erratic diet, with a strong preference for sweets and irregular meals, often consuming large amounts of alcohol at izakayas (Japanese bars). Present condition: Consciousness is clear. He is 165 cm tall and weighs 70 kg. Body temperature is 36.2°C. Pulse rate is 104 bpm and regular. Blood pressure is 104/64 mmHg. Respiratory rate is 20/min. There are no abnormalities in the conjunctivas or eyeballs, and no nystagmus can be observed. Heart and lung sounds are normal. The abdomen is flat and soft, and the liver and spleen are not palpable. There is no muscle weakness and no ataxia of the limbs or trunk. No abnormalities are observed in standing or walking, but the Achilles tendon reflexes on both sides are absent. Examination findings: At the time of consultation, blood glucose measured by a simple glucometer was 350 mg/dL. The patient asked if he still had diabetes. What is the physician's appropriate response? \n\nThe physician's appropriate response would be to explain to the patient that his high blood glucose levels confirm that he still has diabetes and that he should begin proper treatment as soon as possible.", "choices_en": ["\"If left as is, you will go blind.\"", "\"Immediate treatment with insulin is necessary.\"", "\"Why did you leave it (the situation) alone even though you knew about it?\"", "\"How do you understand diabetes?\"", "\"If you are unable to follow the physician's instructions, there is no need to continue outpatient visits\"."], "answer": ["d"]}
{"problem_id": "115E50", "problem_text_en": "What is appropriate for a physician to explain when starting diabetes treatment?", "choices_en": ["\"Let's exercise immediately and lose weight.\"", "\"The introduction of drug therapy is decided by the pharmacist.\"", "\"May I explain the condition to your family members?\"", "\"The nurse is responsible for lifestyle guidance, so please do not ask the doctor.\"", "\"Please follow the physician's advice for treatment, as it is absolute.\""], "answer": ["c"]}
