{"problem_id": "115A1", "problem_text_en": "What is typically observed in patients with scleroderma renal crisis?", "choices_en": ["Aortic aneurysm", "Sacroiliitis", "Salmon-pink rash", "Nephrotic syndrome", "Thrombotic microangiopathy"], "answer": ["e"]}
{"problem_id": "115A2", "problem_text_en": "Which site is appropriate for placement of the drain tip for intra-abdominal drainage following sigmoid colon resection?", "choices_en": ["Douglas pouch/rectouterine pouch", "Morrison's pouch (subhepatic space)", "Winslow's foramen (also known as epiploic foramen)", "Left subphrenic", "Right subphrenic"], "answer": ["a"]}
{"problem_id": "115A3", "problem_text_en": "Which of the following statements about renal anemia is correct?", "choices_en": ["The reticulocyte count increases.", "Indirect bilirubin levels in the blood will elevate.", "Mean corpuscular hemoglobin concentration is within normal range.", "The hemoglobin level in the blood decreases from stage G2 of chronic kidney disease.", "Measurement sensitivity of blood erythropoietin levels falls below detectable levels from early onset of the disease."], "answer": ["c"]}
{"problem_id": "115A4", "problem_text_en": "What is the target antigen of the antibody drug used for unresectable malignant melanoma?", "choices_en": ["IL-17 (Interleukin-17)", "EGF receptor", "IL-6 receptor", "PD-1 (programmed cell death 1)", "VEGF (vascular endothelial growth factor)"], "answer": ["d"]}
{"problem_id": "115A5", "problem_text_en": "Which of the following conditions is associated with an elevation in serum calcitonin levels in thyroid nodules?", "choices_en": ["Medullary carcinoma", "Nipple cancer", "Follicular carcinoma", "Subacute thyroiditis", "Adenomatous goiter or nodular goiter"], "answer": ["a"]}
{"problem_id": "115A6", "problem_text_en": "Which of the following statements is incorrect regarding Zika virus infection?", "choices_en": ["蚊がジカウイルスを媒介する。", "潜伏期は通常14日までです。", "通常、症状は最大7日間持続します。", "妊娠中の感染が新生児の小頭症を引き起こす場合があります。", "Acyclovirは治療に使用されます。"], "answer": ["e"]}
{"problem_id": "115A7", "problem_text_en": "Which of the following defines the hernia gate as the Hesselbach's triangle, which is surrounded by the inferior epigastric artery, the outer edge of the rectus abdominis muscle, and the inguinal ligament?", "choices_en": ["Femoral hernia", "Direct inguinal hernia", "Inguinal hernia (internal)", "Closing site hernia (Also known as a ventral hernia or incisional hernia)", "Bochdalek hernia"], "answer": ["c"]}
{"problem_id": "115A8", "problem_text_en": "Which of the following is not important when evaluating hepatic reserve in a patient scheduled for liver resection due to hepatocellular carcinoma?", "choices_en": ["Serum albumin level", "ICG test (15-minute value)", "Total serum bilirubin level", "Prothrombin time", "Alpha-fetoprotein (AFP) value"], "answer": ["e"]}
{"problem_id": "115A9", "problem_text_en": "Which of the following conditions is associated with hemolytic anemia?", "choices_en": ["Abnormal hemoglobinopathy", "Hereditary spherocytosis", "Autoimmune hemolytic anemia", "Paroxysmal Cold Hemoglobinuria (PCH)", "Thrombocytopenic purpura (TTP)"], "answer": ["e"]}
{"problem_id": "115A10", "problem_text_en": "Which of the following statements is correct about Takayasu arteritis in our country?", "choices_en": ["Common among middle-aged men.", "High correlation with smoking.", "Prone to associated with dislocated crystalline lens.", "More likely to have inflammation of the superficial temporal artery.", "Prone to lesions in the aorta and its branches."], "answer": ["e"]}
{"problem_id": "115A11", "problem_text_en": "Which of the following are the treatments for acute cluster headache? Select two.", "choices_en": ["Inhalation of pure oxygen", "Oral intake of NSAIDs (Nonsteroidal anti-inflammatory drugs)", "Oral administration of valproic acid", "Subcutaneous injection of triptan", "Oral administration of tricyclic antidepressants"], "answer": ["a", "d"]}
{"problem_id": "115A12", "problem_text_en": "Which of the following are ocular complications of rheumatoid arthritis? Select two.", "choices_en": ["Keratitis", "Retinitis", "Glaucoma", "Proptosis (bulging of the eye)", "Iritis"], "answer": ["a", "e"]}
{"problem_id": "115A13", "problem_text_en": "Which of the following are observed in hemochromatosis? Select two.", "choices_en": ["Cirrhosis", "Hypertension", "Renal failure", "Diabetes", "Skin depigmentation"], "answer": ["a", "d"]}
{"problem_id": "115A14", "problem_text_en": "Which of the following symptoms are observed in decompression sickness? Select two.", "choices_en": ["Joint pain", "Osteonecrosis", "Osteomyelitis", "Meniscal injury", "Osteochondritis dissecans"], "answer": ["a", "b"]}
{"problem_id": "115A15", "problem_text_en": "Which of the following drugs can lead to physical dependence? Select two.", "choices_en": ["Cannabis", "Cocaine", "Morphine", "Methamphetamine", "Phenobarbital"], "answer": ["c", "e"]}
{"problem_id": "115A16", "problem_text_en": "A 34-year-old puerperal woman is currently hospitalized on the 0th day postpartum. She was determined to be blood type O RhD (-) in early pregnancy blood tests. She has no history of blood transfusion, and no notable family history. An indirect Coombs test at 26 weeks of gestation was negative, and she received anti-D immunoglobulin at 28 weeks of gestation. She was admitted in natural labor at 39 weeks 4 days gestation and gave birth to a 2,760g baby boy by normal vaginal delivery. The newborn's blood type was determined to be O RhD (+). Which of the following is an appropriate management for the mother?", "choices_en": ["Medication administration will not be carried out.", "Albumin administration", "Haptoglobin administration", "Administration of adrenal cortex steroids", "Administration of anti-D immunoglobulin"], "answer": ["e"]}
{"problem_id": "115A17", "problem_text_en": "A 22-year-old woman came to the clinic for further examination due to suspected mild dysplasia (Cervical Intraepithelial Neoplasia) found in the cervical cancer screening test. This was her first time undergoing cervical cancer screening. No abnormalities were found in the uterus and ovaries during internal examination and transvaginal ultrasound examination. No abnormalities were observed in the cervix by colposcopy. What should be the first step in treating this patient?", "choices_en": ["Total hysterectomy", "Antiviral drug administration", "Cervical conization", "Tumor marker measurement", "Colposcopy examination."], "answer": ["e"]}
{"problem_id": "115A18", "problem_text_en": "A 1-year-old boy is brought to the clinic by his mother with a chief complaint of fever over 39℃ and pus on his diapers. Five months ago, he had a fever over 39℃ that lasted for 3 days, and was treated at a clinic near his home. Urinalysis shows proteinuria 1+, 5-8 red blood cells/HPF, and 30-50 white blood cells/HPF in the sediment. Blood tests show 4.3 million red blood cells, Hb 12.3g/dL, Ht 38%, and white blood cells 13,800. Biochemical analysis of blood shows urea nitrogen 10mg/dL and creatinine 0.9mg/dL. A voiding cystourethrogram is shown separately. What is the most likely condition that the patient is suffering from?", "choices_en": ["Renal abscess", "Orchitis", "Horseshoe kidney", "Vesicoureteral reflux", "Ureteral ectopia"], "answer": ["d"]}
{"problem_id": "115A19", "problem_text_en": "A 63-year-old man presents with chief complaints of respiratory distress and fever. He has had a dry cough for the past month, which gradually worsened and progressed to shortness of breath. He has had low-grade fever (37℃) for the past week. He has no significant medical history and does not smoke or have a history of pet ownership. He moved to a poorly-lit, 50-year-old wooden house last year and this is his first summer there. On presentation, his body temperature is 37.7℃, respiratory rate is 24/minute, and SpO2 on room air is 94%. Fine crackles are heard on lung auscultation. A chest CT scan is performed separately. A blood test showed that Trichosporon asahii-specific antibodies are positive. Which of the following statements is incorrect?", "choices_en": ["Improvement with hospitalization.", "High LD levels.", "IgE is elevated.", "KL-6 is elevated.", "Increased lymphocytes are observed in bronchoalveolar lavage fluid."], "answer": ["c"]}
{"problem_id": "115A20", "problem_text_en": "A one-month-old male infant was referred by an obstetrician for evaluation of left hydronephrosis detected on fetal ultrasonography at 32 weeks' gestation. The infant was born at 38 weeks' gestation with a birth weight of 2,800 g. Physical examination revealed a flat abdominal contour, a soft abdomen without palpable liver, spleen, or masses, and no external evidence of masses or hernias. Urinalysis showed pale yellow, clear urine with negative protein, negative blood, negative leukocyte esterase, and negative nitrite. Separate ultrasound images of both kidneys and the bladder are shown. No abdominal or pelvic masses or cysts were identified. The following is a conversation between a physician and the mother during the outpatient visit: Physician: \"It may be that urine made in the left kidney is not flowing smoothly to the bladder. How is his urine output?\" Mother: \"It comes out strongly. We change his diaper about 8 times a day.\" Physician: \"Is he breastfeeding well?\" Mother: \"He nurses well every 2-3 hours. After he nurses, he sleeps peacefully.\" Physician: \"Has he had a fever above 38°C?\" Mother: \"No.\" Physician: \"Let's follow up in 3 months with (A) for evaluation of the hydronephrosis.\" What is the appropriate test for (A)?", "choices_en": ["Abdominal contrast-enhanced CT scan", "MR urography (Magnetic resonance urography)", "Abdominal ultrasound examination", "Diuretic renogram", "Voiding cystourethrography"], "answer": ["c"]}
{"problem_id": "115A21", "problem_text_en": "A 35-year-old man presented with fever and a rash all over his body. He was diagnosed with psoriasis vulgaris eight years ago and had been using topical corticosteroids. He came for medical attention due to the rapid expansion of erythema all over his body together with fever of more than 39℃ for 7 days. Numerous small pustules up to 5mm in diameter were observed on the erythematous area at the time of examination, clustering together. Geographic tongue was observed. Laboratory test results revealed a white blood cell count of 16,000/mm³ (15% neutrophils, 70% segmented neutrophils, 3% eosinophils, 5% monocytes, and 7% lymphocytes), serum albumin of 3.0 g/dL, and a C-reactive protein level of 15.0 mg/dL. Bacterial culture from the pustules was negative, and both fungal microscopy and the Tzanck test were negative. Kogoj's spongiotic pustule was observed on skin biopsy. A photo of the trunk area is shown separately. What is the most likely diagnosis?", "choices_en": ["Pustular psoriasis", "Impetigo contagiosa", "Herpes zoster dermatitis", "Kaposi's varicelliform eruption", "Staphylococcal scalded skin syndrome"], "answer": ["a"]}
{"problem_id": "115A22", "problem_text_en": "A 77-year-old woman underwent a low-dose CT scan for lung cancer screening, which suggested a mass on the left breast. Mammogram (A) and breast ultrasound image (B) are separately shown. What is the next step to be taken?", "choices_en": ["Contrast-enhanced CT (Computed Tomography)", "Contrast-enhanced MRI", "Percutaneous needle biopsy", "Fluorodeoxyglucose-positron emission tomography/computed tomography (FDG-PET/CT)", "Bone scintigraphy"], "answer": ["c"]}
{"problem_id": "115A23", "problem_text_en": "A 35-year-old man came to the hospital complaining that his family had pointed out that he was making chewing movements and sticking out his tongue while watching TV. He has been experiencing these movements for about six months. He was treated with antipsychotic medication in his early 30s for a hallucinatory delusional state and has continued taking medication since then. Which of the following statements about these movements is correct?", "choices_en": ["It disappears during sleep.", "Anti-Parkinson's disease drugs are remarkably effective.", "It is a specific side effect of antipsychotic drugs.", "It worsens when attention is drawn to the movements of the mouth.", "Accompanied by involuntary movements that throw one side's upper and lower limbs."], "answer": ["a"]}
{"problem_id": "115A24", "problem_text_en": "A 55-year-old man was brought to the hospital with his wife, who reported that he had no memory of the previous night. He had been taking sleeping pills regularly since he was prescribed them for insomnia a few years ago, and had continued to work. Two weeks ago, there was a break-in at a restaurant he owned, and he was depressed about it. Yesterday, he ate dinner at home at 7 PM, went to bed at 11 PM, and received a phone call from a friend inviting him to karaoke at around 1 AM. He took a taxi to the karaoke club, had a party, and returned home around 4 AM. He slept for about 8 hours after arriving home, and went to work in the afternoon, but did not remember anything about the night before. According to his friend, he sang and drank normally. He does not drink alcohol at all and did not drink on that day. His wife reported that he had eaten meals late at night or gone to a convenience store at night three times in the past two months, but had no recollection of these events the following morning. What is the possible disease in this patient?", "choices_en": ["Nocturnal delirium", "Transient global amnesia", "Global transient amnesia", "Anterograde amnesia due to sleeping pills", "REM (Rapid Eye Movement) sleep behavior disorder"], "answer": ["d"]}
{"problem_id": "115A25", "problem_text_en": "A 4-month-old male infant was brought to the hospital by his parents with complaints of nasal discharge and cough. Symptoms appeared yesterday, including the presence of nasal discharge, coughing, and wheezing. He was born at 36 weeks and 1 day and weighed 2,466g. Due to his low birth weight, he spent 3 weeks in the NICU. His 3-year-old brother has had nasal discharge for the past week. He is breastfed, and breastfeeding patterns have remained normal. His height is 64.3 cm, his weight is 7,220g, his body temperature is 36.8℃, and his heart rate is 120 bpm. His respiratory rate is 50 bpm, and his SpO2 is 98% (room air). There are no abnormal heart sounds, but wheezing can be heard during breathing, although no retraction is noticed. The abdomen is slightly distended, and there is no extension of capillary refill time. The nasal RS virus rapid test was positive. Which of the following is the correct response?", "choices_en": ["Observation/monitoring of progress/treatment", "Antibiotic administration", "Administration of antiviral drugs", "Gamma globulin administration", "Administration of humanized monoclonal antibodies."], "answer": ["a"]}
{"problem_id": "115A26", "problem_text_en": "A 22-year-old man comes to the clinic complaining of edema. Two weeks ago, he noticed sudden edema in his face and lower legs, as well as fine foamy urine after urinating. The edema has gradually worsened, and his body weight has increased by about 20 kg during this time. His appetite has been reduced by half since five days ago, he has had diarrhea, and his general fatigue has worsened. His urinary frequency decreased the day before yesterday, and yesterday he voided dark strong foamy urine only twice, in small amounts, and he has not urinated at all for the first 10 hours after waking up today. He is alert and conscious, 176 cm tall with a weight of 92 kg. His blood pressure is 110/70 mmHg, pulse is 88 bpm and regular, and respiratory rate is 16 breaths per minute. He has significant bilateral periorbital edema and pitting edema without discrepancy in both limbs. What is the most probable complication that may occur within the next week?", "choices_en": ["Pulmonary edema", "Airway obstruction", "Bleeding tendency", "Acute kidney injury", "Hyperglycemic crisis"], "answer": ["d"]}
{"problem_id": "115A27", "problem_text_en": "A 46-year-old woman presents with dyspnea and fatigue. Six months ago, she developed joint pain in her fingers and wrists, as well as a rash on her face, and was diagnosed with systemic lupus erythematosus (SLE) and started on corticosteroids and hydroxychloroquine. Since then, her symptoms had improved, but dyspnea, general fatigue, and discomfort in the anterior chest had appeared one week ago, and she presented to the emergency department at 8 pm. Her body temperature is 37.8 ℃, the pulse rate is 102 beats/min and regular, and the blood pressure is 100/72 mmHg. Her SpO2 is 96% on room air, and a facial rash is seen. Swelling of the proximal interphalangeal joints and wrists of both hands is observed. Distention of the neck veins is prominent during inspiration. Reduced intensity of the first and second heart sounds is heard. No abnormalities are detected in respiratory sounds. Mild edema is noted in the lower legs. Blood tests: red blood cells 3.46 million, Hb 10.8 g/dL, Ht 33%, white blood cells 7,200, and platelets 150,000. Biochemical tests: ALT 26 U/L, LD 160 U/L (reference range 120-245), creatinine 0.5 mg/dL, brain natriuretic peptide (BNP) 56 pg/mL (reference range below 18.4), and CRP 3.8 mg/dL. The systolic blood pressure decreases by 18 mmHg during inspiration compared to expiration. Chest X-ray shows a cardiothoracic ratio of 55%, and no abnormalities are observed in the lung field. Electrocardiography shows low voltage in the limb lead. Cardiac echocardiography is shown in (A) and (B). What is the most likely cause of the patient's dyspnea?", "choices_en": ["Pericarditis", "Endocarditis", "Interstitial pneumonia", "Pulmonary embolism", "Pulmonary arterial hypertension"], "answer": ["a"]}
{"problem_id": "115A28", "problem_text_en": "A 72-year-old woman visited due to her chief complaint of hoarseness. She has been unable to sing and speak in a high-pitched voice for 20 years due to her voice being hoarse. Her voice quality has not deteriorated, but she consulted because she had felt short of breath several times when climbing stairs for 2 months. There is no significant medical history. She has smoked 10 cigarettes per day since she was 40 years old and drinks one can of beer (350 mL) 1 to 2 times a week since the same period. Her height is 153 cm, weight is 56 kg, body temperature is 36.3°C, and pulse rate is 70 bpm regular. Blood pressure is 136/66 mmHg, respiratory rate is 24 breaths per minute, and SpO2 is 97% on room air. No neck tumor was palpated. There were no abnormalities in urine and blood tests, and chest X-ray examination. Among the laryngoscopic images (①-⑤) shown separately, which one is appropriate for this patient's endoscopic image?", "choices_en": ["① (This is not a word or phrase, but a symbol used for numbering or listing items in Japanese.)", "Choice 2 (or Option 2)", "It is not possible to translate the choice without additional context. Choice ③ by itself does not provide any meaning or information.", "Choice 4", "Unfortunately, as it is only a number, without any context or options to choose from, it is impossible to translate the meaning of ⑤ as it could refer to anything. Please provide more context or information."], "answer": ["e"]}
{"problem_id": "115A29", "problem_text_en": "A 76-year-old man presented with numbness in the left thumb to ring finger that has been ongoing for three months. He is 165 cm tall and weighs 65 kg. Sensory impairment is observed in the left thumb to ring finger on the radial side. Grip strength is 26 kg on the right and 22 kg on the left. The results of peripheral nerve conduction tests are shown separately. What is the most likely condition?", "choices_en": ["Cervical radiculopathy", "Carpal tunnel syndrome", "Multiple sclerosis", "Cubital tunnel syndrome.", "Thoracic outlet syndrome"], "answer": ["b"]}
{"problem_id": "115A30", "problem_text_en": "A 67-year-old man presented to the hospital with a complaint of a penile tumor. He noticed a penile tumor a year ago and subsequently developed right inguinal swelling with pain 9 months ago. He came to the hospital due to purulent discharge and foul odor from his underwear. The patient had no significant medical history and was single. He has been smoking 10 cigarettes per day for 40 years and drinks alcohol occasionally. He is 170 cm tall and weighs 59 kg. His body temperature is 36.5℃ and his pulse rate is 76 beats per minute, regular. His abdomen is flat, soft, and there is no palpable liver or spleen. A tumor was found at the glans penis and a hard 3 cm tumor was found at the right inguinal region. Blood test results showed a red blood cell count of 4.63 million, Hb of 13.4 g/dL, Ht of 40%, white blood cell count of 19,700, and platelet count of 590,000. The results of blood biochemistry showed a total protein of 8.1 g/dL, albumin of 3.7 g/dL, AST of 15 U/L, ALT of 11 U/L, blood urea nitrogen of 14 mg/dL, creatinine of 0.7 mg/dL, and squamous cell carcinoma antigen (SCC) of 19.9 ng/mL (reference: less than 1.5 ng/mL). The C-reactive protein level was 2.3 mg/dL. The photograph of the lesion (A) and T2-weighted magnetic resonance imaging (MRI) of the pelvis (B) are presented separately. What is the most likely diagnosis?", "choices_en": ["Syphilis", "Penile cancer", "Urethral cancer", "Extramammary Paget's disease", "Genital warts"], "answer": ["b"]}
{"problem_id": "115A31", "problem_text_en": "A 72-year-old woman visited the hospital complaining of diplopia and visual impairment in her right eye. She has had difficulty seeing with her right eye for about a month and sees distorted lines. Similar symptoms are present in the left eye, but to a lesser extent than in the right eye. Visual acuity is 0.1 in the right eye (0.2 × −0.75D) and 0.7 in the left eye (0.9 × −0.50D). What is the most likely disease?", "choices_en": ["Optic neuritis", "Age-related macular degeneration", "Idiopathic macular hole", "Central retinal vein occlusion", "Retinal artery branch occlusion"], "answer": ["b"]}
{"problem_id": "115A32", "problem_text_en": "A 26-year-old woman presents to the hospital with palpitations and general fatigue. She has been experiencing a fast heartbeat with minimal exertion for the past month and has lost 5 kg of weight over the past several months. She has been under stress due to a change in job placement and has not sought medical care until now. She also complains of chest discomfort and general fatigue for the past three days. She has no notable medical or family history, is alert and conscious, with a height of 158 cm and weight of 48 kg, body temperature of 36.8℃, pulse rate of 98 beats per minute with arrhythmia, blood pressure of 138/88 mmHg, respiratory rate of 18 breaths per minute, and SpO2 of 98% (room air). She does not have conjunctival pallor, and the intensity of the first heart sound varies. No abnormalities are detected in her lung sounds. Neurological examination reveals tremors in both hands, but no abnormal findings in manual muscle testing. The ECG is shown separately. What is the most useful diagnosis?", "choices_en": ["Blood sugar level", "White blood cell count", "Serum potassium concentration", "Thyroid function test results", "Brain Natriuretic Peptide (BNP)"], "answer": ["d"]}
{"problem_id": "115A33", "problem_text_en": "An 18-year-old female patient presents with dull lower abdominal pain. Feeling of abdominal fullness appeared 3 months ago, and dull lower abdominal pain appeared one month ago. Menarche occurred at age 12, with regular and normal menstrual cycles of 28 days in duration, lasting for 5 days. She has no sexual history. Her height is 161 cm, weight is 55 kg, temperature is 37.0℃, and her pulse rate is 92 beats per minute, regular. Blood pressure is 124/74 mmHg. Mildly enlarged lower abdomen and a palpable tumor with tenderness and limited mobility is detected on digital rectal examination. No abnormalities are observed in the rectum. Blood chemistry findings showed hCG ＜0.5 IU/L (reference value: ≤1.0), CEA 1.6 ng/mL (reference value: ≤4.9), CA19-9 10 U/mL (reference value: ≤37), CA125 418 U/mL (reference value: ≤35), and AFP 140,000 ng/mL (reference value: ≤20). T2-weighted sagittal MRI image of the pelvic region is shown separately. What is the most likely disease in this patient?", "choices_en": ["Embryonal carcinoma", "Squamous cell carcinoma", "Sex cord-stromal tumor", "Functional ovarian cyst", "Chocolate cyst"], "answer": ["a"]}
{"problem_id": "115A34", "problem_text_en": "A 74-year-old man presented with left forearm pain and numbness. He had visited the emergency department because he suddenly felt pain and numbness in his left forearm during dinner and continued to experience them. He was diagnosed with atrial fibrillation during a health checkup, but had not visited a medical institution. The patient was alert at the time of admission. The pulse was irregular and the rate was 104 beats per minute. A Levine grade 2/6 systolic murmur was heard in the apex of the heart. Blood pressure measured in the right upper limb was 130/86 mmHg. The left upper limb was pale from the forearm to the fingers, and the radial artery pulse was weak. Blood test results showed red blood cell count of 4.42 million, hemoglobin of 13.9 g/dL, hematocrit of 41%, white blood cell count of 4,400, platelet count of 260,000, fibrinogen of 419 mg/dL (reference range: 200-400), FDP of 8.0 μg/mL (reference range: up to 5), and D-dimer of 3.7 μg/mL (reference range: up to 1). Blood chemistry tests showed AST of 21 U/L, ALT of 18 U/L, LD of 250 U/L (reference range: 120–245), CK of 122 U/L (reference range: 30–140), blood urea nitrogen of 19 mg/dL, creatinine of 1.2 mg/dL, and BNP of 134 pg/mL (reference range: up to 18.4). CRP was 0.4 mg/dL. What is the most likely condition?", "choices_en": ["Cerebral infarction/stroke", "Acute arterial occlusion", "Carpal tunnel syndrome", "Thoracic outlet syndrome", "Cervical intervertebral disc herniation"], "answer": ["b"]}
{"problem_id": "115A35", "problem_text_en": "A 65-year-old man comes to the clinic complaining of being bitten by a snake on his finger. He was bitten by a pit viper on his left index finger while mowing the lawn 30 minutes ago. There is no significant medical history. The patient is alert and conscious with a pulse rate of 70/min and regular, blood pressure of 108/80 mmHg, and SpO2 of 96% on room air. Two bite wounds are found on the pad of the left index finger, and there is swelling in the left forearm. Which of the following is an inappropriate response?\n\n", "choices_en": ["Administration of antibiotics", "Local blood aspiration", "Extracellular fluid replacement", "Antivenom serum infusion", "Instructions for observing the course at home"], "answer": ["e"]}
{"problem_id": "115A36", "problem_text_en": "A 52-year-old man complains of lower abdominal tension and inability to urinate, and visits the hospital. He bruised his perineum when he fell off a stepladder at home this morning. External bleeding from the urethral orifice is observed on examination. He is conscious and alert, with a height of 168 cm, weight of 72 kg, axillary temperature of 36.7℃, pulse rate of 72/min and regular, blood pressure of 124/84 mmHg, and respiratory rate of 20/min. He complains of spontaneous pain in the perineum and has swelling and tenderness under the skin. The lower abdomen is tense. Blood tests show a red blood cell count of 4.5 million, Hb level of 14.1 g/dL, Ht level of 42%, and a white blood cell count of 13,200, and platelet count of 250,000. Serum total protein level is 7.5 g/dL and albumin level is 4.0 g/dL. Total bilirubin level is 1.2 mg/dL, AST level is 23 U/L, ALT level is 22 U/L, LD level is 179 U/L (normal range: 120-245), blood urea nitrogen level is 16 mg/dL, creatinine level is 0.7 mg/dL, uric acid level is 5.5 mg/dL, blood glucose level is 98 mg/dL, serum sodium level is 141 mEq/L, serum chloride level is 104 mEq/L, and serum calcium level is 9.9 mg/dL. Abdominal X-ray does not show any pelvic fracture. CT of the pelvis reveals a hematoma in the perineum. Retrograde urethrogram reveals extravasation of the contrast agent outside the urethra at the membranous urethra and the bladder is not visualized. What is the most appropriate initial management?", "choices_en": ["Perform hemodialysis.", "To create a renal fistula.", "To construct a vesicostomy", "To place a ureteral stent.", "Perform embolization of the external iliac artery."], "answer": ["c"]}
{"problem_id": "115A37", "problem_text_en": "A 47-year-old man presents with a complaint of dry cough. He has had low-grade fever at night for 2 weeks and the dry cough, which started a week ago, has worsened, prompting him to seek medical attention. He underwent allogeneic hematopoietic stem cell transplantation for primary myelofibrosis 1.5 years ago. His temperature is 36.4°C, pulse rate is 88/min regular, blood pressure is 110/62 mmHg, and respiratory rate is 20/min. There are no abnormalities in his heart or lung sounds. Laboratory findings are as follows: red blood cell count 3.19 million/mm3, Hb 10.3 g/dL, Ht 31%, reticulocyte count 2.8%, WBC 5,700/mm3 with segmental neutrophils 3%, band neutrophils 80%, eosinophils 3%, basophils 1%, monocytes 8%, and lymphocytes 5%. Platelet count is 210,000/mm3. Blood biochemistry findings are as follows: IgG 480 mg/dL (normal range 960-1960 mg/dL), IgA 21 mg/dL (normal range 110-410 mg/dL), IgM 28 mg/dL (normal range 65-350 mg/dL), and CRP 3.2 mg/dL. Arterial blood gas analysis (room air) shows pH 7.39, PaCO2 44 Torr, PaO2 61 Torr, and HCO3- 25 mEq/L. Induced sputum staining with May-Grünwald-Giemsa stain shows nutritive bodies, and Grocott stain shows black-staining cysts. Chest X-ray (A) and chest CT (B) are shown. Which of the following test results is correct?", "choices_en": ["Normal KL-6 (a biomarker used in diagnosing and monitoring interstitial lung diseases)", "Positive urine antigen", "High levels of β-D-glucan", "Identification of causative microorganisms by sputum culture test.", "Increase in antibody titer of 4-fold or more in paired serum after 2 weeks"], "answer": ["c"]}
{"problem_id": "115A38", "problem_text_en": "An 11-year-old boy was brought to the emergency room complaining of respiratory distress after exercise. His symptoms started during a long-distance run in his physical education class, about one hour after lunch. The lunch menu consisted of bread, shrimp gratin, onion salad, and kiwifruit. He has a history of bronchial asthma but has not been using any medication recently and has had no attacks in the past year. There is no other significant medical history. He is conscious and alert. His heart rate is 90 bpm, blood pressure is 96/62 mmHg, and respiratory rate is 24/min. Wheezing is heard upon chest auscultation. There are also macules and papules on the abdomen and lower limbs. What is the most appropriate immediate response?", "choices_en": ["Airway management", "Inhaled steroids", "Adrenaline injection", "Oral administration of antihistamines.", "Sodium bicarbonate infusion"], "answer": ["c"]}
{"problem_id": "115A39", "problem_text_en": "A 48-year-old woman comes to the clinic complaining of dizziness and double vision. Ten days ago, she had a fever of 38℃ and sore throat, for which she received medication at a nearby clinic for a cold, and her symptoms improved in seven days. She noticed double vision when watching TV two days ago, and started experiencing more frequent dizziness and almost fell when walking since yesterday. The symptoms have been gradually progressing so she decided to visit the clinic. She is alert and oriented. Her body temperature is 36.5℃. Pulse rate is 68/min and regular, and blood pressure is 120/68 mmHg. Heart and lung sounds are normal. Neurological examination reveals vertical and horizontal limitation of eye movement in both eyes, with diplopia noted in all areas but the primary position. Nystagmus is not observed. Muscle strength is normal, but all of the tendon reflexes are absent. Babinski sign is negative. The heel-to-shin test is clumsy bilaterally, and walking is possible but with a wide and ataxic gait. Sensory disturbance is not observed. Urinalysis and blood tests show no abnormalities. What is the most likely cause of symptoms in this patient, which has a similar onset mechanism to hers?", "choices_en": ["Myasthenia gravis", "Multiple sclerosis", "Progressive supranuclear palsy", "Amyotrophic lateral sclerosis (ALS)", "Guillain-Barré Syndrome"], "answer": ["e"]}
{"problem_id": "115A40", "problem_text_en": "A 70-year-old man underwent liver resection for liver tumor and was admitted to the ICU. At admission, his pulse was 80/min and regular and blood pressure was 150/84 mmHg. The next morning, he complained of chest discomfort and severe nausea at 8 am. He then became agitated, had poor skin color, and sweating throughout his body. His temperature was 37.5℃. His pulse was 68/min and regular, and blood pressure was 80/48 mmHg. His SpO2 was 94% (with a mask and 5 L/min of Oxygen supply). An IV heart sound was heard, and wheezes were heard bilaterally. Coldness was observed in the extremities. Electrocardiograms (A) before the surgery and (B) at the appearance of chest symptoms are shown separately. A bedside echocardiogram showed wall motion abnormalities in the anterior and inferior walls of the left ventricle. What should be done urgently?", "choices_en": ["Pericardiocentesis", "Cardiac catheterization examination", "Lung perfusion scintigraphy", "Placement of inferior vena cava filter", "Administration of t-PA (tissue plasminogen activator)"], "answer": ["b"]}
{"problem_id": "115A41", "problem_text_en": "A 52-year-old woman presented with complaints of dyspnea on exertion. She noticed worsening dyspnea over the past 6 months and sought medical attention. She has no significant medical or family history and has never smoked. Her consciousness level is clear, temperature is 36.2℃, pulse rate is 76 beats per minute and regular, blood pressure is 140/76 mmHg, respiratory rate is 16 breaths per minute, and oxygen saturation is 95% on room air. There is no abnormality in the conjunctiva or eyeballs. There is no heart murmur. Adventitial lung sound is normal. The liver and spleen are not palpable, and there is no edema in the lower leg. Laboratory data: Hemoglobin is 12.6 g/dL, white blood cell count is 6,400, and platelet count is 360,000. The electrocardiogram shows evidence of right ventricular hypertrophy. The chest X-ray shows no abnormalities in the lung field, but there is protrusion of the left second arch due to dilatation of the pulmonary artery trunk. Chest contrast-enhanced CT shows no evidence of pulmonary thromboembolism. The estimated pulmonary arterial systolic pressure on echocardiography was 50 mmHg. Which test is necessary to determine the treatment plan?", "choices_en": ["Thoracic MRI", "FDG-PET (Fluorodeoxyglucose-Positron Emission Tomography)", "Sputum cytology", "Coronary angiography", "Right heart catheterization"], "answer": ["e"]}
{"problem_id": "115A42", "problem_text_en": "A 58-year-old man comes to the clinic with a complaint of incomplete bowel movement. He has been experiencing a feeling of incomplete bowel movement for the past six months and has come for evaluation. His stool is pellet-like, and he has a bowel movement about once every three days. He strains hard during bowel movements, but the feeling of incomplete evacuation persists even after defecation. He has no significant medical history. His abdomen is flat and soft, with no tenderness, and his digital rectal examination is unremarkable. Colonoscopy does not reveal any abnormality. What is the appropriate response?", "choices_en": ["Instructions for quietness or rest", "Antibiotic administration", "Regular enema", "Administration of osmotic laxative", "Restriction of dietary fiber intake"], "answer": ["d"]}
{"problem_id": "115A43", "problem_text_en": "A 5-year-old girl is hospitalized for acute lymphoblastic leukemia and is undergoing remission induction therapy. Her body temperature is 36.4°C. The conjunctiva appears pale. Petechiae are observed on the lower legs. Blood test results indicate: red blood cells 2.88 million/μL, Hb 8.8 g/dL, Hct 26%, reticulocytes 0.1%, white blood cells 800/μL (polymorphonuclear leukocytes 19%, monocytes 0%, lymphocytes 81%), platelets 10,000/μL, PT-INR 1.0 (reference range 0.9-1.1), APTT 29.2 seconds (reference range 22.0-32.2 seconds), and plasma fibrinogen 170 mg/dL (reference range 200-400 mg/dL). Which of the following is the appropriate management?", "choices_en": ["Platelet transfusion", "Fresh frozen plasma transfusion", "Packed red blood cell transfusion", "Administration of erythropoietin preparation", "Administration of thrombopoietin receptor agonist"], "answer": ["a"]}
{"problem_id": "115A44", "problem_text_en": "A 42-year-old woman presents with joint pain. She had been aware of dry eyes for about a year, and had been diagnosed with dry eyes and prescribed eye drops after visiting an ophthalmologist near her home. Three months ago, she became aware of hand stiffness and joint pain in both hands, and visited a clinic because her symptoms did not improve. Her temperature is 36.5°C. Her pulse is 72 beats/minute and regular, and her blood pressure is 124/82 mmHg. Conjunctival congestion is observed. Her tongue is dry. No abnormalities are found in heart sounds or breath sounds. Tenderness is observed in the right proximal interphalangeal joint and bilateral wrist joints. Urinalysis shows no protein or occult blood. Hematological tests show 4.1 million red blood cells, Hb 13.7 g/dL, Ht 38%, 3,400 white blood cells (72% neutrophils, 2% eosinophils, 1% basophils, 12% monocytes, 13% lymphocytes), and 170,000 platelets. Biochemical tests show total protein 7.0 g/dL, AST 23 U/L, ALT 25 U/L, γ-GT 34 U/L (normal range: 8-50), BUN 17 mg/dL, creatinine 0.6 mg/dL, blood glucose 96 mg/dL, and HbA1c 5.4% (normal range: 4.6-6.2%). Immunological tests show CRP 0.3 mg/dL, rheumatoid factor (RF) of 128 IU/mL (normal range: < 20 IU/mL), and antinuclear antibodies (ANA) of 640 times normal (normal range: < 20 times). Which autoantibody is the most useful for diagnosis?", "choices_en": ["PR3-ANCA", "Anti-SS-A antibodies", "Anti-MDA5 antibody", "Anti-dsDNA antibody", "Anti-aquaporin 4 antibody"], "answer": ["b"]}
{"problem_id": "115A45", "problem_text_en": "A 54-year-old woman presents with fatigue. She underwent outpatient chemotherapy for advanced ovarian cancer 10 days ago and reports that she has been drinking plenty of fluids since then. She came to the hospital because of the onset of fatigue three days ago. Her consciousness is clear, and her pulse is regular at 60 beats per minute. Her blood pressure is 134/86 mmHg. Her skin's turgor is normal, and an 11 cm diameter mass is palpable in the lower abdomen. There is no ascites. Laboratory findings show a creatinine level of 0.8 mg/dL, uric acid level of 3.2 mg/dL, Na+ level of 124 mEq/L, Cl- level of 102 mEq/L, and cortisol level of 6.6 μg/dL (reference range: 5.2-12.6). Serum osmolality is low at 250 mOsm/L (reference range: 275-288), urine osmolality is high at 390 mOsm/L, and urine sodium is high at 45 mEq/L. Chest X-ray shows no cardiac enlargement. What is the first step in treating the low serum osmolality?", "choices_en": ["Restriction of water intake", "Intravenous administration of physiological saline solution", "Intravenous administration of 5% glucose solution.", "Oral administration of sodium chloride", "Oral administration of calcium channel blockers"], "answer": ["a"]}
{"problem_id": "115A46", "problem_text_en": "A 54-year-old woman presented with cough and sputum production. The sputum was white, and there was no fever. She had visited a clinic near her home and was treated with an antibacterial agent for bacterial pneumonia after an abnormal shadow was detected on her chest X-ray. However, as the shadow intensified, she was referred to the hospital. Three months ago, an abnormal shadow was also detected on her chest X-ray, but her symptoms were mild and she had spontaneously recovered. Following bronchoscopy, the eosinophil count in the bronchoalveolar lavage fluid was 37%, and transbronchial lung biopsy showed fibrotic lesions with eosinophilic infiltration in the alveolar walls. Which of the following is correct regarding this disease?", "choices_en": ["Common in elderly people.", "Smoking is involved in the development.", "Frequently associated with bronchial asthma.", "Steroid resistant.", "Peripheral blood eosinophils are normal."], "answer": ["c"]}
{"problem_id": "115A47", "problem_text_en": "A 49-year-old man presents with complaints of epigastric fullness. He has experienced uncomfortable fullness occurring every other day after eating for the past six months. Although he does not have heartburn, he sometimes leaves food unfinished because of a feeling of fullness. He has no remarkable medical history and is not currently taking any medication. He has no history of smoking or alcohol use. He is 165 cm tall and weighs 60 kg, with no change in weight over the past six months. A health checkup two weeks ago revealed no abnormalities. Upper gastrointestinal endoscopy and abdominal ultrasound examination showed no abnormalities, and Helicobacter Pylori antibodies in his blood were negative. What is the most likely diagnosis?", "choices_en": ["Reflux esophagitis", "Irritable bowel syndrome", "Hiatal hernia", "Functional dyspepsia", "Non-erosive reflux disease (NERD)"], "answer": ["d"]}
{"problem_id": "115A48", "problem_text_en": "A 3-hour-old female infant was born at 40 weeks of gestation, weighing 3,125g, with Apgar scores of 7 (1 minute) and 8 (5 minutes). The nurse noticed cyanosis and reported it to the physician. The infant's temperature was 37.0℃, heart rate was 120/min, respiratory rate was 40/min, and SpO2 (room air) was 96% (upper limbs) and 88% (lower limbs). No heart murmur was detected. The skin color was darker in the lower half than in the upper half of the body. What is the most likely condition in the infant?", "choices_en": ["Tetralogy of Fallot", "Tricuspid atresia", "Coarctation of the aorta", "Ventricular septal defect (VSD)", "Total anomalous pulmonary venous return (TAPVR)"], "answer": ["c"]}
{"problem_id": "115A49", "problem_text_en": "A 31-year-old woman came to the clinic complaining of pain and deformity in her left big toe. The pain appeared three years ago without any identifiable cause, but she left it untreated. Recently, the pain has worsened and the deformity has become more noticeable, so she decided to seek medical attention. An X-ray of her left foot is shown separately. Which of the following treatments is not appropriate?", "choices_en": ["Shoe-fitting guidance", "Muscle strength training", "Osteotomy", "Orthotic therapy", "Manual therapy (or chiropractic treatment)"], "answer": ["e"]}
{"problem_id": "115A50", "problem_text_en": "A 48-year-old woman presents with a chief complaint of heartburn. She has been experiencing heartburn for the past three months and has been careful with her diet, but there has been no improvement, prompting her to seek medical attention. There is no significant medical or family history, and she is a non-smoker. She drinks alcohol on occasion. She had a job transfer six months ago and has since become busier with work. She is alert and conscious. Her pulse is regular at 68 beats/min, and her blood pressure is 112/70 mmHg. There are no abnormalities detected in her heart or lung sounds. Her abdomen is flat, soft, and there is no palpable liver or spleen. An upper gastrointestinal endoscopy image is also provided. What is the most likely condition?", "choices_en": ["Barrett's esophagus", "Reflux esophagitis", "Eosinophilic esophagitis", "Esophageal achalasia", "Non-erosive reflux disease (NERD)"], "answer": ["e"]}
{"problem_id": "115A51", "problem_text_en": "A 76-year-old female patient presented to the clinic with complaints of high blood pressure. Despite being careful about her lifestyle, her blood pressure has gradually been increasing, which is why she came for a consultation. She is conscious and oriented, with a height of 163 cm, weight of 51 kg, body temperature of 35.9℃, pulse rate of 86 bpm, regular, blood pressure of 162/98 mmHg, respiratory rate of 20/min, and SpO2 of 95% on room air. Urine examination showed proteinuria (++), and blood tests showed that she had erythrocytes 3.43 million/µL, Hb 11.0 g/dL, Ht 33%, leukocytes 3,700/µL, and platelets 170,000/µL, while blood chemistry tests revealed 20 mg/dL of BUN and 1.0 mg/dL of creatinine. The following conversation occurred between the resident and attending physicians during an internal medicine outpatient training. Attending physician: \"As the patient is elderly and has hypertension, there may be some points to consider, which differ from younger or middle-aged patients. How about the low-salt diet?\" Resident doctor: \"①Although reducing salt is effective for elderly patients, we must also pay attention to low nutrition.\" Attending physician: \"There is also a possibility that maintaining blood pressure when venous reflux is decreased may be weak as well.\" Resident doctor: \"②This is one of the reasons why orthostatic hypotension is likely to occur.\" Attending physician: \"Any lifestyle points to be aware of?\" Resident doctor: \"③We watch out for postprandial hypotension.\" Attending physician: \"How about the choice of antihypertensive drugs?\" Resident doctor: \"④Thiazide diuretics cannot be the first choice.\" Attending physician: \"How about the combination of ACE inhibitors and angiotensin II receptor blockers (ARBs)?\" Resident doctor: \"⑤It is not recommended.\" Which of the underlined statements is incorrect?", "choices_en": ["① (This is not a linguistic expression or word, but rather a numerical symbol meaning \"one\" or \"1\" in Japanese)", "This is not a statement or word, instead it is a number indicating an option in a multiple-choice question. It would need more context to translate properly.", "Unfortunately, there's no context or information about what ③ refers to, so it cannot be translated accurately. Please provide more context or information.", "Without knowing the context, ④ is impossible to translate. It is a numerical reference and could refer to anything in a list or series.", "Sorry, I cannot translate \"⑤\" without additional context since it is only a number/symbol and has no meaning on its own."], "answer": ["d"]}
{"problem_id": "115A52", "problem_text_en": "An 8-month-old infant was brought to the hospital by her parents because she swallowed the tip of a cigarette 2 cm long 3 hours ago. The infant is asymptomatic, has good complexion, and is in good spirits. Her height is 70.1 cm, weight is 8,000g, body temperature is 36.8℃, and pulse rate is 120 bpm with regular rhythm. The respiratory rate is 30 breaths per minute, and SpO2 is 98% on room air. No abnormal heart or breath sounds are detected. The abdomen is flat and soft. What is the appropriate response?", "choices_en": ["Gastric lavage", "Observation (or \"watchful waiting\" in medical context)", "Laxative administration", "Activated charcoal administration", "Intravenous infusion of saline solution"], "answer": ["b"]}
{"problem_id": "115A53", "problem_text_en": "A 58-year-old man complaining of high fasting blood sugar levels visits the clinic. He was diagnosed with type 2 diabetes 20 years ago and started self-injection of insulin 15 years ago. He currently self-injects 6 units of rapid-acting human insulin before each meal and 12 units of long-acting soluble insulin before bedtime. He does not take any oral medications. Recent self-monitoring blood glucose levels are shown below. He sometimes wakes up with profuse sweating during sleep. He has a height of 173 cm, weight of 62 kg, and a pulse rate of 68 beats/min. His blood pressure is 126/82 mmHg, and his physical examination is normal. Urinalysis shows protein (−), sugar 2+, and ketone bodies (−). Blood test results: random blood glucose 178 mg/dL, HbA1c 6.4% (reference range 4.6-6.2). What should be done first?", "choices_en": ["An evening walk after dinner", "Reducing carbohydrate intake during dinner", "Measuring blood sugar levels in the early morning", "Addition of sulfonylurea drugs for oral intake.", "Increasing rapid-acting human insulin before dinner"], "answer": ["c"]}
{"problem_id": "115A54", "problem_text_en": "A 6-year-old boy was brought to the clinic by his mother with a chief complaint of shaking his head from side to side. He visited the clinic because he continued to shake his head for about 5 minutes while watching TV after lunch. He was found to quickly blink his eyes repeatedly for 7 months, which improved temporarily after about 2 months. About 4 months ago, he started blinking his eyes again and began to suddenly and non-rhythmically contort his face or shake his head from side to side. None of these symptoms were observed during sleep and they occur more frequently when he is relaxed. He can suppress it if it lasts for a short time. The neurological examination did not reveal any abnormalities. What is the most likely condition?", "choices_en": ["Trembling", "Tic.", "Ballerina-like movements (characteristic movement disorder seen in Sydenham's chorea)", "Dance movement therapy", "Athetosis"], "answer": ["b"]}
{"problem_id": "115A55", "problem_text_en": "A 28-year-old man presents with complaints of tinnitus in both ears. He has been aware of high-pitched tinnitus and mild hearing loss for a year, but it did not interfere with conversations. He came to the hospital because the tinnitus had gradually worsened. He has never experienced ear pain or discharge from childhood to the present. He used to listen to music with earphones at a high volume during his 2-hour commute to high school and university. Even after becoming a working adult, he listens to music for three hours every day with in-ear earphones during his commute. Both tympanic membranes are normal, and there were no abnormalities on temporal bone CT. Which of the following audiograms (①-⑤) is the most appropriate for this patient, as shown separately?", "choices_en": ["① (This is not translatable as it is a numeric symbol used in multiple-choice questions to distinguish between different options.)", "Unfortunately, it's not possible to translate the choice \"②\" into English without more context. It is likely a reference to a numerical choice or option given in a multiple-choice question.", "I'm sorry, but I cannot translate the choice without the context of the question. The number alone does not provide enough information to accurately translate it. Please provide more context or information.", "Without context, it is impossible to provide a precise translation for this choice. It could refer to a number or be part of a larger context that determines its meaning.", "Apologies, ⑤ is a numerical symbol that cannot be translated without context."], "answer": ["c"]}
{"problem_id": "115A56", "problem_text_en": "A 25-year-old man presents with a chief complaint of cough. He has been experiencing pain in his lower back for several months, and he sought medical attention now because of a persistent cough that started two weeks ago. He has no significant medical history. He is 176 cm in height, weighs 68 kg, and has a body temperature of 36.5°C. His pulse rate is 68 beats/min and regular, and his blood pressure is 110/72 mmHg. Urinalysis shows no abnormalities. Laboratory data includes: RBC count of 4.56 million, Hb of 15.1 g/dL, WBC count of 8,300, and platelet count of 260,000. Biochemical data includes a total protein of 6.8 g/dL, albumin of 3.9 g/dL, creatinine of 0.9 mg/dL, AST of 40 U/L, ALT of 38 U/L, LD of 410 U/L (normal range: 120-245), hCG of 40 mIU/mL (normal range: <0.7), alpha-fetoprotein (AFP) of 200 ng/mL (normal range: <20), CEA of 3.8 ng/mL (normal range: <5), and CA19-9 of 10 U/mL (normal range: <37). A chest and abdominal CT scan demonstrates 4-5 pulmonary nodules in each lung and an 8-cm para-aortic lymph node enlargement. Which organ is the most likely primary site?", "choices_en": ["Thyroid gland", "Liver", "Spleen", "Colon", "Testis"], "answer": ["e"]}
{"problem_id": "115A57", "problem_text_en": "A 36-year-old nulliparous woman (gravida 1, para 0) was admitted due to the onset of labor at 40 weeks and 0 days of gestation. Because of secondary weak labor and dystocia, she underwent vacuum-assisted delivery after labor augmentation with oxytocin. The female neonate weighed 3,800 g, had an Apgar score of 8 (1 min) and 9 (5 min). Thirty minutes after delivery, the placenta had not yet delivered spontaneously, and manual removal was performed due to sustained bleeding. Even after placental delivery, bleeding continued from the uterus, so bimanual uterine compression is being applied. The mother is pale and sweating cold, but her level of consciousness is normal. Her temperature is 36.9°C, heart rate is 120/min and regular, and blood pressure is 80/40 mmHg. What is the estimated amount of blood loss up to this point?", "choices_en": ["500 milliliters", "1,000 milliliters", "1,500 milliliters", "2,500 milliliters", "4,000 milliliters"], "answer": ["d"]}
{"problem_id": "115A58", "problem_text_en": "A 78-year-old woman was brought in by ambulance due to disturbance of consciousness and left hemiplegia. She lived with her eldest son and his wife and was independent in her activities of daily living. She watched television with her family until 9 p.m. last night, then she seemed to have returned to her room and went to bed, but when her family became concerned because she did not wake up even at 6 a.m., they found her collapsed next to her futon and called an ambulance. She had been taking oral anticoagulants since she was 75 years old when she was diagnosed with atrial fibrillation. Her level of consciousness was JCS I-1, her body temperature was 36.8℃, heart rate was 92 beats/min, irregular. Her blood pressure was 140/88 mmHg, and her respiratory rate was 16 breaths/min. She was able to speak and had a good understanding of verbal commands. Her visual field was normal and she did not have hemispatial neglect. She had incomplete hemiplegia on her left upper and lower limbs but no sensory disturbances were noted. Her blood chemistry test was normal. Head MRI was taken at 8 a.m., which included diffusion-weighted imaging, FLAIR imaging, T2* weighted imaging, and MRA (A-D). Which of the following is correct?", "choices_en": ["It is a hemorrhagic stroke.", "Administer antihypertensive medication promptly.", "Perform immediate right carotid artery stent placement.", "Start rehabilitation early.", "t-PA (tissue plasminogen activator) therapy is indicated."], "answer": ["d"]}
{"problem_id": "115A59", "problem_text_en": "A 47-year-old man presents with pain in his right lower leg. Five weeks ago, he suffered an open fracture of the right tibia in a motorcycle accident and received wound cleaning, debridement, and external fixation 6 hours after injury. After 1 week, the external fixation was removed and he underwent open reduction and internal fixation with a plate. He was walking with non-weight-bearing on the right lower limb since the internal fixation surgery. Yesterday, he presented with pain at rest and swelling on the inside of his right lower leg. His temperature is 38.8℃. His pulse rate is 80/min and regular, and his blood pressure is 144/62 mmHg. There is redness, warmth, and swelling in his right lower leg, and a part of the surgical wound has separated. Laboratory findings show that his red blood cell count is 4.22 million, hemoglobin is 12.4 g/dL, and white blood cell count is 19,200/μL. His CRP level is 21 mg/dL. The photograph (A) and X-ray (B) of the right lower leg are shown separately. Which one of the following is the appropriate treatment?", "choices_en": ["Below-knee amputation", "Splint fixation", "Ankle arthrodesis", "Debridement (removal of dead or contaminated tissue)", "Artificial bone transplant to the site of a bone fracture"], "answer": ["d"]}
{"problem_id": "115A60", "problem_text_en": "A 64-year-old man presents with complaints of hip pain. He has had bilateral hip pain for about six months and has been taking painkillers prescribed by his company clinic intermittently, but the pain did not improve, so he sought medical attention. No abnormal heart or respiratory sounds are heard. The abdomen is flat, soft, and the liver and spleen are not palpable, and there is no palpable superficial lymphadenopathy. Laboratory findings: red blood cells 3.53 million, Hb 11.5 g/dL, Ht 34%, white blood cells 3,200, and platelets 160,000. Blood chemistry: total protein 10.5 g/dL, albumin 3.9 g/dL, IgG 5,425 mg/dL (normal range 960-1,960), IgA <20 mg/dL (normal range 110-410), IgM <10 mg/dL (normal range 65-350), total bilirubin 0.7 mg/dL, AST 19 U/L, ALT 10 U/L, LD 178 U/L (normal range 120-245), blood urea nitrogen 11 mg/dL, creatinine 0.9 mg/dL, uric acid 4.7 mg/dL, Na 141 mEq/L, K 4.2 mEq/L, Cl 108 mEq/L, Ca 9.8 mg/dL. X-ray examination reveals multiple lytic bone lesions in the femurs, thoracic vertebrae, and lumbar vertebrae. Radiographs of both hip joints (A), bone marrow smear stained with May-Giemsa stain (B), and serum protein fractionation and immunoelectrophoresis (C) are shown separately. Which of the following is not an appropriate treatment for this patient?", "choices_en": ["Dexamethasone", "Autologous peripheral blood stem cell transplantation", "Bisphosphonate preparations", "Proteasome inhibitor drugs", "Radiation therapy for multiple bone lesions"], "answer": ["e"]}
{"problem_id": "115A61", "problem_text_en": "A 10-month-old boy is brought to the hospital by his father with chief complaint of afebrile seizures. While cosleeping, the father noticed a 2-minute episode of left-sided clonic convulsions involving the upper and lower extremities and brought the child to the hospital. The child had a port-wine stain on the right side of the face since birth. Developmental assessment at 2 months showed visual following and object exploration, at 4 months the baby had head control and was able to follow objects, and at 7 months the baby was able to sit without support. At 9 months, the baby had a 1-minute episode of left-sided clonic convulsions, and 2 weeks later had a similar episode. Brain MRI revealed right cerebral cortical and subcortical lesions consistent with a pial angiomatosis. Which of the following is not associated with this condition?", "choices_en": ["Hemiplegia", "Mental retardation", "Epilepsy", "Retinal pigment degeneration", "Calcification along the cerebral gyri"], "answer": ["d"]}
{"problem_id": "115A62", "problem_text_en": "1. A 42-year-old primiparous woman (G1 P0) came to the hospital for an antenatal check-up at 36 weeks of gestation.\n2. She had a history of 5 years of infertility treatment, including in vitro fertilization and embryo transfer, which resulted in a pregnancy. During the early stages of pregnancy, she was diagnosed with dichorionic diamniotic twins, and subsequent antenatal check-ups did not reveal any abnormalities.\n3. At age 33, she underwent laparoscopic ovarian cystectomy for ovarian endometriosis. She is 162 cm tall and weighs 66 kg (58 kg before pregnancy). Her body temperature is 36.8 ℃. Her pulse rate is 78 beats per minute, regular. Her blood pressure is 126/74 mmHg. Her respiratory rate is 18 breaths per minute. \n4. Estimated fetal weights on ultrasound examination are 2,680 g and 2,480 g for the firstborn and second-born babies, respectively.\n5. The firstborn baby is in the breech presentation, and the second-born baby is in the cephalic presentation. There is no apparent abnormality in the amniotic fluid volume. What is the most important information among the underlined items for determining whether vaginal delivery is possible?", "choices_en": ["① (This is not a translation but a symbol used for item numbering in Japanese multiple-choice questions)", "This is not a word or phrase, but rather a number in a numbered list. It cannot be translated without additional context.", "Without the full context of the question and choices, it is difficult to determine the meaning of ③. It appears to be a numerical label or symbol for a choice option.", "This question cannot be translated accurately without additional context. It appears to be a number or symbol used as an identifier within the exam and does not hold a standalone meaning.", "Sorry, as an AI language model I cannot translate this without context as it is only a number. Please provide me with more information or context so I can assist you better."], "answer": ["e"]}
{"problem_id": "115A63", "problem_text_en": "A 48-year-old woman presents with the chief complaint of abnormal genital bleeding. She is diagnosed with cervical cancer and undergoes a total hysterectomy by laparotomy. There is no significant medical history. She has a height of 164 cm, weighs 58 kg, and blood loss during surgery was 620 mL. The vaginal stump is sutured closed and a drain is placed in the pelvic floor before closure. What is the benefit of drain placement for early detection?", "choices_en": ["Postoperative bleeding", "Intestinal adhesion", "Neurogenic bladder", "Cancer recurrence in the pelvic region", "Deep vein thrombosis"], "answer": ["a"]}
{"problem_id": "115A64", "problem_text_en": "A 17-year-old boy comes to a regular check-up after coronary artery bypass surgery. He was diagnosed with Kawasaki disease at the age of 3 and was hospitalized for treatment. Follow-up was conducted on coronary artery lesions after discharge as a coronary artery aneurysm was detected. At the age of 8, coronary angiography showed lesions in both the left and right coronary arteries. The angiographic image of the left coronary artery at the time is shown separately (A). Subsequently, one bypass vessel anastomosis was performed on each of the left and right coronary arteries. This time, a chest CT with electrocardiogram synchronization (B; 3D reconstruction image, arrows indicate bypass vessels to the coronary arteries) was performed to confirm the patency of the bypass vessels. Which of the following is true?", "choices_en": ["Numerous calcifications are observed in the bypass vessel.", "The aneurysmal lesion (▲) of the left coronary artery is present in the circumflex branch.", "Both bypass vessels to the coronary artery are patent.", "Both the great saphenous veins are used for the bypass surgery.", "The bypass vessel is anastomosed to the coronary artery at its proximal end rather than at the aneurysmal lesion."], "answer": ["c"]}
{"problem_id": "115A65", "problem_text_en": "A 47-year-old woman presented with a chief complaint of loss of appetite. She had a decreased appetite and lost 3 kg in weight over the past 2 months. Her consciousness was clear. She was 156 cm tall and weighed 46 kg, with a body temperature of 36.0℃, a pulse rate of 80/min, and a blood pressure of 128/72 mmHg. Her conjunctiva and sclera were normal. No tenderness was observed in her cervical lymph nodes. Her heart and lung sounds were normal. Her abdomen was flat and soft, with no palpable liver or spleen. Her laboratory test results were as follows: red blood cell count: 3.66 million, Hb 11.9 g/dL, Ht 35%, white blood cell count 3,600, and platelets 130,000. Blood chemistry results were as follows: total protein 6.9 g/dL, albumin 3.7 g/dL, total bilirubin 1.0 mg/dL, AST 22 U/L, ALT 14 U/L, LD 180 U/L (reference range 120-245), ALP 204 U/L (reference range 115-359), γ-GT 35 U/L (reference range 8-50), blood urea nitrogen 10 mg/dL, creatinine 0.6 mg/dL, blood glucose 88 mg/dL, Na 140 mEq/L, K 4.0 mEq/L, and Cl 106 mEq/L. Helicobacter pylori antigen was positive in the stool. Chest and abdominal CT scans showed thickening of the gastric wall, but no other abnormalities were observed. Upper gastrointestinal endoscopy images (A) and H&E-stained biopsy specimens (B) are shown separately. What is the most appropriate initial approach to the patient's condition?", "choices_en": ["Gastrectomy", "Local radiation therapy", "Endoscopic submucosal dissection", "Helicobacter pylori eradication therapy", "Treatment with immune checkpoint inhibitors"], "answer": ["a"]}
{"problem_id": "115A66", "problem_text_en": "A 64-year-old man comes to the hospital with the chief complaint of dizziness upon standing. He has been receiving insulin therapy for diabetes for 15 years, with an HbA1c level ranging from 8-9% (normal range: 4.6-6.2%). He noticed dizziness when standing in the last 1-2 months, which led to his visit. He underwent broad-spectrum retinal photocoagulation therapy for diabetic retinopathy 5 years ago. He is alert and oriented. His height is 168 cm and weight 59 kg. His pulse rate is 82 beats/min and regular. His blood pressure is 138/74 mmHg. Urinalysis shows 2+ protein, 3+ glucose, and negative for ketone bodies. Which of the following physical findings are likely in this patient? Select two.", "choices_en": ["Abnormal bowel movements", "Atrophy of bilateral quadriceps femoris muscles", "Numbness in the right upper limb", "Bilateral patellar hyperreflexia", "Bilateral absence of Achilles tendon reflex"], "answer": ["a", "e"]}
{"problem_id": "115A67", "problem_text_en": "A 2-year-old boy was brought to the hospital by his mother who noticed that the pupil of his left eye appeared white. He has no developmental issues, and no apparent problems with his vision in his daily life. What are the possible conditions? Select two.", "choices_en": ["Congenital cataract", "Congenital glaucoma", "Pupillary membrane remnants", "Congenital corneal opacity", "Retinoblastoma"], "answer": ["a", "e"]}
{"problem_id": "115A68", "problem_text_en": "A 55-year-old female was found to have chest abnormalities during a health examination and came to the hospital for examination. She had been aware of double vision for about two months. Eyelid drooping was observed, and anti-acetylcholine receptor antibodies were positive in the blood. A chest contrast-enhanced CT scan is also shown. Which of the following complications should be searched for in this patient? Select two.", "choices_en": ["Erythroblastosis fetalis", "Cushing's syndrome", "Carcinoid syndrome", "Hypogammaglobulinemia", "Syndrome of inappropriate antidiuretic hormone secretion (SIADH)"], "answer": ["a", "d"]}
{"problem_id": "115A69", "problem_text_en": "A 32-year-old man felt fatigued after returning home from work. He had a fever of 38℃ and went to bed early. In the middle of the night, his wife heard him groaning and found him motionless. Despite calling out to him, he did not respond, so she performed chest compressions while calling for an ambulance. The waveform of the electrocardiogram (A) at the time of the arrival of the ambulance is shown separately. After successful defibrillation using an automated external defibrillator, his heart rhythm returned to normal and he was transported to the emergency department. A 12-lead electrocardiogram performed in the emergency department (B) is shown separately. Which of the following is accurate about this condition? Select two.", "choices_en": ["It is inherited as an X-linked dominant trait.", "A pathological condition associated with Kent bundles.", "Indication for implantable cardioverter-defibrillator.", "Irregular heartbeats are easily induced after a fever.", "In treatment, Class Ic sodium channel blockers are the first choice."], "answer": ["c", "d"]}
{"problem_id": "115A70", "problem_text_en": "A 68-year-old man presented with a complaint of decreased vision in his left eye. The visual acuity was 0.8 with correction in the right eye and 0.1 with correction in the left eye. The intraocular pressure was 15 mmHg in the right eye and 35 mmHg in the left eye. A photograph of the left eye is provided separately. What are the possible diseases? Select two.", "choices_en": ["Age-related macular degeneration", "Diabetic retinopathy", "Internal carotid artery stenosis", "Retinitis pigmentosa", "Macular hole detachment of idiopathic origin."], "answer": ["b", "c"]}
{"problem_id": "115A71", "problem_text_en": "A 67-year-old man presents with hemoptysis, which he has been experiencing for the past 2 months, along with hoarseness for the past month. He has a history of smoking 20 cigarettes per day for 45 years, and quit smoking 2 years ago. He is 164cm tall and weighs 52kg, with a blood pressure of 112/84mmHg and a respiratory rate of 20/minute. Laboratory findings are: red blood cells 4.2 million, Hb 14.8g/dL, Hct 40%, white blood cells 6,800, and platelets 260,000. Cytological examination of the sputum stained with Papanicolaou reveals cells as shown in the sample. Which of the following diseases is suspected? Select two. \n\n(Note: There is no sample in the text, so we cannot provide a translation for this specific phrase. It asks for possible diseases, and the answer would depend on the context of the sample.)", "choices_en": ["Lung cancer", "Pharyngitis", "Laryngeal cancer", "Bronchitis", "Salivary gland cancer"], "answer": ["a", "c"]}
{"problem_id": "115A72", "problem_text_en": "A 28-year-old woman presents with swelling and pain in her left calf. She has had these symptoms for three days and has come for medical attention because the pain has increased and she has developed shortness of breath on exertion. She has a history of three spontaneous abortions but no significant family history. Her temperature is 36.8°C, pulse rate is 86 beats/min and regular, blood pressure is 120/78 mmHg, respiratory rate is 30 breaths per min, and SpO2 is 91% on room air. Heart sounds are normal except for accentuated second heart sound, and lung sounds are unremarkable. Her abdomen is flat and soft without palpable liver or spleen. Her left leg shows swelling and redness, and dorsiflexion of the ankle causes severe pain in the calf. Laboratory findings are as follows: red blood cell count 4.28 million/μL, Hb 13.8 g/dL, Ht 39%, white blood cell count 4,300/μL, platelet count 80,000/μL, PT-INR 0.9 (reference range 0.9-1.1), APTT 58.2 seconds (reference range 32.2 seconds), D-dimer 8.4 μg/mL (reference range ≤ 1.0 μg/mL), urea nitrogen 14 mg/dL, creatinine 0.6 mg/dL, uric acid 3.6 mg/dL. Which tests should be performed? Select two.", "choices_en": ["Blood culture.", "Bone marrow examination", "Head MRI (Magnetic Resonance Imaging)", "Chest CT with contrast agent", "Lower-extremity venous duplex ultrasound examination"], "answer": ["d", "e"]}
{"problem_id": "115A73", "problem_text_en": "A 68-year-old woman visited the hospital because she was diagnosed with hypercalcemia during a blood test at the emergency department. Three days ago, she visited the emergency department with back pain and was diagnosed with urolithiasis. She has a history of hypertension and has experienced three episodes of urolithiasis in the past. She is conscious and alert with a body temperature of 36.2°C, a pulse rate of 82 bpm and a blood pressure of 156/90 mmHg. No abnormalities are observed in her heart sounds or breath sounds. Tenderness is observed on the right back upon percussions. No abnormalities are observed upon neurological examination. The patient's blood test results show: serum albumin 3.7 g/dL, Ca 11.2 mg/dL, P 2.4 mg/dL, and parathyroid hormone (PTH) level of 170 pg/mL (normal range: 10-60). A CT scan of the abdomen is also shown. Which of the following is appropriate as a test result of this patient? Select two.", "choices_en": ["Low bone mineral density in the femoral neck", "Low urinary P reabsorption (TRP %)", "Decrease in urinary calcium excretion", "Corrected serum calcium level of 12.5mg/dL", "Decrease in blood 1,25 (OH) vitamin D"], "answer": ["a", "b"]}
{"problem_id": "115A74", "problem_text_en": "An 85-year-old woman has been complaining of fatigue for 3 weeks. She was found collapsed in the bathroom, breathing with her shoulder, and was transported to the hospital. She is confused and has a body temperature of 35.1°C, heart rate of 44 beats/minute, blood pressure of 80/40 mmHg, and respiratory rate of 12/minute. Her SpO2 is 78% under a mask with oxygen flow at 5 L/minute. Her face is edematous and her eyebrows are thin, and her skin is dry. She has a goiter and edema in her lower legs. A chest X-ray of the patient is shown separately. Which of the following is elevated in this patient? Select two. \n\n(TSH 160.5 μU/mL (normal range 0.2–4.0), FT4 0.04 ng/dL (normal range 0.8–2.2))", "choices_en": ["Creatine kinase (CK)", "Blood glucose level", "Sodium", "Calcitonin", "Total cholesterol"], "answer": ["a", "e"]}
{"problem_id": "115A75", "problem_text_en": "A 68-year-old female was brought in by ambulance due to a decrease in consciousness level. She had cold-like symptoms for five days and missed regular medication due to poor appetite and fatigue. Three days ago, she developed a fever of over 38℃ and was found crouching at home by family members who called an ambulance. Her medical history includes non-functional pituitary tumor excised by transsphenoidal surgery two years ago, however, remnants of the tumor were noted. She has been continuously taking hydrocortisone and levothyroxine since then. Her consciousness level on arrival was JCS II-20. Her body temperature was 38.4℃, blood pressure was 80/46 mmHg, heart rate was 122 beats per minute and regular, respiratory rate was 24 per minute, and SpO2 was 94% on room air. Which of the following should be the first interventions? Choose three.", "choices_en": ["Administration of NSAIDs", "Intravenous infusion of physiological saline", "Intravenous glucose infusion", "Hydrocortisone intravenous injection", "Administration of Levothyroxine via a gastric tube"], "answer": ["b", "c", "d"]}
