{"problem_id": "114A1", "problem_text_en": "Which combination of disease and standard treatment is incorrect?", "choices_en": ["Urticaria --------- H1 receptor antagonist oral medication", "Food allergy --------- elimination of causative food", "Atopic dermatitis --------- Topical corticosteroids", "Anaphylaxis --------- Intravenous adrenaline", "Bronchial asthma attack (acute exacerbation) --------- inhalation of β2 agonists"], "answer": ["d"]}
{"problem_id": "114A2", "problem_text_en": "Which of the following combinations of the underlying diseases and their characteristics in chronic cough is incorrect?", "choices_en": ["COPD (Chronic Obstructive Pulmonary Disease) --------- Smoking history", "Cough-variant asthma --------- Seasonal", "Atopic cough - Pharyngeal itching sensation", "Gastroesophageal reflux disease (GERD) --------- Post-nasal drip", "Sinobronchial syndrome --------- Purulent sputum"], "answer": ["d"]}
{"problem_id": "114A3", "problem_text_en": "A 2-day-old (gestational age: 30 weeks and 2 days) newborn is hospitalized in the neonatal intensive care unit. A peripheral blood test is required to check the platelet counts. A picture of the items needed for sample submission is shown separately. Which one is correct?", "choices_en": ["① (This is not a translation but a transcription of the numeric symbol \"1\" using Japanese characters.)", "Sorry, I cannot translate \"②\" as it is a symbol and lacks context. It could represent a number, a letter, a direction, a position, or any other meaning depending on the context of the question.", "I'm sorry, it is not possible to translate ③ without the context of the question. ③ is just a symbol or digit, and can have different meanings depending on the context.", "Sorry, I cannot translate \"④\" without further context. It is likely a designation for an option in a multiple-choice question, but I would need to know the surrounding text to provide an accurate translation.", "Unfortunately, since there is no context or information about the question, it is not possible to accurately translate ⑤ without more information. Please provide further context."], "answer": ["a"]}
{"problem_id": "114A4", "problem_text_en": "Which of the following statements about palmar hyperhidrosis is incorrect?", "choices_en": ["Psychogenic sweating is increased.", "The number of sweat glands is increasing.", "Prone to fungal and bacterial infections.", "Iontophoresis is used for treatment.", "The Minor method is a testing method that uses iodine-starch reaction."], "answer": ["b"]}
{"problem_id": "114A5", "problem_text_en": "Which of the following combinations of trace elements or vitamins with suspected pathological conditions or deficiencies is correct?", "choices_en": ["Clubbed nails --------- Copper", "Taste disturbance --------- Zinc", "Bleeding tendency ---------- Vitamin A", "Pellagra - Vitamin B2", "Osteomalacia --------- Vitamin C"], "answer": ["b"]}
{"problem_id": "114A6", "problem_text_en": "What should be immediately administered for tetany that occurs after total thyroidectomy?", "choices_en": ["Anti-thyroid medication", "Anticonvulsant medication", "Calcium supplements", "Bisphosphonate preparations", "Active form vitamin D preparation"], "answer": ["c"]}
{"problem_id": "114A7", "problem_text_en": "Which of the following combinations of disease and treatment is correct?", "choices_en": ["Multiple hepatocellular carcinoma ------- Transcatheter arterial chemoembolization (TACE)", "Cholecystolithiasis complicated with gallbladder cancer - Laparoscopic cholecystectomy", "Idiopathic portal hypertension - Portal vein stent placement", "Intraductal papillary mucinous neoplasm (IPMN) of the pancreas - Placement of pancreatic stent", "Acute suppurative obstructive cholangitis --------- choledochectomy"], "answer": ["a"]}
{"problem_id": "114A8", "problem_text_en": "Which of the following statements is accurate regarding selective mutism?", "choices_en": ["Common during puberty.", "Hearing is normal.", "Due to a language comprehension disorder.", "Electroencephalography (EEG) is useful in diagnosis.", "Therapy using voice exercises is effective."], "answer": ["b"]}
{"problem_id": "114A9", "problem_text_en": "Which of the following conditions or pathologies is not included in the group of diseases with a high risk of onset in patients with obstructive sleep apnea syndrome?", "choices_en": ["Heart failure", "Sudden death", "Hypertension", "Atrial fibrillation", "Constrictive pericarditis"], "answer": ["e"]}
{"problem_id": "114A10", "problem_text_en": "Which of the following is caused by compression of cranial nerves by intracranial vessels?", "choices_en": ["Migraine", "Trigeminal neuralgia", "Essential tremor", "Parkinson's disease", "Temporal lobe epilepsy"], "answer": ["b"]}
{"problem_id": "114A11", "problem_text_en": "Which medication should be discontinued prior to pregnancy in a woman with rheumatoid arthritis who desires to conceive?", "choices_en": ["Tacrolimus", "Indomethacin", "Etanercept", "Methotrexate", "Sulfasalazine"], "answer": ["d"]}
{"problem_id": "114A12", "problem_text_en": "Which of the following is not related to the refractory nature of acute otitis media in children?", "choices_en": ["Age 6 and above", "Immune deficiency", "Complication of sinusitis", "Attendance at a Group Daycare Center", "Detection of drug-resistant bacteria in ear discharge"], "answer": ["a"]}
{"problem_id": "114A13", "problem_text_en": "Which of the following statements about kidney lesions in IgG4-related diseases is correct? Select two.", "choices_en": ["It is commonly seen in adolescence.", "There is interstitial nephritis observed.", "The initial symptom is often fever.", "Diagnosis of crescentic glomerulonephritis.", "Treatment is primarily based on corticosteroids of the adrenal cortex."], "answer": ["b", "e"]}
{"problem_id": "114A14", "problem_text_en": "Please refer to the separate images of transthoracic echocardiography (A-C). Which of the following findings are observed? Select two.", "choices_en": ["Ventricular aneurysm", "Pericardial effusion", "Mitral stenosis", "Asymmetric hypertrophy of the ventricular septum", "Anterior motion of the mitral valve in systole"], "answer": ["d", "e"]}
{"problem_id": "114A15", "problem_text_en": "Which three of the following items are required for calculating estimated glomerular filtration rate (eGFR) in adults?\n\n- 年齢 (age)\n- 性別 (gender)\n- 血清尿素窒素値 (serum urea nitrogen level)\n- 血清クレアチニン値 (serum creatinine level)\n- 身長 (height)", "choices_en": ["Age", "Gender", "Volume of urine", "Proteinuria levels", "Serum creatinine level"], "answer": ["a", "b", "e"]}
{"problem_id": "114A16", "problem_text_en": "A 19-year-old man complains of numbness in his left palm and has come to the clinic. Since one year ago, he has been practicing guitar for 6 hours every day as a member of a university circle. He has been aware of a tingling numbness in his left palm for one month. The numbness occurs when waking up or during guitar practice. He is 172 cm tall and weighs 62 kg, with a pulse of 64/min and blood pressure of 116/62 mmHg; heart and respiratory sounds are normal, tendon reflexes are normal, and there is no muscle atrophy. There is no clear impairment of other sensory modalities, but persistent positioning of his limbs in a certain way for one minute induces a numbness in the palm on the medial side of his left thumb to middle fingers. Which condition is most likely?", "choices_en": ["Carpal tunnel syndrome", "Cubital tunnel syndrome", "Thoracic outlet syndrome", "Cervical spondylotic radiculopathy", "Anterior interosseous nerve syndrome"], "answer": ["a"]}
{"problem_id": "114A17", "problem_text_en": "A 2-month-old infant came to the hospital with parents for a detailed examination following the newborn hearing screening. The baby shows almost no response to family calls or surrounding sounds, but is within the average range for weight and height at this age. There are no abnormalities detected in the external auditory canal or tympanic membrane. CT of the temporal bone shows no abnormalities in the middle or inner ear. Auditory brainstem response (ABR) is absent in both ears, whereas otoacoustic emissions (OAE) confirm residual hearing in the low to mid-frequency range in both ears. Which of the following explanations to the parents is appropriate for the doctor to give?", "choices_en": ["\"It's functional hearing loss.\"", "\"Let's start using a hearing aid.\"", "\"We will treat with adrenocortical steroids.\"", "\"We will schedule cochlear implant surgery immediately.\"", "\"Please wait and observe the child until their 18-month health examination\""], "answer": ["b"]}
{"problem_id": "114A18", "problem_text_en": "A 77-year-old man presented with pain in the soles of his feet and a purple discoloration. Three weeks ago, he was urgently hospitalized for acute coronary syndrome and underwent percutaneous coronary intervention on the same day. He visited the hospital due to skin changes with pain that had appeared one week ago. The serum creatinine level 3 weeks ago was 1.2 mg/dL. He has a 50-year history of smoking 30 cigarettes per day. His height is 153 cm, his weight is 52 kg. Pulse rate is 80 bpm and regular. Blood pressure is 152/80 mmHg. No abnormalities were found in heart sounds and breath sounds. There was no edema in the legs. Painful, dark purple skin patches were noted on the soles of both feet. Urinalysis revealed protein 1+, glucose (-), and occult blood (-). Blood analysis showed a red blood cell count of 3.5 million, Hb 10.3 g/dL, Ht 31%, WBC 7,600 (neutrophils 65%, eosinophils 15%, monocytes 5%, lymphocytes 15%), and platelet count 150,000. Biochemical analysis showed a total protein of 7.1 g/dL, albumin of 3.4 g/dL, blood urea nitrogen of 38 mg/dL, creatinine of 2.8 mg/dL, total cholesterol of 290 mg/dL, and triglycerides of 240 mg/dL. Immunological analysis showed a CRP of 1.8 mg/dL, MPO-ANCA negative, and PR3-ANCA negative. A photograph of the sole of the foot is shown separately. What is the most likely condition?", "choices_en": ["Malignant nephrosclerosis", "Systemic lupus erythematosus nephritis", "Renal vein thrombosis", "ANCA-associated vasculitis", "Cholesterol embolism syndrome"], "answer": ["e"]}
{"problem_id": "114A19", "problem_text_en": "A 3-year-old boy developed right-sided ptosis 5 days ago, which gradually became more prominent, so he was brought to the hospital by his grandmother. Bilateral ptosis was not observed in photographs taken 1 year ago. There is no history of trauma. The child is conscious and active, running around energetically. Examination reveals bilateral ptosis with right dominance, which is more prominent at night, according to the grandmother. There is no problem with swallowing. There is no muscle atrophy in the limbs, and the tendon reflex is normal. The visual acuity is 0.8 (1.2 × +1.0 D) in the right eye and 0.7 (1.2 × +1.0 D) in the left eye, without astigmatism or abnormal eye movement. Which of the following is useful for diagnosis?", "choices_en": ["Brainwave", "Cerebrospinal fluid examination", "Polysomnography", "Auditory Brainstem Response (ABR)", "Edrophonium test"], "answer": ["e"]}
{"problem_id": "114A20", "problem_text_en": "A 24-year-old woman has been hospitalized for 3 days due to headache and fever. She had been experiencing low-grade fever and multiple joint pain for 2 weeks before her admission. She visited the hospital 3 days ago due to fever and headache above 38℃ and was admitted on the same day. At admission, her height is 160 cm, weight is 48 kg, and body temperature is 38.3℃. Her pulse rate is 92 beats per minute, regular, blood pressure is 126/74 mmHg, and respiratory rate is 18 breaths per minute. She has erythematous rash and painless oral ulcer. She has tenderness on both hand and knee joints. Her blood test results show: red blood cells 3.26 million, Hb 10.4 g/dL, Ht 28%, WBC 2,600 (neutrophil 70%, lymphocyte 16%), and platelet count 230,000. Her immunological test results show: CRP 0.1mg/dL, rheumatoid factor (RF) negative, anti-CCP antibody negative, anti-nuclear antibody (ANA) positive, anti-dsDNA antibody 134 IU/mL (reference value 12 or less), and anti-smith (Sm) antibody positive. Other test results show: negative anti-β2GPI antibody, negative anti-cardiolipin antibody, and negative lupus anticoagulant. From the 2nd day of hospitalization, she developed disorientation and subsequently became delirious. Her cerebrospinal fluid test result shows: clear and watery fluid, initial pressure of 130 mmH2O (reference value 70 to 170), 52 cells/mm3 (polymorphonuclear cells (PMN) 20%, mononuclear cells (MN) 80%), protein 87 mg/dL (reference value 15 to 45), and glucose 48 mg/dL (reference value 50 to 75). Her head MRI shows no abnormality. Which of the following agents is appropriate for the patient's treatment as a medication to be used in combination with adrenal corticosteroids?", "choices_en": ["Colchicine", "Anti-TNF-alpha antibody", "Methotrexate", "Anti-IL-6 receptor antibody", "Cyclophosphamide"], "answer": ["e"]}
{"problem_id": "114A21", "problem_text_en": "A 78-year-old man presents with a chief complaint of subcutaneous bleeding. He had painless subcutaneous bleeding in his left upper limb one week ago without any identifiable cause. Two days later, the bleeding reoccurred in his right upper limb, and this morning he discovered that there was widespread subcutaneous bleeding in both thighs. He experiences dyspnea upon exertion and has come to the clinic accompanied by family members. He is alert and oriented. His height is 168 cm, weight 58 kg, and temperature 36.3℃. His pulse rate is 104 beats per minute and regular, blood pressure is 130/80 mmHg, and respiratory rate is 24 breaths per minute. The conjunctiva appears pale. No superficial lymph nodes are palpable. A systolic ejection murmur is heard maximally at the second right intercostal space at the sternal border. There are no abnormal respiratory sounds. The abdomen is flat, soft, and no liver or spleen palpated. He has widely spread petechiae on his limbs and flank. Urinalysis is unremarkable. Laboratory data: Red blood cell 2.84 million/μL, hemoglobin 8.6 g/dL, hematocrit 25%, white blood cell 4,200/μL (neutrophils 66%, eosinophils 5%, basophils 1%, monocytes 13%, lymphocytes 15%), platelets 320,000/μL. Prothrombin time-international normalized ratio (PT/INR) is 1.1 (reference range, 0.9-1.1), activated partial thromboplastin time (APTT) is 72.2 seconds (control, 32.2 seconds). Which test is useful for diagnosis?", "choices_en": ["Bone marrow aspiration", "Skin biopsy", "Coombs test", "Measurement of antiplatelet antibody", "Measurement of Factor VIII activity"], "answer": ["e"]}
{"problem_id": "114A22", "problem_text_en": "A 32-year-old nulligravid woman presents with a desire for pregnancy. She got married at the age of 29 and has not used contraception. She has never been pregnant and has no abnormal genital bleeding. Her menarche started at 12 years of age. Her menstrual cycles are irregular, ranging from 40 to 90 days. She is 160 cm tall and weighs 70 kg. On pelvic examination, the uterus is of normal size and no adnexal masses are palpable. Which of the following is not useful for the evaluation of infertility?", "choices_en": ["Hysteroscopy", "Ultrasonography", "Basal body temperature measurement", "Hysterosalpingography (HSG)", "Progesterone challenge test"], "answer": ["e"]}
{"problem_id": "114A23", "problem_text_en": "A 48-year-old woman presents with dizziness as her chief complaint. She experienced a momentary, lightheaded feeling and fell down when she stood up from a squatting position during gardening this morning, so she came for examination. She did not lose consciousness. She reports experiencing similar episodes of dizziness occasionally for the past 4-5 days, always when standing up. Which of the following is the least priority in terms of diagnosis?", "choices_en": ["Heart murmur", "Low blood pressure", "Carotid bruit", "Asymmetry of hearing (left-right difference in hearing ability)", "Anemia of the eyelids and conjunctiva"], "answer": ["d"]}
{"problem_id": "114A24", "problem_text_en": "An 18-year-old man presented to the hospital with complaints of fever, vomiting, and diarrhea. A week ago, he suffered a scald on his forearm that caused blistering by boiling water at home. He was prescribed ointment at a local clinic and monitored, but today he came to the hospital with his family due to the onset of fever, vomiting, slightly viscous brown diarrhea. He had a consciousness level of JCS I-2, height of 165 cm, weight of 56 kg, and body temperature of 39.0°C. His pulse rate was 112/min, regular, and blood pressure was 80/40 mmHg. His respiratory rate was 24/min and SpO2 was 99% (room air). No abnormalities were found in the eyelid conjunctiva and eyeball conjunctiva. No abnormalities were found in heart sounds and breath sounds. His abdomen was flat, soft, and no liver or spleen were palpable. He had erythema over his entire body, and his scald wound was blistered. Blood test revealed a red blood cell count of 4.2 million, Hb 13.2 g/dL, Ht 42%, reticulocyte count 1.2%, white blood cell count of 9,300 (neutrophils 30%, bands 45%, eosinophils 1%, basophils 1%, monocytes 6%, lymphocytes 17%), and a platelet count of 250,000. Serum biochemistry showed total protein of 7.5 g/dL, albumin 3.9 g/dL, total bilirubin 0.8 mg/dL, AST 28 U/L, ALT 18 U/L, LD 178 U/L (normal range 120-245), ALP 120 U/L (normal range 115-359), γ-GT 9 U/L (normal range 8-50), CK 46 U/L (normal range 30-140), blood urea nitrogen 40 mg/dL, creatinine 1.2 mg/dL, Na 131 mEq/L, K 4.2 mEq/L, Cl 97 mEq/L, and CRP 4.4 mg/dL. Which microbe is the most likely cause?", "choices_en": ["E. coli (Escherichia coli)", "Pseudomonas aeruginosa", "Candida", "Pneumococcus (Streptococcus pneumoniae)", "Staphylococcus aureus"], "answer": ["e"]}
{"problem_id": "114A25", "problem_text_en": "A 30-year-old male has been frequently late for work lately and not able to concentrate, so his supervisor suggested he see an occupational physician. During the interview, he was advised to see a psychiatrist and came to the hospital. He had been working as an office worker since joining the company, but was transferred to the sales department three months ago. He has been experiencing decreased appetite during the weekdays and feeling somewhat down. He can sleep well the day before he has time off, but on other days he has trouble falling asleep and often wakes up in the middle of the night dreaming about work. He has not been absent from work and still enjoys surfing, his hobby, during his days off. What is the appropriate response for his initial consultation?", "choices_en": ["Recommend taking a leave of absence.", "Encouraging someone to do their best.", "Prescribe antidepressants.", "Conduct projective psychological tests.", "Listen to the person's thoughts on their work."], "answer": ["e"]}
{"problem_id": "114A26", "problem_text_en": "A 38-year-old primigravida (G1P0) presented with fever, chills, and abdominal fullness at 30 weeks of pregnancy. Her pregnancy had been uneventful and fetal growth was reported as normal. There was no significant medical history. The patient was alert and conscious, with a height of 161cm and weight of 60kg. Her body temperature was 38.8°C, pulse rate was 96 beats per minute and regular, blood pressure was 120/74 mmHg, and respiratory rate was 20 breaths per minute. Fetal heart rate monitoring showed tachycardia with moderate variability and occasional accelerations but no decelerations. Urinalysis showed yellow color, specific gravity of 1.010, pH of 6.0, negative for protein, glucose, ketones, and occult blood, and 0-1 red blood cells and 10-19 white blood cells per high-power field in the sediment. Complete blood count showed a hemoglobin level of 12.0 g/dL, white blood cell count of 13,100/μL (with 17% segmented neutrophils, 61% banded neutrophils, 2% eosinophils, 0% basophils, 10% monocytes, and 10% lymphocytes), and platelet count of 250,000/μL. Blood chemistry showed a total bilirubin level of 1.0 mg/dL, AST level of 32 U/L, ALT level of 24 U/L, blood urea nitrogen level of 12 mg/dL, creatinine level of 0.5 mg/dL, blood glucose level of 98 mg/dL, and electrolyte levels within normal limits. After obtaining blood and urine cultures, the patient was started on intravenous ceftriaxone. On the following day, both sets of blood cultures were reported positive. At that point, her body temperature was 38.5°C and the abdominal fullness persisted. A Gram stain of the blood cultures is shown separately. What is the appropriate treatment strategy with antibiotics?", "choices_en": ["Switch to ampicillin.", "Continue administering ceftriaxone until susceptibility test results are available.", "Discontinue ceftriaxone and observe the course.", "Switch to meropenem.", "Change to levofloxacin."], "answer": ["a"]}
{"problem_id": "114A27", "problem_text_en": "A 3-year-old girl visited the clinic after being informed of an abnormal eye position during her regular health checkup. Her vision was measured to be 0.3 in the right eye (0.5 with +3.0D) and 0.4 in the left eye (0.8 with +3.5D). Eye position photos are shown separately. Corrected visual acuity after the use of a cycloplegic agent was 0.5 (with +6.0D) in the right eye and 0.9 (with +6.0D) in the left eye. Which of the following is the appropriate treatment?", "choices_en": ["Prescription for glasses with +6.0D in the right eye and +6.0D in the left eye.", "Prescription for glasses: Right eye +3.0D, left eye +3.0D.", "Eyeglass prescription of right eye: +3.0D, left eye: +6.0D", "Near point of convergence (NPC) training", "Strabismus surgery"], "answer": ["a"]}
{"problem_id": "114A28", "problem_text_en": "A 3-year-1-month-old boy was brought to the clinic by his parents after being pointed out as having a low height during his 3-year-old health checkup. He was born by emergency cesarean section at 35 weeks and 3 days of gestation due to maternal pregnancy-induced hypertension. At birth, his weight was 2,160 g (>10th percentile) and his height was 44.0 cm (>10th percentile). He was admitted to the NICU for 2 weeks due to prematurity and low birth weight. He had poor feeding for the first 2 days after NICU admission. At the age of 1 year 6 months, he was able to walk and was able to say a few meaningful words such as \"mama.\" Although he was advised to have a follow-up every 6 months due to his low height and weight, he had not attended any follow-up visits. He has no apparent feeding difficulties and his food intake is similar to that of other children his age in the daycare center he attends. He can tell his name and age. There are no abnormal heart or respiratory sounds. His abdomen is flat and soft, and the liver and spleen are not palpable. There are no apparent abnormalities in his external genitalia. The father's height is 175 cm and the mother's height is 160 cm. The growth chart for the patient is shown separately. What is the most likely condition in the patient?", "choices_en": ["Congenital hypothyroidism", "Cushing's syndrome", "Prader-Willi syndrome", "Growth hormone deficiency dwarfism", "Small-for-gestational-age (SGA) dwarfism"], "answer": ["d"]}
{"problem_id": "114A29", "problem_text_en": "A 50-year-old man comes to the hospital for diabetes treatment. He noticed a decrease in vision and blurred vision in both eyes about a month ago and was diagnosed with proliferative diabetic retinopathy at a nearby ophthalmology clinic. He was referred to internal medicine for treatment. He has not undergone a health checkup before. He is a self-employed desk worker. In the past year, he has lost 8 kg in weight. He is 170 cm tall and weighs 62 kg. His pulse rate is 72/min and regular. His blood pressure is 182/102 mmHg. Both Achilles tendon reflexes are absent. The vibrational sensation of both ankles is significantly reduced. Urine test (fasting): protein 3+, glucose 3+, ketones 1+, occult blood (-). Blood biochemical findings (fasting): urea nitrogen 38 mg/dL, creatinine 2.4 mg/dL, blood glucose 348 mg/dL, HbA1c 14.6% (reference range 4.6 to 6.2), triglycerides 362 mg/dL, HDL cholesterol 28 mg/dL, LDL cholesterol 128 mg/dL, Na 136 mEq/L, K 5.2 mEq/L, Cl 98 mEq/L. Which of the following is the correct diet therapy for this patient?", "choices_en": ["Set the salt intake to 10g/day.", "The protein intake should be set at 45g/day.", "The total energy amount is set to 1,400kcal/day.", "The proportion of carbohydrates should be 40% of the total energy intake.", "The recommended cholesterol intake is 1,000mg per day."], "answer": ["b"]}
{"problem_id": "114A30", "problem_text_en": "A 72-year-old man presents with numbness and difficulty walking in his left leg. He has been undergoing treatment for advanced liver cancer and has lost 5 kg in the last 6 months. Today, after watching TV for about an hour with his legs crossed, he tried to walk and stumbled several times because his left toe caught on the floor, prompting him to seek medical attention. His consciousness is clear. He is 162 cm tall and weighs 49 kg. His body temperature is 36.3℃. His pulse rate is 68 beats per minute, regular. His blood pressure is 108/72 mmHg. His respiratory rate is 16 breaths per minute. His SpO2 level is 98% (room air). He experiences dull numbness on the dorsal side of his left foot. No swelling is observed in the lower leg, and the dorsalis pedis artery is palpable bilaterally. Tendon reflexes in both upper and lower limbs are normal. Manual muscle testing of his upper limbs is normal bilaterally, while that of his lower limbs (right/left) shows hip flexion 5/5, knee extension 5/5 and ankle dorsiflexion 5/1. Lumbar MRI scans do not show any significant abnormalities. Which diagnostic examination is useful to determine the definitive diagnosis?", "choices_en": ["Bone density measurement", "Spinal cord contrast imaging test", "Bone scintigraphy", "Nerve conduction study", "Lower extremity arterial ultrasound examination"], "answer": ["d"]}
{"problem_id": "114A31", "problem_text_en": "A 26-year-old female patient arrived at the emergency department with sudden palpitations and shortness of breath while having breakfast. Three weeks ago, health screening showed delta waves in her ECG, but echocardiography in a nearby hospital showed no abnormal findings. On arrival, her blood pressure was slightly low at 96/68 mmHg. The ECG on admission showed narrow QRS complex tachycardia at a rate of 180 beats per minute, with no ST elevation or T wave abnormalities. What is the most likely diagnosis of her arrhythmia?", "choices_en": ["洞不全性頻脈 (Dokyofukensei Hinmyaku)", "洞停止症候群 (Dysfunction of the natural pacemaker of the heart)", "心室頻拍", "Supraventricular tachycardia", "完全房室ブロック (Kanzen boshitsu burokku)"], "answer": ["d"]}
{"problem_id": "114A32", "problem_text_en": "A 26-year-old female patient visited the hospital requesting an additional prescription of NSAIDs. She has had lower abdominal pain during menstruation since she was 15 years old and has been using over-the-counter painkillers regularly. She came to the hospital 6 months ago when the pain became stronger. After examination, she was diagnosed with functional menstrual disorder and prescribed NSAIDs. Because the pain persisted, she had been taking double the recommended dosage of NSAIDs every day. Today, she came to the hospital requesting an additional increase in the dosage of NSAIDs. Which of the following is incorrect as a precaution when prescribing the additional medication?", "choices_en": ["Edema", "Nosebleed", "Elevated blood pressure", "Breast milk leakage", "Upper abdominal pain"], "answer": ["d"]}
{"problem_id": "114A33", "problem_text_en": "A 23-year-old male presents to the hospital with the chief complaint of difficulty breathing. He has been coughing up phlegm for the past 2 weeks, developed a fever 4 days ago, and started smoking a month ago. His respiratory rate is 22 breaths per minute. His SpO2 is 89% on room air. No abnormalities are detected in his heart sounds. Fine crackles are heard on both sides of his back. Chest x-ray shows diffuse ground-glass opacities and infiltrates on both sides. Chest CT shows ground-glass opacities with interlobular septal thickening and infiltrative shadows beyond the area. Lung biopsy reveals marked eosinophil infiltration. Eosinophils account for 42% in the bronchoalveolar lavage fluid. Which of the following descriptions of the disease is incorrect?\n", "choices_en": ["There are many cases of bronchial asthma complications.", "Smoking can be a contributing factor.", "The initial peripheral blood eosinophil count is normal.", "Recurrence after treatment is rare.", "The responsiveness of adrenal cortex steroids is good."], "answer": ["a"]}
{"problem_id": "114A34", "problem_text_en": "An 84-year-old man presented with fatigue and decreased urine volume. He underwent distal gastrectomy due to gastric cancer 3 years ago but discontinued follow-up visits 2 years ago. He presented 3 weeks ago with fatigue and 5 days ago with decreased urine volume. He is alert, afebrile, with a pulse of 80 beats/min, regular rhythm, blood pressure of 140/84 mmHg, and a respiratory rate of 18 breaths/min. The conjunctivae are a little anemic but do not show yellowing of the sclera. The heart and lung fields are normal. The abdomen is flat, soft, with surgical scars in the upper abdomen. Bilateral lower extremities have pitting edema. Laboratory findings showed red blood cells 3.82 million cells, Hb 11.1 g/dL, Ht 35%, and platelets 100,000, and biochemistry findings showed albumin 3.2 g/dL, total bilirubin 1.3 mg/dL, AST 38 U/L, ALT 42 U/L, LD 230 U/L (reference 120-245), and creatinine 2.8 mg/dL. Urine was not found in the bladder on abdominal ultrasound examination, and chest X-ray showed a cardiothoracic ratio of 56%. Abdominal CT is shown separately. What is the most appropriate initial treatment?", "choices_en": ["Hemodialysis", "Large volume infusion/fluid replacement", "Diuretic therapy", "Ureteral stenting", "Urinary catheterization"], "answer": ["d"]}
{"problem_id": "114A35", "problem_text_en": "A 67-year-old man was brought in by ambulance due to impaired consciousness. His wife found him collapsed at the entrance and requested an ambulance. Four days ago, he had difficulty speaking but recovered the following day. Two days ago, he developed a fever in the 38℃ range. Yesterday, he again had difficulty speaking. He has no history of stroke. His consciousness level is GCS 11 (E3V3M5). He is 170 cm tall, weighs 68 kg, and his body temperature is 38.2℃. His heart rate is 88 beats per minute and regular, and his blood pressure is 112/78 mmHg. He has anemic palpebral conjunctivae and jaundice in his ocular conjunctivae. He has purpura on his limbs. Laboratory data: RBC count 2.14 million, Hb 6.5 g/dL, Ht 20%, WBC count 7,400, and platelet count 4,000. Biochemistry: total protein 7.5 g/dL, albumin 3.7 g/dL, total bilirubin 3.9 mg/dL, direct bilirubin 0.5 mg/dL, AST 59 U/L, ALT 29 U/L, LD 2,350 U/L (normal range 120-245), ALP 216 U/L (normal range 115-359), BUN 40 mg/dL, creatinine 2.8 mg/dL, uric acid 19.2 mg/dL, Na 138 mEq/L, K 4.1 mEq/L, and Cl 101 mEq/L. Head MRI showed multiple small acute cerebral infarcts. A May-Giemsa-stained peripheral blood smear is also shown. What is the most important test to confirm the patient's diagnosis?", "choices_en": ["Fibrinogen degradation products", "PT-INR (Prothrombin time - International Normalized Ratio)", "Bleeding time", "Haptoglobin", "ADAMTS-13 activity"], "answer": ["e"]}
{"problem_id": "114A36", "problem_text_en": "A 4-year-old boy is brought to the clinic by his father with a complaint of white spots on the trunk. The father noticed the white spots on the trunk when the child was 5 months old, and consulted due to an increase in the number of white spots. The child has a history of seizures at 1 year of age. On examination, the child has various-sized white spots primarily on the buttocks and thighs. Papules are scattered around the nose on the face. A photograph of the thigh is shown separately. Which of the following is most likely to appear in this patient after puberty?", "choices_en": ["Nevus sebaceous", "Neurofibroma", "Dermatofibroma", "Acoustic neuroma", "Capillary hemangioma"], "answer": ["c"]}
{"problem_id": "114A37", "problem_text_en": "A 68-year-old man presents with complaints of anterior chest pain. He has a history of recurrent skin rashes on both palms for the past 2 years. He also reports an awareness of anterior chest pain for the last year. He came for examination due to an increase in chest pain over the last month. He has multiple pustular rashes on both palms. Swelling and tenderness are present in the proximal interphalangeal joints on both sides. He also shows bone hypertrophy, tenderness, and warmth in bilateral sternoclavicular joints. A chest X-ray of this patient is shown separately. What is the most likely cause of his joint lesions?", "choices_en": ["Rheumatoid arthritis", "Ankylosing spondylitis", "Chronic fatigue syndrome", "Palmoplantar pustulosis with psoriatic arthritis", "Rheumatoid polymyalgia"], "answer": ["d"]}
{"problem_id": "114A38", "problem_text_en": "A 76-year-old male patient is currently hospitalized for the treatment of lung cancer. He underwent a curative surgery involving a right lower lobectomy and lymph node dissection. Mild air leakage was observed from the chest drain immediately after the operation, but there were no problems with lung expansion according to the chest X-ray. On the third day after the surgery, there was still air leakage from the chest drain. The chest X-ray taken immediately after the operation (A) and the chest X-ray taken on the third day after the surgery (B) are shown separately. What is the finding observed in this patient?", "choices_en": ["Erythema", "Subcutaneous hematoma", "Subcutaneous nodules (Subcutaneous nodules or \"Aoki-Kanazawa Lesions\" are firm, raised, painless nodules that occur on the toes, fingers, or both, and are typically seen in patients with bacterial endocarditis.)", "Superficial venous dilation", "Swollen lymph nodes above the clavicle"], "answer": ["c"]}
{"problem_id": "114A39", "problem_text_en": "A 44-year-old woman presents with left leg swelling. She has had recurrent fevers, painful ulcers in the oral and genital areas, migratory joint pain, and painful rash on her legs and feet for a year. Three weeks ago, she developed swelling and pain in her left leg, which has not improved. She appears conscious and alert. Her height is 158 cm and weight is 45 kg. Her temperature is 39.9℃, heart rate is 100 beats/min, regular, and blood pressure is 96/60 mmHg. She has afta-type oral ulcers. Cardiac and respiratory examinations are unremarkable. Her abdomen is flat and soft, with no palpable liver or spleen, and there are no significant lymph nodes. Her left leg and ankle show mild warmth, but there is no swelling or tenderness in the limbs. Urinalysis shows no protein or blood and +3 WBC. Laboratory tests show a sedimentation rate of 73 mm/h, red blood cell count of 3.54 million/microliter, hemoglobin of 9.1 g/dL, hematocrit of 28%, white blood cell count of 8,400/microliter (neutrophils 72%, eosinophils 1%, basophils 5%, monocytes 10%, and lymphocytes 17%), platelet count of 360,000/microliter, prothrombin time international normalized ratio of 1.2, activated partial thromboplastin time of 27.8 seconds, fibrinogen level of 525 mg/dL, D-dimer level of 4.1 μg/mL, total protein of 7.3 g/dL, albumin of 2.3 g/dL, aspartate aminotransferase of 14 U/L, alanine aminotransferase of 11 U/L, lactate dehydrogenase of 144 U/L, blood urea nitrogen level of 9.1 mg/dL, creatinine level of 0.4 mg/dL, and creatine kinase level of 51 U/L. Her C-reactive protein level is 12 mg/dL. Photographs of both legs (A) and contrast-enhanced computed tomography of the groin (B) are separately shown. What is the most likely diagnosis?", "choices_en": ["Behçet's disease", "Takayasu arteritis", "Necrotizing fasciitis", "Antiphospholipid antibody syndrome", "May-Thurner Syndrome (iliac vein compression syndrome)"], "answer": ["a"]}
{"problem_id": "114A40", "problem_text_en": "A 33-year-old man presents with diarrhea as the primary complaint. He went on a two-week sightseeing trip to Southeast Asia and returned home two days ago. Watery diarrhea appeared from his return date, and yesterday he developed a fever in the 38-degree range, so he came to the clinic. He has nausea but no vomiting. His temperature is 38.3°C. His pulse is regular at 92 beats/minute, and his blood pressure is 120/78 mmHg. His respiratory rate is 16/minute, and there are no abnormal heart or respiratory sounds. The abdomen is flat and soft, and the liver and spleen are not palpable. Bowel sounds are increased. He has mild tenderness throughout the abdomen but no rebound tenderness. There are no rashes on his skin. Which of the following tests is the most appropriate for making a definitive diagnosis?", "choices_en": ["Abdominal contrast-enhanced CT scan", "Gram staining of stool", "Abdominal ultrasound examination", "Stool acid-fast bacilli staining", "Clostridioides difficile toxin in stool"], "answer": ["b"]}
{"problem_id": "114A41", "problem_text_en": "A 1-year-old boy was brought to the clinic by his mother due to erythematous rash and pigmentation on his trunk. At 4 months of age, he began to develop pruritic erythematous papules and wheals on his neck and trunk after taking a bath, so his mother brought him for a medical consultation. Pigmented patches and scattered infiltrated erythema up to 2 cm in diameter were observed on his neck and trunk. A wheal appeared a few minutes after rubbing the pigmented patches. Skin biopsy revealed dense infiltration of cells containing reddish-purple granules stained with toluidine blue within the dermis. An image of the rash on the trunk is shown separately. What is the possible diagnosis?", "choices_en": ["Sweet's syndrome", "Acute urticaria", "Quincke edema (also known as angioedema or angioneurotic edema)", "Physical urticaria or hives due to external physical factors (such as temperature changes, pressure, vibration, or sun exposure)", "Atopic dermatitis"], "answer": ["d"]}
{"problem_id": "114A42", "problem_text_en": "A 34-year-old man presented complaining of headache, facial changes, and increased volume of his hands and feet. He reports that family members have been observing changes in his facial appearance for the past 2 years, and he has been experiencing headaches for the past year. He is 182 cm tall and weighs 98 kg with a pulse of 80 beats/min and blood pressure of 156/90 mmHg. On examination, he has frontal bossing, enlargement of the nose and lips, and macroglossia. No abnormalities are detected on chest or abdominal examination. Endocrine investigations revealed GH of 8.5 ng/mL (normal <2.5 ng/mL for males), IGF-1 of 780 ng/mL (normal range for a 34-year-old male is 102-283 ng/mL), ACTH of 35 pg/mL (normal range 7.2-63.3 pg/mL), prolactin of 62.0 ng/mL (normal range 3.6-12.8 ng/mL), and cortisol of 14 μg/dL (normal range 6.24-18.0 μg/dL). A plain X-ray of the head is shown separately. Which of the following is not observed in this patient?", "choices_en": ["Cardiomegaly", "Impaired glucose tolerance", "Hypophosphatemia", "Sleep apnea", "Carpal tunnel syndrome"], "answer": ["c"]}
{"problem_id": "114A43", "problem_text_en": "A 36-year-old man presents complaining of a mass in the anterior neck. He first noticed it two months ago, but it has not changed in size since. A soft, spherical, solitary mass measuring 25 x 25 mm can be palpated in the midline of the anterior neck near the hyoid bone. The mass is elevated on swallowing. A contrast-enhanced CT of the neck is shown separately. What is the diagnosis?", "choices_en": ["Lateral cervical cyst", "Pilar cyst", "Thyroglossal duct cyst", "Adenomatous thyroid nodule", "Cystic lymphangioma"], "answer": ["c"]}
{"problem_id": "114A44", "problem_text_en": "A 35-year-old woman complains of early satiety and epigastric pain. She has been aware of early satiety after meals for the past 6 months, and especially experiences epigastric pain after eating fatty foods, so she visited a hospital. There is no abnormality in her bowel movements, and past medical history is unremarkable. She is 158 cm tall and has lost 3 kg in weight over the past 6 months, now weighing 46 kg. Her abdomen is flat, soft, and liver and spleen are not palpable. Blood tests show: red blood cells: 4.08 million, hemoglobin 12.8 g/dL, hematocrit 39%, white blood cells 5,300, and platelets 200,000. Biochemical blood tests show: albumin 4.1 g/dL, total bilirubin 0.8 mg/dL, AST 21 U/L, ALT 19 U/L, LD 194 U/L (reference range 120-245), ALP 145 U/L (reference range 115-359), γ-GT 14 U/L (reference range 8-50), amylase 89 U/L (reference range 37-160), blood urea nitrogen 15 mg/dL, serum creatinine 0.7 mg/dL, uric acid 3.9 mg/dL, blood glucose 88 mg/dL, HbA1c 5.6% (reference range 4.6-6.2%), total cholesterol 176 mg/dL, triglyceride 91 mg/dL, and electrolytes: Na 140 mEq/L, K 4.3 mEq/L, Cl 101 mEq/L. No abnormalities are found on upper gastrointestinal endoscopy and abdominal ultrasound. What is the most likely diagnosis?", "choices_en": ["Chronic pancreatitis", "Gastroesophageal reflux disease (GERD)", "Irritable Bowel Syndrome (IBS)", "Esophageal achalasia", "Functional dyspepsia"], "answer": ["e"]}
{"problem_id": "114A45", "problem_text_en": "A 70-year-old man complains of shortness of breath and seeks medical attention as he has recently noticed shortness of breath while playing his hobby of ground golf. He has no smoking history. His heart sounds reveal a fixed split of the second heart sound and a systolic murmur is heard at the left sternal border of the second rib. There are no abnormal respiratory sounds and no edema in the lower limbs. Cyanosis and clubbing of the fingers are not observed. An electrocardiogram reveals normal sinus rhythm and incomplete right bundle branch block. Chest X-ray (A) and echocardiography (B) are shown separately. Subsequently, cardiac catheterization was performed. Which of the following are the correct oxygen saturation percentages (%) of different parts in this patient? (SVC: Superior vena cava, RA: Right atrium, RV: Right ventricle, PA: Pulmonary artery, LV: Left ventricle).", "choices_en": ["SVC 70, RA 84, RV 83, PA 85, LV 98", "SVC 70, RA 69, RV 83, PA 85, LV 98 (These appear to be numerical values for measuring pressure or volume in different parts of the heart, but without context it is not possible to provide a more accurate translation.)", "SVC 70, RA 69, RV 69, PA 70, LV 98 (These are likely numerical values from medical imaging or testing, and do not require translation)", "SVC 70, RA 69, RV 69, PA 85, LV 98", "SVC 70, RA 69, RV 69, PA 70, LV 89 (This choice seems to be a list of numerical values associated with different anatomical structures or physiological measurements, but without contextual information it is difficult to provide a more specific translation.)"], "answer": ["a"]}
{"problem_id": "114A46", "problem_text_en": "A 78-year-old woman presents with abnormal behavior. She has gradually become forgetful over the past two years and was diagnosed with mild cognitive impairment (MCI) a year ago, but has been under observation as there has been no impact on daily life. A month ago, while having lunch with her husband at home, she suddenly dropped her chopsticks. Her husband called out to her, but she did not respond and stopped moving, staring into space and repeatedly making a cupping motion with her mouth to swallow saliva. After about a minute, she suddenly stood up and started pacing around the room. When her husband tried to stop her, she resisted violently. After about 30 minutes, she was gradually able to speak again and returned to her usual state, although she did not remember what had happened during the episode. Her husband accompanied her for consultation because this strange behavior occurred 2-3 times a week. She is alert and conscious. She is 148 cm tall, weighs 46 kg, has a body temperature of 36.2°C, a pulse of 64 beats per minute, regular blood pressure (116/68 mmHg), a respiratory rate of 18 per minute, and no abnormal heart or breathing sounds. Her abdomen is flat and soft, and no liver or spleen enlargement is palpable. The revised Hasegawa Dementia Scale scores 21 out of 30 points. There is no evidence of abnormal findings in the cranial nerves. Her tendon reflexes are normal and there is no motor paralysis, sensory impairment, or ataxia. Which of the following conditions could be considered as a possibility?", "choices_en": ["Delirium", "Parkinson's Disease", "Complex partial seizure", "Transient ischemic attack (TIA)", "Restless legs syndrome"], "answer": ["c"]}
{"problem_id": "114A47", "problem_text_en": "A 14-year-old boy presented with a complaint of itching in both eyes for the past month and decreased vision in the left eye for the past week. His corrected visual acuity was 1.0 in the right eye and 0.4 in the left eye. A photograph of the left upper eyelid is shown separately. What is the diagnosis?", "choices_en": ["Chalazion", "Hordeolum (sty)", "Spring catarrh", "Epidemic keratoconjunctivitis", "Chlamydial conjunctivitis"], "answer": ["c"]}
{"problem_id": "114A48", "problem_text_en": "A 70-year-old man presents with dysphagia as the chief complaint. He has been aware of difficulty swallowing food for two months, which has gradually made it difficult to eat and caused a 4 kg weight loss in one month. The patient's height is 170 cm, weight is 59 kg. His body temperature is 36.5°C, and his pulse is 76 bpm and regular. His abdomen is flat, soft, and no liver or spleen is palpable. His blood test results are: RBC 3.34 million, Hb 10.8 g/dL, Ht 31%, WBC 7,200, and platelets 180,000. Biochemical findings are: total protein 6.3 g/dL, albumin 3.3 g/dL, AST 36 U/L, ALT 40 U/L, blood urea nitrogen 19 mg/dL, creatinine 0.8 mg/dL, CEA 14 ng/mL (normal 5 or less), SCC 7.8 ng/mL (normal 1.5 or less). The endoscopic image of the upper digestive tract (A), H-E stained biopsy tissue (B), and abdominal contrast-enhanced CT scan (C) are shown separately. Which of the following is the most appropriate approach?", "choices_en": ["Liver resection surgery", "Exploratory laparotomy", "Esophagectomy", "Anticancer treatment with medication", "Endoscopic submucosal dissection (ESD)"], "answer": ["d"]}
{"problem_id": "114A49", "problem_text_en": "A 78-year-old man presents with chief complaint of exertional dyspnea. He has been aware of exertional dyspnea for the past six months, which has worsened over the past two weeks. He is alert and oriented. His body temperature is 37.0°C. Pulse rate is 100/min and regular. Blood pressure is 146/84 mmHg. Respiratory rate is 24/min. Oxygen saturation is 88% (room air). There are no abnormal heart sounds. Fine crackles are heard over both lung fields. No edema is observed in the lower legs. Chest X-ray (A) and chest CT (B) are presented separately. What is the most likely condition observed?", "choices_en": ["Decreased one-second forced expiratory volume (FEV1)", "Elevation of PaCO2", "Increased A-a gradient", "Serum LDH decrease", "Decrease in surfactant protein D (SP-D) in the blood"], "answer": ["c"]}
{"problem_id": "114A50", "problem_text_en": "A 56-year-old woman visited the clinic with the chief complaint of severe dizziness. A year ago, she developed papules on her nasal wings. She was diagnosed with cutaneous sarcoidosis and the rash gradually improved with topical corticosteroids over three months. She visited the clinic due to severe dizziness that began this morning. Her temperature was 36.7°C, and her pulse was regular at 40 beats per minute. Her blood pressure was 132/72 mmHg. There were no abnormalities in the conjunctiva or sclera of the eyes, and no jugular venous distension was observed. No abnormalities were detected in cardiac or respiratory sounds. Blood test results showed red blood cells at 4.14 million, Hb at 12.6 g/dL, white blood cells at 5,400, and platelets at 270,000. Additionally, her serum biochemistry results showed total protein at 7.4 g/dL, albumin at 4.3 g/dL, AST at 21 U/L, ALT at 22 U/L, LD at 261 U/L (reference range: 120-245), CK at 78 U/L (reference range: 30-140), and creatinine at 0.5 mg/dL. Her CRP level was 0.1 mg/dL. Chest X-ray showed no abnormalities, and electrocardiogram revealed complete atrioventricular block. Echocardiogram revealed a left ventricular ejection fraction of 45%. A temporary pacemaker was inserted for the complete atrioventricular block. What is the appropriate treatment?", "choices_en": ["NSAID (non-steroidal anti-inflammatory drug)", "Antituberculosis agent", "Colchicine", "Rituximab", "Adrenal cortex steroid"], "answer": ["e"]}
{"problem_id": "114A51", "problem_text_en": "A 52-year-old man accompanied by a colleague comes to the hospital due to altered mental status. He was found collapsed, crouching on the ground while performing cutting work on the reinforced concrete floor using a gasoline engine powered concrete cutter in a warehouse. The cutter was left running. Although his consciousness level was cloudy, he had no trauma and was brought to the hospital in a company car. Three colleagues who worked and came to the hospital together complained of headache and nausea. His conscious level is JCS II-10. His body temperature is 36.8°C, pulse rate - 88/min and regular, blood pressure - 146/80 mmHg, respiratory rate - 24/min, and SpO2 - 97% (room air). His complexion is flushed. No abnormalities were found in heart and respiratory sounds. His abdomen is flat, soft, and the liver and spleen cannot be palpated. Muscle tone is decreased in all four extremities. What should be done first in the treatment of this patient?", "choices_en": ["Gastric intubation", "Oxygen administration", "Intravenous glucose infusion", "Adrenaline intramuscular injection", "Inhalation of beta-stimulating agent administration"], "answer": ["b"]}
{"problem_id": "114A52", "problem_text_en": "A 2-month-old boy is brought to the hospital by his mother due to vomiting. He had been vomiting since the previous day and was referred to the hospital after a local clinic found a lump in his abdomen. He is 57 cm tall and weighs 5,360 g. He is conscious and his temperature is 36.8 ℃. His heart rate is 100 beats/min and regular, blood pressure is 76/40 mmHg, and respiratory rate is 24 breaths/min. There is mild anemia and his conjunctiva are pale. No abnormality is found in heart and lung sounds. His abdomen is distended and a hard mass approximately 10 cm in diameter is palpable in the lower left abdomen. Laboratory findings include: red blood cells 3.04 million/mm3, Hb 9.1 g/dL, Hct 26%, white blood cells 7,400/mm3, and platelets 400,000/mm3. Total protein is 5.6 g/dL, total bilirubin is 2.6 mg/dL, direct bilirubin is 0.9 mg/dL, and AST is 54 U/L, ALT is 25 U/L, and amylase is 13 U/L (reference range: 37-160). The blood urea nitrogen is 6 mg/dL, and creatinine is 0.2mg/dL. The CRP is 0.1 mg/dL, and urinary vanillylmandelic acid (VMA) is 645 mg/gCr (reference range: 4.5-12.7). An abdominal MRI is shown with a fat-suppressed T2-weighted transverse image (A) and a coronal view (B). What is the evidence that suggests a good prognosis of this patient?", "choices_en": ["Age", "Gender", "Size of the tumor.", "Hemoglobin level in the blood", "Urinary vanillylmandelic acid level"], "answer": ["a"]}
{"problem_id": "114A53", "problem_text_en": "A 60-year-old woman came to the clinic with a chief complaint of coughing. She has been receiving oral adrenal corticosteroids and methotrexate for rheumatoid arthritis for the last 5 years, and her condition has been stable. She has had a persistent cough for the past month. The chest X-ray (A) and chest CT scan (B) are shown separately. Bronchoscopy was performed, and acid-fast bacteria were detected in the bronchoalveolar lavage fluid test, with non-tuberculous acid-fast bacteria being cultured. Blood tests showed positive antibodies to MAC (Mycobacterium avium complex). Which of the following is the appropriate treatment?", "choices_en": ["A lung biopsy is necessary.", "Conduct health check-up for contacts.", "Hospitalize for individual room isolation.", "Notification to the health center is not required.", "Perform clarithromycin monotherapy."], "answer": ["d"]}
{"problem_id": "114A54", "problem_text_en": "A 22-year-old man presents with complaints of decreased vision and daytime blindness. He was diagnosed with atopic dermatitis in childhood. Since the age of 15, he has had intense itching of the eyelids and conjunctiva, for which he has used topical and eye drop corticosteroids, resorting to rubbing his eyes when the itching did not subside. He began to experience decreased vision and daytime blindness about a year ago. His visual acuity is 0.1 (0.9 × -3.0D) in the right eye and 0.1 (1.0 × -2.5D) in the left eye. His intraocular pressure is 13mmHg in the right eye and 17mmHg in the left eye. Anterior segment photos after dilation of both eyes are shown separately. A pigment dispersion in the anterior vitreous body is detected on slit-lamp microscopy in the right eye. What is the emergency complication that requires immediate treatment or surgery?", "choices_en": ["Conjunctivitis", "Cataract", "Keratoconus", "Retinal tear/hole", "Posterior vitreous detachment"], "answer": ["d"]}
{"problem_id": "114A55", "problem_text_en": "A 77-year-old man presents with the chief complaint of hematuria. He had been aware of occasional bouts of hematuria for the past 3 months but did not seek medical attention as the symptoms naturally subsided. However, he came in for an appointment as the hematuria had persisted for the past 2 days. He is a smoker, having smoked 20 cigarettes per day for 50 years, and occasionally drinks alcohol. The patient is 165 cm tall and weighs 70 kg. His pulse is regular with a rate of 72 beats per minute, and his blood pressure is 120/72 mmHg. His abdomen is flat and soft, with no palpable liver or spleen. The urine examination revealed more than 100 RBCs per high power field on microscopic examination of the urine sediment. His blood test results were as follows: RBC 3.95 million/μL, Hb 12.9 g/dL, Ht 38%, WBC 8,100 /μL, total protein 6.7 g/dL, albumin 3.8 g/dL, blood urea nitrogen 18 mg/dL, and creatinine 0.8 mg/dL. Urine cytology reveals Class V cells. Chest and abdominal contrast-enhanced CT scans (A and B) are shown separately. Which of the following is correct regarding this patient?", "choices_en": ["Recurrence is common in the bladder.", "It is a squamous cell carcinoma.", "It occurs in the proximal tubule.", "Related to abnormalities in the VHL gene.", "Showing early enhancement on dynamic CT of the abdomen."], "answer": ["a"]}
{"problem_id": "114A56", "problem_text_en": "A newborn of 6 days old is currently hospitalized in the NICU. The baby was born via an emergency cesarean section due to placental abruption. The gestational age at birth was 26 weeks and 4 days, and the birth weight was 750g. Tracheal intubation was performed six minutes after birth, and the baby opened its eyes 10 minutes later. After that, the baby received respiratory management in the NICU. An oral gastric tube was inserted and a small amount of milk was started on the first day of hospitalization. Today, milk remained in the stomach before milk injection and the abdomen was mildly swollen. The baby's temperature is 36.7℃, heart rate is 124/minute and regular, blood pressure is 52/24mmHg, respiratory rate is 48/minute, and SpO2 is 99% (FIO2 0.25). The abdomen is mildly swollen, and bowel sounds are decreased. There is movement in the limbs, and no abnormality in muscle tone is observed. Chest and abdominal X-ray images (in supine and left lateral positions) (A, B) are shown separately. What is the possible condition?", "choices_en": ["Pneumothorax", "Hepatic tumor/liver tumor", "Gastrointestinal perforation", "Intestinal atresia/stenosis", "Diaphragmatic hernia"], "answer": ["c"]}
{"problem_id": "114A57", "problem_text_en": "A 1-year-6-month-old boy was referred for evaluation of abnormal genitalia that was noted at birth, but was not evaluated until the family moved. He was born at 39 weeks of gestation with a birth weight of 3180g and Apgar score of 8 at 1 minute and 10 at 5 minute. He now weighs 10kg and has a body temperature of 36.5℃. His pulse is 92 beats per minute and regular, and the SpO2 is 97% on room air. No abnormalities are auscultated in the heart or breath sounds. His abdomen is flat and soft, without palpable liver or spleen. A portion of glans penis is exposed from the foreskin and the external urethral orifice is identified at the transition of the penis and scrotum. Separate photos of the external genitalia (A, B) are shown. What is the condition seen in this patient?", "choices_en": ["Hematuria", "Urinary retention", "Hydronephrosis", "Penile curvature", "Genuine urinary incontinence"], "answer": ["d"]}
{"problem_id": "114A58", "problem_text_en": "A 48-year-old man presented with the chief complaint of gait disturbance. He reported having had poor balance and increased falls for about five years. Gradually, he had become worse and began to stagger when walking, and he needed to use handrails when going up and down stairs, so he consulted a doctor. His cognitive function was normal. Bilateral gaze-evoked nystagmus was observed, but muscle weakness and sensory impairment were not observed. Cerebellar ataxia and pyramidal tract signs were present, but involuntary movements were not observed. Orthostatic hypotension and bladder and rectal dysfunction were not observed. He reported that his father, paternal grandfather, and uncle had similar symptoms. What is the most likely diagnosis?", "choices_en": ["Parkinson's disease", "Multiple system atrophy", "Huntington's disease", "Machado-Joseph disease", "Mitochondrial myopathy"], "answer": ["d"]}
{"problem_id": "114A59", "problem_text_en": "A 79-year-old male presents with a complaint of a swelling extending from the right inguinal region to the scrotum. He has been aware of the right inguinal hernia for two years, but came to the hospital this morning due to pain and inability to reduce the hernia. He is alert and conscious, and has a height of 165 cm, a weight of 50 kg, a body temperature of 35.9°C, a pulse rate of 64 bpm, and a blood pressure of 140/66 mmHg. His respiratory rate is 16 breaths per minute. The abdomen is flat and soft with a swelling extending from the right inguinal region to the scrotum, without any changes in the skin surface. Manual reduction was not possible. Laboratory findings showed red blood cells of 4.59 million, hemoglobin of 15.1 g/dL, hematocrit of 44%, white blood cells of 8,400, and platelets of 250,000. Biochemical results were as follows: total protein, 7.7 g/dL; albumin, 4.3 g/dL; total bilirubin, 0.9 mg/dL; AST, 26 U/L; ALT, 21 U/L; LD, 347 U/L (reference range, 120-245); CK, 148 U/L (reference range, 30-140); blood urea nitrogen, 18 mg/dL; creatinine, 0.9 mg/dL; blood glucose, 112 mg/dL; Na, 142 mEq/L; K, 4.2 mEq/L; Cl, 96 mEq/L; and CRP, 0.9 mg/dL. A pelvic CT is separately shown. What is the appropriate management?", "choices_en": ["Emergency surgery", "High-pressure enema", "Ileus tube placement", "Percutaneous drainage", "Endoscopic reduction surgery"], "answer": ["a"]}
{"problem_id": "114A60", "problem_text_en": "A 60-year-old woman presented to the hospital with the chief complaint of left axillary lymph node swelling. She first noticed a lump in her left axilla a month ago. Although there was no pain, the swelling gradually increased in size, prompting her to seek medical attention. She has no significant medical history. She was alert and oriented with a height of 158 cm, weight of 50 kg, and a body temperature of 37.8℃. Her pulse rate was 84 beats per minute and regular, blood pressure was 112/78 mmHg. A painless, 3-cm firm and elastic lymph node was palpated in the left axilla. Palpable lymph nodes, 1 cm in size in the right side of the neck and 3 cm in size in the right inguinal area were also detected. Blood test results showed red blood cell count of 4.24 million, Hb level of 13.7g/dL, hematocrit of 44%, white blood cell count of 4,600, and platelet count of 180,000. Blood chemistry revealed a total protein level of 7.7 g/dL, albumin level of 5.1 g/dL, total bilirubin level of 0.7 mg/dL, AST level of 33 U/L, ALT level of 27 U/L, LD level of 410 U/L (normal range: 120-245), ALP level of 320 U/L (normal range: 115-359), blood urea nitrogen level of 12 mg/dL, creatinine level of 1.0 mg/dL, and uric acid level of 4.5 mg/dL. Histopathological examination of the left axillary lymph node biopsy revealed that it was a diffuse large B-cell lymphoma that was CD20 positive. FDG-PET showed the whole body image of the patient. What is the appropriate treatment?", "choices_en": ["Localized radiation therapy", "Whole-body radiation exposure", "Monotherapy with bactericidal drugs", "Autologous peripheral blood stem cell transplantation", "Administration of molecular targeted drugs and bactericidal agents"], "answer": ["e"]}
{"problem_id": "114A61", "problem_text_en": "A 58-year-old woman visited the hospital after an abnormality was detected during a health examination. She has no symptoms and no history of alcohol consumption or blood transfusion. Her height is 152 cm, and weight is 72 kg. Her blood pressure is 152/84 mmHg. There are no abnormalities in the palpebral conjunctiva or eyeball conjunctiva, heart sounds, or breath sounds. The abdomen is flat, soft, and the liver and spleen cannot be palpated. No abnormality was found on neurological examination. Lab results: red blood cells 3.85 million, Hb 12.5 g/dL, Ht 38%, white blood cells 4,900, platelets 180,000. Biochemical blood test results: albumin 4.4 g/dL, total bilirubin 1.1 mg/dL, direct bilirubin 0.8 mg/dL, AST 78 U/L, ALT 92 U/L, LD 293 U/L (reference range 120-245), ALP 347 U/L (reference range 115-359), γ-GT 94 U/L (reference range 8-50), amylase 79 U/L (reference range 37-160), blood urea nitrogen 18 mg/dL, creatinine 0.9 mg/dL, uric acid 6.9 mg/dL, blood glucose 158 mg/dL, HbA1c 7.6% (reference range 4.6-6.2), total cholesterol 216 mg/dL, triglycerides 190 mg/dL, Na 139 mEq/L, K 4.4 mEq/L, Cl 103mEq/L. Which of the following is most likely the cause of liver dysfunction in this patient?", "choices_en": ["Wilson's disease", "Gilbert's syndrome", "Autoimmune hepatitis", "Primary biliary cholangitis", "Non-alcoholic fatty liver disease (NAFLD)"], "answer": ["e"]}
{"problem_id": "114A62", "problem_text_en": "A 23-year-old woman presents with left lower abdominal pain. She experienced sudden onset of left lower abdominal pain while commuting on a train in the morning, which improved naturally after about 2 hours. She is concerned because a similar pain attack occurred 2 months ago. She has no significant medical or family history. She has monthly menstrual cycles that are 28 days long, regular and last for 5 days. Her height is 158 cm, weight is 48 kg. Her body temperature is 36.6℃, pulse rate is 72 beats/minute, regular. Her blood pressure is 100/64 mmHg and respiratory rate is 18/minute. There are no abnormalities in the conjunctiva and cornea. A mild abdominal tenderness and a palpable mass are found from the pubic bone to 6 cm above the umbilicus. The uterus is of normal size with no tenderness. Laboratory findings showed red blood cell count of 3.8 million, Hb 10.1 g/dL, hematocrit 32%, white blood cell count of 4,000, and platelet count of 190,000. Biochemical blood examination showed total protein of 7.0 g/dL, AST of 22 U/L, ALT of 20 U/L, LD of 190 U/L (normal range 120-245), alpha-fetoprotein (AFP) of 5 ng/mL (normal range <20), CA19-9 of 35 U/mL (normal range <37), and CA125 of 30 U/mL (normal range <35). The T2-weighted image (A), T1-weighted image (B), and fat-suppressed T1-weighted image (C) of the lower abdomen MRI are shown separately. Which of the following is appropriate treatment?", "choices_en": ["Surgical resection", "Radiation therapy", "Administration of molecular targeted drugs", "Administration of hormonal medication", "Adrenal cortex steroid administration"], "answer": ["a"]}
{"problem_id": "114A63", "problem_text_en": "A 90-year-old man stumbled over a step during a walk, fell down, and became unable to walk. He was transported by ambulance to the hospital. Prior to the fall, he was able to walk independently without the use of walking aids. The patient's consciousness is clear. His body temperature is 36.9°C, heart rate is 92 bpm and regular, blood pressure is 120/70 mmHg, and respiratory rate is 16 breaths/min. His SpO2 is 98% (with room air). No abnormal sounds are heard on auscultation of the heart and lungs. The abdomen is flat, soft, and no hepatosplenomegaly is palpated. There are no wounds on the head or limbs. There is pain in the right hip joint, and he cannot move his right leg. However, there is no paralysis. X-ray images of both hip joints are separately shown. What is the most appropriate response at this stage?", "choices_en": ["Transfer to a care facility", "Accessible early surgery", "Independent living training with a wheelchair.", "Local traction therapy for about 1 month", "Fixation of the right hip joint with a plaster cast"], "answer": ["b"]}
{"problem_id": "114A64", "problem_text_en": "A 35-year-old woman is being explained her medical condition after treatment for a sexually transmitted infection. The patient presented to the hospital four weeks ago with an increase in vaginal discharge and lower abdominal pain. She had tenderness in the adnexa and tested positive for genital Chlamydia DNA in the cervical swab. Antibacterial treatment was started which resulted in a decrease in vaginal discharge, resolution of abdominal pain and tenderness, and a negative genital Chlamydia DNA test. Which of the following is appropriate to explain to the patient?", "choices_en": ["A three-month contraception is desirable.", "The Chlamydia infection has been cured.", "The risk of ectopic pregnancy decreased.", "There is a high possibility of becoming infertile due to uterine factors.", "You will not get chlamydia infection in the future."], "answer": ["b"]}
{"problem_id": "114A65", "problem_text_en": "A 40-year-old woman with a history of 5 vaginal deliveries (gravida 6, para 5) presented with decreased fetal movement at 34 weeks and 3 days of gestation. Although her pregnancy had been progressing smoothly, she had not received regular prenatal care since a routine examination at 30 weeks due to being busy and economic reasons. Her height was 152 cm and weight was 62 kg. Her temperature was 36.8°C, pulse rate was 84 bpm, and blood pressure was 116/72 mmHg. No uterine contractions were observed. Abdominal ultrasound examination revealed absent fetal heartbeats. The estimated fetal weight was 1,500 g, which was similar to the weight estimated at the 30-week prenatal examination. There were no abnormal findings in the placenta. Which of the following blood tests should be conducted immediately? Select two.", "choices_en": ["FDP (Fibrinogen Degradation Products)", "Platelet count", "Anti-phospholipid antibody", "Fetal hemoglobin", "Indirect Coombs test"], "answer": ["a", "b"]}
{"problem_id": "114A66", "problem_text_en": "A 48-year-old woman presents with chief complaint of general malaise. She has been drinking 5 go of Japanese sake almost every day for 20 years. She experienced convulsions when admitted to the hospital 6 months ago for acute gastroenteritis. She was admitted to the hospital again after visiting the emergency room due to loss of appetite, fatigue, and abdominal distension that occurred one week ago. Her consciousness level is JCS I-3. She is 158 cm tall and weighs 59 kg. Her body temperature is 37.4℃. Her pulse is 108 bpm and regular. Her blood pressure is 122/78 mmHg. Her respiratory rate is 20 breaths per minute. Her SpO2 is 96% on room air. Her conjunctivae appear anemic, and her sclera shows yellowing. No abnormalities in heart and respiratory sounds are detected. Her abdomen is slightly protuberant and wave-like movement is observed. She shows sweating all over her body. Laboratory data: Red blood cells 2.47 million/μL, Hb 9.6 g/dL, Hct 28%, WBC 15,000/μL, Platelets 50,000/μL, PT-INR 2.1 (reference 0.9-1.1), Total protein 6.2 g/dL, Albumin 2.6 g/dL, Total bilirubin 6.1 mg/dL, Direct bilirubin 3.4 mg/dL, AST 136 U/L, ALT 45 U/L, LD 362 U/L (reference 120-245), ALP 384 U/L (reference 115-359), γ-GT 223 U/L (reference 8-50), Amylase 68 U/L (reference 37-160), Creatinine 1.6 mg/dL. HBs antigen negative, HCV antibody negative. Which of the following is an appropriate response? Select two.", "choices_en": ["Platelet transfusion", "Administration of vitamin B complex", "Gamma globulin administration", "Endoscopic retrograde biliary drainage", "Administration of benzodiazepine-type drugs"], "answer": ["b", "e"]}
{"problem_id": "114A67", "problem_text_en": "A 43-year-old woman presented with palpitations and neck pain. She had developed nighttime fever and cough a week prior and had received generalized cold medication from a clinic near her home. Although her cold symptoms improved, she developed neck pain, palpitations, and trembling in both hands, so she visited the hospital. Her temperature was 37.1℃. Pulse rate was 120/bpm and regular, and blood pressure was 118/60 mmHg. The thyroid was mildly diffusely enlarged, and tenderness was observed in the swollen part of the right thyroid lobe on palpation. Exam results: Erythrocyte sedimentation rate 65 mm/1 hour. Blood test results: White blood cells 9,800. Biochemical blood test results: TSH undetectable (range 0.2-4.0), FT4 5.86 ng/dL (range 0.8-2.2). Immunological blood test results: CRP 5.0 mg/dL, anti-TSH receptor antibody negative. Atrial fibrillation was observed on electrocardiogram. Thyroid ultrasonography showed low-echo findings consistent with the painful area. What two treatments should be performed?", "choices_en": ["Antibiotic administration", "Administration of beta-blockers", "Administration of anti-thyroid drugs", "Adrenal cortex steroid administration", "Isotope therapy using radioactive iodine"], "answer": ["b", "d"]}
{"problem_id": "114A68", "problem_text_en": "A 78-year-old woman presents with a rash and loss of appetite. She has a history of hypertension, angina, and dyslipidemia, and has been receiving treatment with a calcium channel blocker, antiplatelet agent, and statin through a medical institution near her home. Serum creatinine at the previous outpatient visit 20 days ago was 0.7 mg/dL with an eGFR of 61 mL/min/1.73m2. Five days ago, she started experiencing painful rash with blisters extending from her left back to her side, for which she had been taking over-the-counter NSAIDs, but the symptoms did not improve, and she could no longer eat, so she came for a consultation. She is conscious and alert with a height of 152 cm, weight of 41 kg, temperature of 37.2℃, pulse rate of 88 beats/min, regular. Blood pressure is 142/80 mmHg. She has erythema and blisters with severe pain extending from her left back to her side. Laboratory test show: red blood cells 3.41 million/μL, Hb 11.0 g/dL, Hct 33%, white blood cells 3700/μL, platelets 170,000/μL, BUN 23 mg/dL, creatinine 1.4 mg/dL with an eGFR of 28 mL/min/1.73m2, total cholesterol 210 mg/dL, Na 143 mEq/L, K 4.6 mEq/L, Cl 106 mEq/L, and CRP 0.7 mg/dL. The patient is diagnosed with herpes zoster, and it was decided to admit her to the hospital for treatment with acyclovir for herpes zoster and pain relief. Which of the following medications should be adjusted and decreased in dose for this patient? Select two.", "choices_en": ["NSAID (Nonsteroidal anti-inflammatory drug)", "Statins", "Antiplatelet agent", "Acyclovir", "Calcium channel blocker"], "answer": ["a", "d"]}
{"problem_id": "114A69", "problem_text_en": "A 70-year-old man presents with a chief complaint of fever. He has had a fever of around 38°C for the past 2 weeks and was prescribed antipyretics and cephalosporin antibiotics. Although his symptoms temporarily improved, he developed a fever again after completing the medication and was referred for medical evaluation. He has been taking oral medications for hypertension and dyslipidemia prescribed by a clinic near his home since the age of 58. Although mitral regurgitation was detected 3 years ago, surgery was not recommended. He is alert and conscious. His body temperature is 37.6°C, his pulse is 72 bpm and regular, his blood pressure is 124/80 mmHg, his respiratory rate is 18 per minute, and his SpO2 is 94% on room air. A III/VI holosystolic murmur is heard at the apex of the heart. The respiratory sounds are normal. Urinalysis reveals a urine specific gravity of 1.016, negative for protein, glucose, and occult blood, and no red or white blood cells in the sediment. The blood test results are as follows: red blood cell count 4.52 million, Hb 12.4 g/dL, Ht 36%, white blood cell count 12,400/μL (55% segmented neutrophils, 22% banded neutrophils, 2% eosinophils, 1% basophils, 5% monocytes, and 15% lymphocytes), and platelet count 350,000/μL. Serum biochemistry results are as follows: AST 38 U/L, ALT 36 U/L, blood urea nitrogen 20 mg/dL, creatinine 1.0 mg/dL, uric acid 7.1 mg/dL, Na 137 mEq/L, K 4.6 mEq/L, and Cl 100 mEq/L. The CRP level is 20 mg/dL. Which of the following actions would be appropriate at this time? Select two.", "choices_en": ["Blood culture", "Myocardial biopsy", "Genetic testing", "Echocardiography.", "Confirmation of virus antibody titers"], "answer": ["a", "d"]}
{"problem_id": "114A70", "problem_text_en": "A 76-year-old woman accompanied by her family visits the hospital due to increasing forgetfulness and tendency to repeatedly ask the same questions. She had mild loss of motivation since about a year ago, but for the past 3 months, she has been preparing meals with the same menu for several consecutive days. The physical examination shows no abnormalities. Hamilton Depression Rating Scale is 4 points (0-7: normal) and Mini-Mental State Examination (MMSE) score is 16 out of 30. Brain MRI shows mild hippocampal atrophy. Which of the following tests would be useful for evaluating the patient's function? Select two.", "choices_en": ["Rorschach test", "Tsumori-Inage Developmental Test", "Frontal Assessment Battery (FAB)", "State-Trait Anxiety Inventory (STAI) test.", "Wechsler Memory Scale-Revised (WMS-R) test."], "answer": ["c", "e"]}
{"problem_id": "114A71", "problem_text_en": "A 9-year-old boy came to the clinic with his mother complaining of left elbow pain. He fell off his bicycle and injured his left hand. X-rays of the left elbow joint (A, B) are shown separately. While preparing for manual reduction, pain also appeared in the left anterior forearm and spontaneous movement of the left hand fingers became impossible. Which of the following are appropriate indicators for deciding on an emergency fasciotomy? Select two.", "choices_en": ["Presence or absence of a wound/injury", "Degree of translocation", "Radial artery pulsation", "Presence or absence of subcutaneous bleeding", "Forearm compartment pressure"], "answer": ["c", "e"]}
{"problem_id": "114A72", "problem_text_en": "A 61-year-old man was brought to the emergency department with complaints of epigastric pain. He had been prescribed NSAIDs for lower back pain at a clinic near his home seven days ago. He developed sudden and rapidly worsening epigastric pain this morning, prompting him to call an ambulance. He is alert and oriented. He is 173 cm tall and weighs 67 kg. His temperature is 36.0℃. His heart rate is 88 bpm and regular. His blood pressure is 124/80 mmHg. His respiratory rate is 20 breaths/minute. His SpO2 is 98% on a 3 L/min oxygen through nasal cannula. His abdomen is flat with tenderness and mild rebound tenderness in the epigastric region. Laboratory studies reveal: RBC 4.83 million/μL, Hb 15.7 g/dL, Hct 47%, WBC 14,700 /μL, and platelets 300,000/μL. Serum biochemical studies reveal: total protein 7.3 g/dL, albumin 4.2 g/dL, total bilirubin 0.9 mg/dL, AST 20 U/L, ALT 15 U/L, LD 170 U/L (reference range 120-245 U/L), ALP 265 U/L (reference range 115-359 U/L), γ-GT 66 U/L (reference range 8-50 U/L), amylase 52 U/L (reference range 37-160 U/L), CK 85 U/L (reference range 30-140 U/L), blood urea nitrogen 17 mg/dL, creatinine 1.0 mg/dL, glucose 103 mg/dL, Na 146 mEq/L, K 3.8 mEq/L, and Cl 106 mEq/L. CRP 2.2 mg/dL. A plain abdominal CT scan is shown separately. Conservative treatment without surgical intervention was chosen initially. Which of the following is an appropriate response? Select three.\n\n(Note: the separate document of abdominal CT scan is not provided in this question.)", "choices_en": ["Administration of antibiotics", "Nasogastric tube placement", "Hyperbaric oxygen therapy", "Abdominal angiography", "Administration of proton pump inhibitors"], "answer": ["a", "b", "e"]}
{"problem_id": "114A73", "problem_text_en": "A 41-year-old woman presents with complaints of hypertension, headaches, and weakness. She has been on calcium channel blockers for hypertension, prescribed by a clinic near her home, for the past 3 years, but her blood pressure has remained high at around 150/80 mmHg. She started experiencing headaches and weakness one year ago and came to the hospital for examination. Blood tests revealed a low serum potassium level of 2.8 mEq/L. After 30 minutes of resting in a supine position, a second blood sample was taken to test for secondary hypertension, which showed plasma renin activity of 0.1 ng/mL/h (normal range, 1.2-2.5 ng/mL/h) and plasma aldosterone concentration of 231 pg/mL (normal range, 30-159 pg/mL). Abdominal CT scan showed no abnormalities. Which of the following tests should be performed for diagnosis? Select three.", "choices_en": ["A saline infusion test", "Captopril challenge test (used to diagnose renin-dependent hypertension)", "Dexamethasone suppression test", "Furosemide upright load test", "MIBG adrenal scintigraphy"], "answer": ["a", "b", "d"]}
{"problem_id": "114A74", "problem_text_en": "A 34-year-old man presents with epigastric pain after a motorcycle accident today wherein he collided with a passenger car and fell. He did not lose consciousness and had no major injuries except for scrapes to his extremities and contusion to his right knee joint. Three hours after the fall, he gradually developed increasing epigastric pain so he came with his wife to the clinic. He is alert and oriented. His body temperature is 37.2°C. His pulse is 104 beats/minute and regular, blood pressure is 96/58 mmHg, respiratory rate is 16 breaths/minute, and SpO2 is 97% on room air. His conjunctiva is slightly pale but there were no abnormalities seen in the sclera. There were no abnormalities detected in the heart and breath sounds. His abdomen is mildly distended with weakened bowel sounds. Tenderness in the epigastric area extending to the right hypochondriac region is observed. Neurological examination is unremarkable. Laboratory findings: RBC 3.27 million, Hb 10.6 g/dL, Hct 34%, WBC 11,200, platelet count 160,000. Biochemistry: total protein 6.8 g/dL, albumin 3.7 g/dL, total bilirubin 0.9 mg/dL, AST 142 U/L, ALT 78 U/L, LD 358 U/L (normal range: 120-245), γ-GT 57 U/L (normal range: 8-50), amylase 154 U/L (normal range: 37-160), blood urea nitrogen 18 mg/dL, creatinine 0.8 mg/dL, blood glucose 97 mg/dL, sodium 140 mEq/L, potassium 4.3 mEq/L, chloride 100 mEq/L, CRP 1.0 mg/dL. Which of the following tests would be appropriate to perform at this point? Select three.", "choices_en": ["Chest X-ray examination", "Upper gastrointestinal contrast study", "Abdominal ultrasound examination", "Abdominal contrast-enhanced CT", "Lower extremity MRI (Magnetic Resonance Imaging)"], "answer": ["a", "c", "d"]}
{"problem_id": "114A75", "problem_text_en": "An 80-year-old man complains of shouting loudly at night and comes to the hospital. He has occasionally had vivid dreams and shouts loudly at night for about 10 years. His gait has become slow and he often stumbles due to short strides while walking for a year. Two months ago, he started seeing human figures in the curtains. Furthermore, he has been increasingly worrying his wife by shouting loudly at night, moving his limbs, and dropping objects around the bed. He has no significant medical history and takes no regular medication. His head MRI showed only mild cerebral atrophy. Which of the following tests would be useful for diagnosis? Select three.", "choices_en": ["Cerebrospinal fluid examination", "Nerve conduction study", "Polysomnography", "MIBG myocardial scintigraphy", "Dopamine transporter SPECT (single photon emission computed tomography)"], "answer": ["c", "d", "e"]}
