{"problem_id": "114C1", "problem_text_en": "Which of the following statements is incorrect regarding the plan for regional medical care?", "choices_en": ["Estimating the demand for medical care in 2025.", "Develop as part of a healthcare plan.", "The planning area is at the level of prefectures", "Estimating the necessary number of hospital beds by function.", "Insurance providers also participate in regional medical planning conferences."], "answer": ["c"]}
{"problem_id": "114C2", "problem_text_en": "Which of the following is correct regarding workers' compensation insurance?", "choices_en": ["Commuting accidents are not included.", "The insurer is a municipality.", "Recognition of work-related injuries is conducted by the Minister of Health, Labour and Welfare.", "Insurance premiums are borne by both workers and employers.", "Disaster-stricken workers are exempt from paying insurance treatment fees."], "answer": ["e"]}
{"problem_id": "114C3", "problem_text_en": "Which of the following is correct for infant cardiopulmonary resuscitation (CPR)?", "choices_en": ["The depth of chest compressions is about 1/2 the thickness of the chest.", "Perform chest compressions at a rate of 60-80 times per minute.", "If you recognize agonal breathing, start resuscitation.", "When conducted by two rescuers, the ratio of chest compressions to artificial respiration is 30:2.", "Check the pulse rate at the femoral artery."], "answer": ["c"]}
{"problem_id": "114C4", "problem_text_en": "A hospitalized patient, who has been informed that they have a recurrent breast cancer and have less than 1 year to live, expresses a desire to die. What is the most appropriate response from the physician?", "choices_en": ["Encouraging someone to do their best. (Lit. \"Cheer up and encourage.\")", "Discharge promptly.", "Recommend admission to a hospice.", "Avoiding mentioning death.", "Discussing current feelings."], "answer": ["e"]}
{"problem_id": "114C5", "problem_text_en": "Which document serves as the fundamental resource for promoting primary prevention in our country?", "choices_en": ["Patient survey", "Population census", "National Health and Nutrition Survey", "Survey of physicians, dentists, and pharmacists", "National Survey on Homebound Children and Individuals with Disabilities"], "answer": ["c"]}
{"problem_id": "114C6", "problem_text_en": "The following graph shows the trends of total fertility rates for Japan, the United States, Italy, South Korea, and France from 1990 to 2018. Which line represents Japan?", "choices_en": ["① (This is not a translation but a representation of a numerical choice in Japanese)", "This is not a word or phrase, but rather just a number indicating an option in a multiple-choice question. As such, it cannot be translated on its own.", "Unfortunately, without context or further information, it is not possible to translate ③ accurately. It could refer to a multiple choice answer choice, a numbered list, a reference number, or something else entirely.", "I'm sorry, but it is not possible to accurately translate ④ without further context. It could represent a number, a symbol, or a word in Japanese.", "Sorry, ⑤ is a number or symbol and cannot be translated without context. Please provide more information or the complete question stem."], "answer": ["d"]}
{"problem_id": "114C7", "problem_text_en": "Which of the following is not a national qualification?", "choices_en": ["Certified Care Worker", "Speech-Language-Hearing Therapist (Speech Therapist)", "Physical therapist", "Clinical engineering technician", "Medical social worker"], "answer": ["e"]}
{"problem_id": "114C8", "problem_text_en": "Which of the following combinations of symptoms and diseases is correct and suggests a skin lesion?", "choices_en": ["Sweet's disease --------- Chronic pancreatitis", "Granulomatous thyroiditis ------ Hyperthyroidism", "Gangrenous pyoderma ---------- Fabry disease", "Scleroderma - Diabetes", "Anterior tibial mucous cyst/ ganglion--------ulcerative colitis"], "answer": ["d"]}
{"problem_id": "114C9", "problem_text_en": "Which of the following facilities is based on the concept of universal design in public facilities and buildings?", "choices_en": ["Breastfeeding room in the civic center/hall", "Pedestrian overpass at a national highway intersection", "Automatic sliding door at the entrance of the city hall", "Barrier-free restroom for ostomates in an art museum", "Braille blocks on train station platforms"], "answer": ["c"]}
{"problem_id": "114C10", "problem_text_en": "Which of the following is a correct characteristic of hematopoietic stem cells?", "choices_en": ["Hemostatic effect", "Phagocytosis", "Oxygen-carrying capacity", "Self-replication ability", "Thrombolytic activity"], "answer": ["d"]}
{"problem_id": "114C11", "problem_text_en": "The figure below shows the GDP per capita (horizontal axis) and average lifespan (vertical axis) for workers in Japan, Israel, South Korea, China, and Vietnam in 2018. Which combination marked by ● in the figure is correct? \n\n　　① \n　　② \n　　③ \n　　④ \n　　⑤ \n\na \nVietnam \nIsrael \nChina \nSouth Korea \nJapan \n\nb \nIsrael \nVietnam \nSouth Korea \nJapan \nChina \n\nc \nChina \nIsrael \nVietnam \nSouth Korea \nJapan \n\nd \nVietnam \nJapan \nChina \nSouth Korea \nIsrael \n\ne \nIsrael \nVietnam \nJapan \nSouth Korea \nChina", "choices_en": ["I'm sorry, but there is no text or context to translate. Please provide more information.", "I'm sorry, there is no choice provided to be translated. Please provide the full question along with the choices.", "I am sorry, there is no choice written in the question. Please provide the full multiple choice question or the choice that needs to be translated.", "I'm sorry, but there seems to be no text provided for me to translate. Please provide the full text you need translated.", "Sorry, it is difficult to translate \"e\" without additional context. Could you please provide more information or the entire question?"], "answer": ["a"]}
{"problem_id": "114C12", "problem_text_en": "Which of the following is correct about food poisoning?", "choices_en": ["When diagnosing a food poisoning patient, report it to the head of the health department.", "It is not true that Salmonella infection never causes fever.", "Pre-heating food is effective for preventing Staphylococcus aureus food poisoning.", "The incubation period of food poisoning caused by Campylobacter is 2-3 weeks.", "In Japan, the number of patients with food poisoning caused by Vibrio parahaemolyticus is the highest."], "answer": ["a"]}
{"problem_id": "114C13", "problem_text_en": "Which of the following is an appropriate instruction for adult patients with insomnia who complain of difficulty in falling asleep?", "choices_en": ["\"Wake up at a certain time and get exposed to sunlight.\"", "\"Get to bed as early as possible.\"", "\"Let's make a habit of drinking alcohol before going to bed.\"", "\"Make sure to get more than 8 hours of sleep per night\"", "\"When you cannot fall asleep after going to bed, wait quietly for drowsiness to come.\""], "answer": ["a"]}
{"problem_id": "114C14", "problem_text_en": "Show a pedigree of a family with an autosomal dominant inherited disorder (penetrance 100%). What is the mode of inheritance of this disorder?", "choices_en": ["Autosomal dominant inheritance", "Autosomal recessive inheritance", "X-linked dominant inheritance.", "X-linked recessive inheritance", "Y-linked inheritance"], "answer": ["d"]}
{"problem_id": "114C15", "problem_text_en": "Which combination of visual field abnormality and disease is correct?", "choices_en": ["Tubular visual field --------- optic neuritis", "Homonymous hemianopia --------- Macular disease", "Blind spot at the center of vision (blind spot of Mariotte) --------- Glaucoma", "Bjerrum scotoma - Visual field defect", "Spiral visual field -------- Psychogenic visual impairment"], "answer": ["e"]}
{"problem_id": "114C16", "problem_text_en": "The following are the quality and content of a certain test:\n1) How old are you?\n2) What year, month and day is it today?\n3) Where are we right now?\n4) Please say these three words after me. I will ask you to repeat them later, so please remember them well.\n5) Subtract 7 from 100 and then continue to subtract 7 from the difference.\n6) Please say these numbers in reverse order as I say them.\n7) Please repeat the three words that you just memorized.\n8) I will show you five items, then I will hide them. Please tell me what they were.\n9) Please name as many vegetables as you can that you know.\nWhat is this test for psychological/mental function called?", "choices_en": ["Tanaka-Binet intelligence test", "Rivermead Behavioral Memory Test", "Wechsler Adult Intelligence Scale (WAIS-III)", "Revised Hasegawa Dementia Scale (HDS-R)", "Brief Psychiatric Rating Scale (BPRS)"], "answer": ["d"]}
{"problem_id": "114C17", "problem_text_en": "What is the concept that refers to a decline in mobility due to age-related muscle weakness, disorders of the musculoskeletal system such as joint and spinal diseases, and osteoporosis, leading to a state of requiring nursing care or being at high risk of requiring nursing care?", "choices_en": ["Crush syndrome", "Dumping syndrome", "Metabolic syndrome", "Locomotive syndrome", "Compartment syndrome"], "answer": ["d"]}
{"problem_id": "114C18", "problem_text_en": "Which of the following exposes the subject to the highest amount of radiation exposure per single examination?", "choices_en": ["FDG-PET (Fluorodeoxyglucose-positron emission tomography)", "Head plain CT (Computed Tomography) scan", "Upper gastrointestinal contrast study", "Dynamic abdominal CT scan", "Chest X-ray image"], "answer": ["d"]}
{"problem_id": "114C19", "problem_text_en": "Which disease is expected to be prevented by primary prevention through health guidance in elementary schools?", "choices_en": ["Obesity", "Short stature / Dwarfism", "Type 1 diabetes", "Hyperthyroidism", "Neuroanorexia"], "answer": ["a"]}
{"problem_id": "114C20", "problem_text_en": "The following graph shows the age-specific mortality rates (per 100,000 population) for a certain cause of death in Japanese men from 1947 to 2016. What is the cause of death?", "choices_en": ["Malignant neoplasm (cancer)", "Cerebrovascular disease", "Pneumonia", "Unforeseeable accident", "Suicide"], "answer": ["e"]}
{"problem_id": "114C21", "problem_text_en": "Which of the following conditions causes prolonged prothrombin time?", "choices_en": ["Hemophilia", "Thrombocytopenia", "Vitamin K deficiency", "Von Willebrand disease", "IgA vasculitis (Schönlein-Henoch purpura)"], "answer": ["c"]}
{"problem_id": "114C22", "problem_text_en": "Which of the following developmental delays is present at the age of 2 years and 0 months?", "choices_en": ["Cannot ride a tricycle.", "Unable to stand on one foot.", "Inability to say one's own name.", "Unable to cut paper with scissors.", "Not pointing at things that interest you."], "answer": ["e"]}
{"problem_id": "114C23", "problem_text_en": "In patients with maintained circulation but no spontaneous respiration undergoing emergency head CT, which of the following is appropriate for respiratory management?", "choices_en": ["Oxygen mask", "Nasopharyngeal airway insertion", "Artificial respiration via tracheal intubation", "Non-invasive positive pressure ventilation (NPPV)", "Artificial respiration by emergency tracheotomy"], "answer": ["c"]}
{"problem_id": "114C24", "problem_text_en": "Which of the following is closest to the energy content (in kcal) contained in 500 mL of the maintenance fluid formulation (composition: Na+ 35 mEq/L, K+ 20 mEq/L, Cl- 35 mEq/L, glucose 5.0%)?", "choices_en": ["25", "50", "One hundred", "Two hundred", "There is no enough context to accurately translate \"400.\" Please provide more information or context."], "answer": ["c"]}
{"problem_id": "114C25", "problem_text_en": "Shown separately is an H&E-stained sample of normal gastric tissue. Which layer represents the submucosa?", "choices_en": ["① (This is not a word or phrase, but rather a symbol denoting the number one in Japanese. It does not require translation.)", "Choice 2", "Unfortunately, it is impossible to accurately translate \"③\" without additional context. It is likely a numbered choice in a list of options.", "Sorry, I cannot translate the choice without the context of the question, as ④ or any other number by itself has no meaning.", "Unfortunately, I cannot translate this choice as it is solely a number and does not contain any discernible information or context to determine its meaning."], "answer": ["c"]}
{"problem_id": "114C26", "problem_text_en": "Which of the following vaccinations should have an interval of at least 27 days before administering a different type of vaccine? Select two.", "choices_en": ["BCG (Bacillus Calmette-Guérin)", "Varicella vaccine (chickenpox vaccine)", "Hepatitis B vaccine", "Pneumococcal vaccine", "Human Papillomavirus (HPV) vaccine"], "answer": ["a", "b"]}
{"problem_id": "114C27", "problem_text_en": "Which diseases are included in Class B infectious diseases, mainly for individual prevention through routine vaccinations? Select two.", "choices_en": ["Rubella", "Measles", "Pertussis (whooping cough)", "Influenza", "Pneumococcal infection in the elderly"], "answer": ["d", "e"]}
{"problem_id": "114C28", "problem_text_en": "Which of the following are correct causes of elevated serum LDL cholesterol levels? Select two.", "choices_en": ["Liver cirrhosis", "Type 1 diabetes", "Malabsorption syndrome", "Hypothyroidism", "Nephrotic syndrome"], "answer": ["d", "e"]}
{"problem_id": "114C29", "problem_text_en": "Which of the following combinations of findings are correct for a 37-week fetus and its appendages according to a normal examination? Select two.", "choices_en": ["Fetal heart rate --------- 90/bpm", "Estimated fetal weight --------- 1,900g", "Amniotic fluid index (AFI) --------- 12cm", "Non-Stress Test (NST) --------- reactive", "Biophysical profile score (BPS) --------- 4 points"], "answer": ["c", "d"]}
{"problem_id": "114C30", "problem_text_en": "The cardiotocogram (CTG) of a pregnant woman at 37 weeks and 0 days of gestation is shown separately. Which of the following findings are present? Select two.", "choices_en": ["Bradycardia", "Disappearance of baseline fluctuations", "Early onset transient bradycardia", "Late onset transient bradycardia.", "Transient bradycardia"], "answer": ["b", "d"]}
{"problem_id": "114C31", "problem_text_en": "Which of the following is correct regarding legal home care? Select two.\n\n(Note for clarification: \"Legal home care\" is a term that is specific to the laws and regulations governing healthcare in Japan, and refers to medical care provided at a patient's home by healthcare professionals such as nurses and physical therapists, as opposed to care provided in a hospital or other medical facility.)\n\n(Note for translation: I will provide two possible translations for each answer option to reflect the possible nuances of the Japanese language.)\n\n- a. 介護保険法に基づく在宅ケアは、本人や家族の同意がなくても強制的に行うことができる。\n    a. Legal home care based on long-term care insurance can be provided forcibly even if the patient or their family do not consent.\n    b. Legal home care based on long-term care insurance can be provided without the patient or their family's consent.\n- b. 医療保険適用範囲内での在宅ケアは、診療報酬が受けられる。\n    a. Home care within the scope of medical insurance is eligible for medical fees.\n    b. Home care within the scope of medical insurance can receive reimbursement of medical costs.", "choices_en": ["The care plan is created by certified care workers.", "A mechanical ventilator can be used at home.", "A physician's order is necessary for home care.", "Home visiting medical care is a planned and regular home medical care.", "Medical insurance is applicable to outpatient rehabilitation."], "answer": ["b", "d"]}
{"problem_id": "114C32", "problem_text_en": "Which of the following are correct about HIV testing? Select three.\n\n(Note: It is difficult to provide a complete and accurate translation without more specific context. The following translation assumes general knowledge about HIV testing.)\n\n- HIV testing typically involves detecting antibodies against the virus, rather than the virus itself.\n- Most commonly used HIV tests are highly reliable but can produce false-positive or false-negative results in some cases.\n- A person who tests positive for HIV should receive further testing and counseling to confirm the diagnosis and to receive appropriate care and treatment.", "choices_en": ["If a doctor suspects HIV infection based on symptoms or findings, it becomes covered by insurance.", "The result of the screening test will be known two weeks after implementation.", "Screening tests can be taken anonymously at public health centers.", "Screening tests are available for free at public health centers.", "Confirmation testing in case of positive screening results can only be performed at an AIDS treatment center."], "answer": ["a", "c", "d"]}
{"problem_id": "114C33", "problem_text_en": "What are the roles of public health centers? Select three.", "choices_en": ["3-year-old health check-up", "On-site inspection based on the Medical Care Act", "Reviewing census survey forms", "Health crisis management in the community", "Examination of Population Census Survey Forms"], "answer": ["b", "d", "e"]}
{"problem_id": "114C34", "problem_text_en": "Which of the following could be the cause of feminization of breast? Select three.", "choices_en": ["Liver cirrhosis", "Diabetes insipidus", "Testicular tumor", "ACTH deficiency", "Dopamine receptor antagonist"], "answer": ["a", "c", "e"]}
{"problem_id": "114C35", "problem_text_en": "A 3-year-old girl was brought to the hospital by her grandfather, who was worried that she was not moving her right elbow. The girl stopped moving her right elbow after her 8-year-old brother pulled her arm while playing at home. Tenderness is found around the radial head of the right elbow joint, but there is no swelling, warmth, or redness. There are no abnormalities in the shoulder or wrist joints. A right elbow joint X-ray shows no fractures. What is the appropriate treatment?", "choices_en": ["Nonsteroidal anti-inflammatory drug", "Manual therapy (Japanese chiropractic technique)", "Skeletal traction (Skeletal fixation with pins)", "Elbow joint capsule incision", "Elbow joint range of motion training"], "answer": ["b"]}
{"problem_id": "114C36", "problem_text_en": "A 58-year-old man was found dead in the driver's seat of his car, which was parked in a shopping center parking lot with the engine running, by a suspicious shopper. By the time the ambulance arrived, rigor mortis had already set in, so the body was not transported to the hospital, but was sent for an autopsy to determine the cause of death. The man was 170 cm tall and weighed 90 kg. Postmortem lividity was strongly evident on the back and there was strong rigor mortis in all joints of the body. No external injuries were found. The brain weighed 1,750 g and was swollen. There were no fractures in the chest or spine, and there was almost no fluid accumulation in the pleural cavities. There was no rupture in the pericardial sac. The heart weighed 610 g and there was no intimal thickening or thrombus in the coronary arteries, and no abnormalities were seen in the myocardium. The aorta showed dissection between the intima and adventitia from the Valsalva sinus to a point 15 cm below the left subclavian artery origin, and there were cracks in the intima and media at both ends. The lungs and liver were congested but there were no abnormalities on the surface of the organs. Chest CT (A) taken before autopsy and a photo (B) taken upon opening the pericardial sac during the autopsy are provided separately. What is the most likely condition?", "choices_en": ["Liver rupture", "Pulmonary contusion", "Spinal cord injury", "Myocardial infarction", "Cardiac tamponade"], "answer": ["e"]}
{"problem_id": "114C37", "problem_text_en": "A 1-year-old girl presented with cough as the chief complaint. She had been coughing and had a runny nose for several days, and her parents took her to the emergency department because her nighttime coughing had worsened. She was said to have a seal-like cough. Her height was 80.0 cm, weight 10.0 kg. Her body temperature was 38.2℃. Heart rate was 120/min, regular. Blood pressure was 90/58 mmHg. Respiratory rate was 28/min. SpO2 was 96% (room air). Indrawing was observed at the suprasternal notch and supraclavicular fossa. Mild inspiratory wheezing was heard bilaterally in the chest. Administration of inhaled adrenaline did not improve her symptoms. What is the next appropriate action?", "choices_en": ["Tracheal intubation", "Inhalation of β2 stimulant medication administration.", "Respiratory rehabilitation", "Administration of macrolide antibiotics.", "Systemic administration of adrenal cortex steroids"], "answer": ["e"]}
{"problem_id": "114C38", "problem_text_en": "A 68-year-old man presents with complaints of dyspnea on exertion. He reports experiencing dyspnea when ascending stairs for the past 2 years. He has also lost 4 kg in the last 6 months due to loss of appetite. He quit smoking 3 years ago after smoking 30 cigarettes per day for 45 years. He is 165cm tall and weighs 47kg. Chest X-ray shows marked hypertransparency in both lungs and chest CT shows areas of low attenuation in both lungs. Pulmonary function tests reveal obstructive impairment and he is diagnosed with COPD. Which of the following is not an appropriate strategy for nutritional therapy?", "choices_en": ["Avoid excessive intake of salt.", "Reduce the amount of food intake per meal.", "Make the diet carbohydrate-based.", "Intake sufficient energy.", "Be mindful of consuming branched-chain amino acids."], "answer": ["c"]}
{"problem_id": "114C39", "problem_text_en": "An 82-year-old man presents with chief complaint of difficulty walking. He has been receiving hemodialysis for IgA nephropathy-induced chronic kidney disease, 4 hours per session, three times a week, for 14 years. His walking speed decreased two years ago, and recently he has had difficulty crossing the street. Climbing stairs without holding the handrail with both hands is also difficult, and he has become reluctant to go out except for going to the hospital. He has lost 5 kg in weight over the past year and is concerned that he may become unable to walk. He is 167 cm tall and weighs 47 kg (46 kg immediately after dialysis). His pulse rate is 72 beats/min and regular, and blood pressure is 138/72 mmHg. Heart and breath sounds are normal, and no edema is observed. Both legs have a manual muscle strength of 4. No abnormalities are found on neurological examination. Both dorsalis pedis arteries can be palpated equally. Hematology: red blood cells 3.38 million, Hb 11.0 g/dL, Ht 33%, white blood cells 5,200, and platelets 140,000. Blood biochemistry: total protein 6.8 g/dL, albumin 3.6 g/dL, AST 22 IU/L, ALT 18 IU/L, LDH 178 IU/L (reference range: 120-245), CK 38 IU/L (reference range: 30-140), blood urea nitrogen 72 mg/dL, creatinine 7.8 mg/dL, uric acid 7.4 mg/dL, Na 138 mEq/L, K 4.2 mEq/L, Cl 101 mEq/L, Ca 9.2 mg/dL, and P 5.6 mg/dL. CRP 0.1 mg/dL. What is the likely cause of the difficulty walking?", "choices_en": ["Renal anemia", "Hyperuricemia", "Hyperphosphatemia", "Sarcopenia", "Obstructive arteriosclerosis"], "answer": ["d"]}
{"problem_id": "114C40", "problem_text_en": "A 9-year-old boy's shuttle run (20-meter) laps, which is an indicator of aerobic fitness level, have been decreasing since he was 7 years old in the annual school physical examinations, and this has been reported to the school doctor. At 6 years: 20 laps [19.2], at 7 years: 26 laps [28.6], at 8 years: 24 laps [38.5], and at 9 years old: 19 laps [48.0] (national average number in 【　】). His height is growing well and there is no weight loss. When asked, he confirmed that he has been running at full capacity each year. What is the appropriate response as a school doctor?", "choices_en": ["Provide exercise instruction.", "Provide nutritional guidance.", "Allow observing physical activities (sports and exercises).", "Encourage visiting a medical institution.", "Wait for the results of the physical fitness test at age 10 to determine the response."], "answer": ["d"]}
{"problem_id": "114C41", "problem_text_en": "A 59-year-old woman was referred to the hospital after being found to be positive for fecal occult blood during a health checkup. She was diagnosed with ascending colon cancer during a lower gastrointestinal endoscopy. There was no clear evidence of metastasis on imaging tests such as CT, and right hemicolectomy was performed. She has a height of 156 cm, body weight of 48 kg, body temperature of 36.2°C, pulse rate of 72 beats per minute, blood pressure of 108/60 mmHg, and respiratory rate of 12 breaths per minute. There are no abnormalities in the conjunctiva or eyeball. There are no abnormalities in heart sounds or respiratory sounds. The abdomen is flat, soft, and liver or spleen cannot be palpated. Laboratory data: red blood cells 3.98 million/μL, Hb 12.5 g/dL, Ht 39%, white blood cells 4,900/μL, platelets 140,000/μL; serum total protein 6.6 g/dL, albumin 3.8 g/dL, total bilirubin 0.8 mg/dL, AST 16 U/L, ALT 18 U/L, LD 184 U/L (reference range: 120-245), ALP 202 U/L (reference range: 115-359), creatinine 1.0 mg/dL, Na 141 mEq/L, K 4.0 mEq/L, Cl 101 mEq/L. Which of the following is true regarding perioperative management?", "choices_en": ["Fasting for 48 hours before surgery", "Drinking water up to 3 hours before surgery", "Intraoperative massive fluid transfusion.", "Bed rest for 3 days after surgery", "Fasting for one week after surgery"], "answer": ["b"]}
{"problem_id": "114C42", "problem_text_en": "A 48-year-old man came to the clinic after being informed of leukocytosis during a health checkup. He had been aware of a sensation of abdominal fullness on the left side for a month. His temperature was 36.3℃, pulse rate was 72 /min, regular, and blood pressure was 126/74 mmHg. There was no palpable superficial lymph node. The spleen was palpated 5 cm below the left costal arch. Blood findings were: red blood cells, 4.5 million, Hb 13.8 g/dL, Ht 45%, WBC 46,000 (/μL) (myeloblasts 1%, promyelocytes 3%, myelocytes 5%, metamyelocytes 10%, band neutrophils 15%, segmented neutrophils 54%, eosinophils 2%, basophils 5%, lymphocytes 5%), and platelets, 370,000/μL. Blood biochemistry showed: total protein 6.9 g/dL, albumin 4.8 g/dL, total bilirubin 0.7 mg/dL, direct bilirubin 0.1 mg/dL, AST 20 U/L, ALT 27 U/L, LDH 350 U/L (reference range 120-245), BUN 18 mg/dL, creatinine 0.8 mg/dL, uric acid 6.8 mg/dL. A separate abdominal CT is shown. What is the most important examination to determine a treatment plan?", "choices_en": ["Bone marrow chromosomes", "Bone marrow tissue H-E staining", "Peripheral blood cell surface antigen", "Bone marrow smear staining with May-Giemsa", "Peripheral blood neutrophil alkaline phosphatase score"], "answer": ["a"]}
{"problem_id": "114C43", "problem_text_en": "A 76-year-old man presents with chief complaints of abdominal distension and pain. He was diagnosed with acute monoblastic leukemia (FAB classification M5) three months ago and received combination chemotherapy with several different drugs. However, he has not achieved remission to date. He has been taking NSAIDs since last week due to the appearance of lumbar back pain, but the effect has been insufficient. Since last night, abdominal pain has also appeared and has gradually worsened, leading to difficulty walking. He is conscious but has a distressed facial expression. He is 171 cm tall, weighs 54 kg, and has a body temperature of 37.1 °C. His pulse is 88/min and regular, and his blood pressure is 118/78 mmHg. His conjunctiva is anemic. Systolic ejection murmurs are heard at the right sternal edge. There is no subcutaneous bleeding in the limbs. Laboratory findings include: RBC 2.82 million/μL, Hb 8.0 g/dL, Ht 26%, WBC 52,400/μL (blasts 74%, promyelocytes 2%, segmented neutrophils 12%, eosinophils 1%, basophils 1%, lymphocytes 10%), and platelets 100,000/μL. Biochemical findings include: total protein 5.1 g/dL, albumin 2.8 g/dL, total bilirubin 0.9 mg/dL, direct bilirubin 0.2 mg/dL, AST 34 U/L, ALT 37 U/L, LD 1,350 U/L (reference range 120-245 U/L), BUN 19 mg/dL, creatinine 1.3 mg/dL, and uric acid 9.8 mg/dL. Abdominal ultrasonography and CT show significant swelling of mesenteric and retroperitoneal lymph nodes, which appear to be compressing and infiltrating the gastrointestinal tract. What treatment should be considered first at this time?", "choices_en": ["Administration of albumin formulation", "Opioid administration", "Platelet transfusion", "Whole-body radiation exposure", "Anticancer treatment with drugs"], "answer": ["b"]}
{"problem_id": "114C44", "problem_text_en": "A 2-year-old boy who was previously healthy was brought to the hospital by his mother with a complaint of fever. At the time of examination, the child does not cry even when the mother is not around. His body temperature is 38.2℃.Heart rate is 110 bpm, regular. Blood pressure is 98/62 mmHg. Respiratory rate is 30/min. His SpO2 is 98% (room air) and capillary refill time is less than 2 seconds. He opens his eyes spontaneously and blinks in response to bright light but does not follow gaze. What is the most likely condition in this patient?", "choices_en": ["Palpitations", "Low blood pressure", "Impaired consciousness/Altered level of consciousness", "Respiratory failure", "Peripheral circulation disorder"], "answer": ["c"]}
{"problem_id": "114C45", "problem_text_en": "An 84-year-old woman is brought to the hospital by ambulance for abdominal pain. She has not had a bowel movement for two days and has been experiencing abdominal pain and bloating. She called for an ambulance this morning because her symptoms had worsened. She is alert and oriented. Her temperature is 37.5℃, heart rate is 98 bpm and regular, blood pressure is 148/94 mmHg, respiratory rate is 22 breaths per minute, and SpO2 is 97% on 3 L/minute oxygen via nasal cannula. Her abdomen is distended with slightly increased bowel sounds and tympanic percussion note. She has tenderness in the left abdomen, but no rebound tenderness. An abdominal X-ray is provided separately. What should be the first response?", "choices_en": ["Antihypertensive medication administration", "Ileus tube placement", "Endoscopic reduction surgery", "Glycerin enema", "Administration of anticholinergic drugs."], "answer": ["c"]}
{"problem_id": "114C46", "problem_text_en": "A 32-year-old woman, who has had two pregnancies and one delivery, is at 12 weeks of gestation and has come to a genetic counseling clinic with her spouse to discuss prenatal diagnosis. There are no abnormal findings in the previous pregnancy. Their previous child, born when the woman was 28 years old, had Down syndrome. The couple wishes to know about non-invasive prenatal testing (NIPT). Which of the following is an appropriate explanation?", "choices_en": ["\"We will perform the test using amniotic fluid\".", "\"The probability of miscarriage due to testing is 0.3%.\"", "\"80% of congenital diseases can be diagnosed through tests\"", "\"Even if the test results are positive, it does not necessarily confirm the diagnosis.\"", "\"It is not possible to conduct the test until after 16 weeks of pregnancy.\""], "answer": ["d"]}
{"problem_id": "114C47", "problem_text_en": "A 42-year-old man came for a medical check-up after being pointed out with abnormality during his health examination. He has no significant medical or family history. He has been smoking 20 cigarettes per day for 13 years and drinks 500mL of beer per day.", "choices_en": ["Administration of antihypertensive medication", "Nicotine replacement therapy", "75g oral glucose tolerance test", "Detailed inquiry about lifestyle habits", "Recommendation of jogging three or more times a week"], "answer": ["d"]}
{"problem_id": "114C48", "problem_text_en": "A 67-year-old woman was notified of an abnormal shadow on her chest X-ray during a health checkup and visited the hospital for further examination. She has a smoking history of 25 cigarettes per day for 47 years. Her body temperature is 36.4°C, pulse rate is 64 beats per minute and regular, blood pressure is 124/76 mmHg, respiratory rate is 16 breaths per minute, and SpO2 is 97% (room air). As abnormalities were found in her chest CT, a bronchoscopic brushing cytology was performed. Chest X-ray (A), chest CT (B), and the Papanicolaou-stained specimen of the brushing cytology (C) are presented separately. What is the diagnosis?", "choices_en": ["Adenocarcinoma", "Small cell carcinoma", "Large cell carcinoma", "Squamous cell carcinoma", "Carcinoid"], "answer": ["d"]}
{"problem_id": "114C49", "problem_text_en": "A 29-year-old woman (G1P1) is in the hospital one day after delivery. She underwent a cesarean section delivery at 38 weeks of gestation due to pelvic presentation. Intraoperative bleeding was 800 mL, and her intraoperative and postoperative course was uneventful. When she began her first walk after surgery, she suddenly complained of dyspnea and chest pain. She was alert and conscious. Her height is 154 cm, weight is 77 kg. Her pulse rate is 104 bpm and regular. Blood pressure is 128/76 mmHg, respiratory rate is 26/min, and peripheral oxygen saturation (SpO2) is 92% on room air. No abnormal breath sounds are heard. What is the most likely condition?", "choices_en": ["Amniotic fluid embolism", "Acute myocardial infarction", "Peripartum cardiomyopathy", "Pulmonary thromboembolism", "Acute aortic dissection"], "answer": ["d"]}
{"problem_id": "114C50", "problem_text_en": "A 78-year-old woman with diabetes visits a local hospital outpatient clinic once a month. She feels insecure about preparing meals and cleaning her room. She lives alone, and her family lives far away, making it difficult for them to provide daily assistance. Which of the following facilities is appropriate for her to consult when she needs support for daily living at home?", "choices_en": ["Clinic", "Public health center", "Special nursing homes for elderly people", "Community inclusive support center.", "Visiting nursing station"], "answer": ["d"]}
{"problem_id": "114C51", "problem_text_en": "A 35-year-old primigravida (gravida 1, para 0) presented to the hospital for a routine antenatal check-up at 33 weeks and 6 days of pregnancy. No abnormalities had been detected in the pregnancy so far. Her pulse was 96 beats/min and regular, blood pressure was 126/68 mmHg, and urine analysis showed no protein or glucose. Her fundal height measured 29 cm and abdominal circumference was 94 cm. On pelvic examination, the cervix was closed, and fetal weight was estimated to be 2,120 g with an amniotic fluid index of 18 cm. The placenta was located at the fundus of the uterus. She works in an office and plans to apply for maternity leave from tomorrow. Which law specifies maternity leave for this pregnant woman?", "choices_en": ["Health Promotion Law", "Maternal and Child Health Act", "Maternal protection law", "Labor Standards Act.", "Act on Promotion of Support Measures for Next-Generation Childrearing"], "answer": ["d"]}
{"problem_id": "114C52", "problem_text_en": "A 28-year-old nulliparous woman (G1P0) felt a rupture of her membranes at midnight on her due date, and regular uterine contractions appeared, so she came to the hospital at 1 am. She had no abnormal findings during prenatal check-ups. At the time of admission, the fetus was in the cephalic presentation, the fetal heart rate was normal, and the vaginal speculum examination showed that the amniotic fluid was leaking. On internal examination, the cervix was dilated to 3 cm. At 5 am, the contractions were occurring every 5 minutes, the cervix was dilated to 6 cm on internal examination, the fetal head was at station SP±0 cm, the occiput was in the right occipito-transverse position, and the sagittal suture was aligned with the transverse diameter of the maternal pelvis. At 9 am, the contractions were occurring every 3 minutes, the cervix was dilated to 9 cm on internal examination, and the fetal head was at station SP+2 cm. The findings of the fetal head observed on the internal examination (①-⑤) are separately shown. Which of the following indicates a normal rotation?", "choices_en": ["① (This is not an actual translation, it represents a numerical choice in a multiple-choice question, often used in Japan's exams)", "This is not a choice or a question, but rather a numeric label for a choice. It cannot be accurately translated without the context of the full question and other answer choices.", "Sorry, ③ is a number and cannot be translated without context. Please provide more information.", "This cannot be translated into English as ④ is a numerical symbol used to represent a choice or an answer in a multiple-choice question.", "This question cannot be translated without further context. The notation \"⑤\" is not meaningful on its own. Please provide more information or context so I can assist you better."], "answer": ["d"]}
{"problem_id": "114C53", "problem_text_en": "A 75-year-old man with a history of cerebral infarction is currently undergoing outpatient treatment. He has mild paralysis on the right side of his body and eats with his left hand despite being right-handed. He can walk outdoors with a cane and has no problems with short-term memory, being capable of making daily decisions on his own. His attending physician considers him to be in need of Care Level 1. The patient has applied for long-term care insurance, but which of the following is not required to be included in the physician's statement of opinion?", "choices_en": ["① - This is not a word or phrase, but rather a number or symbol. As such, it does not have a direct translation in English. It is often represented as \"1\" in English.", "Unfortunately, as it appears out of context and has no linguistic content, it cannot be translated. It seems to be a numerical identifier within a larger set of question choices.", "Unfortunately, I cannot translate ③ without additional context. Please provide more information so that I can assist you better.", "It is not possible to translate and provide a meaning for \"④\" as it is a numeral without any additional context. It could refer to a choice in a multiple-choice exam question, but without knowing what the specific choice is, it cannot be translated.", "I'm sorry, I cannot provide an accurate translation as \"⑤\" is a number or symbol and not a word or phrase."], "answer": ["e"]}
{"problem_id": "114C54", "problem_text_en": "A 58-year-old man complains of decreased vision in both eyes for the past week and presents for medical evaluation. He reports no previous medical history. He has a smoking history of 20 cigarettes/day for 26 years and a blood pressure of 170/90 mmHg. Blood test results reveal a blood urea nitrogen level of 23 mg/dL, creatinine level of 1.2 mg/dL, fasting blood glucose level of 160 mg/dL, HbA1c level of 8.2% (reference range: 4.6-6.2%), triglyceride level of 190 mg/dL, HDL cholesterol level of 25 mg/dL, and LDL cholesterol level of 148 mg/dL. His visual acuity is 0.1 (0.4×−3.0D) in the right eye and 0.2 (0.7×−2.5D) in the left eye. The intraocular pressure is 15 mmHg in the right eye and 13 mmHg in the left eye. Fundus photographs, fluorescein angiography images, optical coherence tomography (OCT) images, and optical coherence tomography angiography (OCTA) images (A, B) for both eyes are separately shown. Fundus photographs show dot and blot hemorrhages, hard exudates, and cotton-wool spots in both eyes. OCTA images show a decrease in the number of capillaries in both eyes. What is the diagnosis?", "choices_en": ["Age-related macular degeneration", "Diabetic retinopathy", "Retinal artery aneurysm", "Branch retinal vein occlusion", "Central retinal vein occlusion"], "answer": ["b"]}
{"problem_id": "114C55", "problem_text_en": "A 78-year-old man presents with urinary dysfunction as the main complaint. He has been aware of a weakening of his urinary stream since 2 years ago. Three months ago, he began to experience urinary frequency and a sense of incomplete voiding, which became more severe yesterday, leading to his visit. He is not taking any medication. His level of consciousness is clear. He is 165 cm tall, weighs 63 kg, and has a body temperature of 36.2°C. His pulse rate is 80 bpm and regular, and his blood pressure is 148/86 mmHg. His respiratory rate is 16 breaths/min. A bulge is detected in his lower abdomen. Urinalysis reveals: protein (−), glucose (−), ketones (−), occult blood 1+, 5-9 RBCs/HPF, and 5-9 WBCs/HPF in sediment. Blood test results show: RBC count of 4.76 million/μL, Hb level of 13.8 g/dL, Hct of 39%, WBC count of 5,200/μL, and a platelet count of 240,000/μL. Blood chemistry analysis shows a BUN level of 28 mg/dL, serum creatinine level of 4.4 mg/dL, Na level of 137 mEq/L, K level of 5.0 mEq/L, and Cl level of 114 mEq/L. Abdominal ultrasound images (A-C) are shown separately. What should be done first?", "choices_en": ["Hemodialysis", "Creation of a renal fistula/surgery for renal fistula", "Diuretic administration", "Ureteral stent placement", "Indwelling urinary catheterization"], "answer": ["e"]}
{"problem_id": "114C56", "problem_text_en": "A 32-year-old man presents with fever, runny nose, and cough. He had traveled to Southeast Asia with his family for a week during summer vacation and returned home two weeks ago. On examination, he has conjunctival injection, white patches in his oral cavity, and a rash with a merging erythematous appearance all over his body. Which of the following statements is incorrect?", "choices_en": ["Report to the public health center.", "Perform a virus gene test.", "Medical treatment under a negative pressure isolation system.", "Confirm the patient's actions before the consultation.", "Wearing a surgical mask is effective for infection prevention."], "answer": ["e"]}
{"problem_id": "114C57", "problem_text_en": "A 43-year-old male self-employed individual started to lose his temper and shout easily, and was persuaded by his wife and mother to visit the hospital. For a while after his father suddenly passed away three months ago, he felt unwell and stopped talking to his family. One month ago, he started to buy a lot more than necessary for the store, and started shouting loudly at his employees. He moved the place of product displays many times, and kept moving it. He hardly used to drink alcohol, but started drinking every night. He is talkative, expresses emotions intensely, and the topics of conversation spread endlessly. He expresses dissatisfaction with the visit and wants his family members who are trapped in pessimistic thoughts due to mental stress to receive treatment. He has never had any developmental problems. Blood tests, head MRI, and EEG tests are normal. Which of the following symptoms are observed in this patient? Select two.", "choices_en": ["Sensory aphasia", "Ideational apraxia", "Behavioral compulsions", "Union relaxation, or relaxation of the sphincter of the anal canal", "Hallucinations of small animals"], "answer": ["b", "c"]}
{"problem_id": "114C58", "problem_text_en": "A 38-year-old woman visits the clinic with complaints of lower abdominal pain. She has been experiencing lower abdominal and back pain during menstruation for the past 5 years. She started taking days off from work during the first two days of menstruation a year ago. Three months ago, she started experiencing lower abdominal and back pain after the end of menstruation, leading her to take days off from work. Her menstrual cycle is 28 days long and lasts for 5 days. She currently does not want to get pregnant, but hopes to in the future. She drinks alcohol occasionally. Her mother received a hysterectomy due to uterine fibroids. She is 162 cm tall and weighs 58 kg. Her temperature is 36.8°C, pulse rate is 68 bpm and regular, and blood pressure is 108/76 mmHg. Heart and breath sounds are normal. A palpable tender lump is found in her lower abdomen. A bimanual pelvic examination reveals a normal-sized anteverted uterus. Tenderness is detected in masses of the left and right annexes, each measuring about 10 cm in diameter. Painful hard nodes are detected in Douglas pouch. A sagittal section of an MRI scan of the lower abdomen is also shown. Select two factors to consider when determining the treatment approach.", "choices_en": ["Height", "Alcohol consumption history", "Family history", "Intensity of pain", "Hope for fertility preservation"], "answer": ["d", "e"]}
{"problem_id": "114C59", "problem_text_en": "A 25-year-old primigravida (gravida 1, para 0) was referred for perinatal care at 34 weeks and 4 days of gestation from a nearby obstetric clinic. There was no significant medical or family history. She is 160 cm tall and weighs 59 kg. Her body temperature is 36.6°C, pulse rate is 80 beats/minute and regular, and blood pressure is 120/72 mmHg. There was no color change in the BTB test paper during the internal examination. Abdominal ultrasound examination showed that the fetus was in a cephalic presentation, with an estimated weight of 2,050 g and an AFI of 3.8 cm. The ultrasound image of the umbilical cord section (A) and the results of the non-stress test (NST) (B) are shown separately. Which of the following explanations is correct? Select two.", "choices_en": ["\"Absolute rest is necessary.\"", "\"Premature rupture of membranes is suspected.\"", "\"Oligohydramnios is suspected\"", "\"There is a need to give birth within today\"", "\"Advanced testing is required for congenital diseases in infants\""], "answer": ["c", "e"]}
{"problem_id": "114C60", "problem_text_en": "Read the following text and answer the questions below. \n\nA 46-year-old woman is hospitalized for surgery for acute appendicitis. Medical history: She underwent an appendectomy three days ago. Yesterday, she had a fever of 38.0℃ and was examined this morning. Past history: Nothing notable. Lifestyle: No history of smoking or alcohol consumption. Family history: Her father died of pancreatic cancer at the age of 68. Present illness: Consciousness level is JCS I-1, GCS 15 (E4V5M6). She is 155 cm tall, weighs 48 kg, and has a body temperature of 37.2℃. Her pulse is 112 bpm, regular. Blood pressure is 78/40 mmHg. Respiratory rate is 28 breaths/min. Oxygen saturation is 94% (room air). No swollen lymph nodes in the neck. No abnormal heart sounds. Breath sounds are weakened and coarse crackles are heard in the lower left chest. The abdomen is flat, soft, and no liver or spleen can be palpated. No abnormalities are found in the surgical incision of the abdomen. No tenderness in the back. Edema is seen in both lower legs. Test results: Blood test: Red blood cells are 3.88 million, Hb is 11.2 g/dL, Ht is 36%, WBC is 9,800 (neutrophils 39%, segmented neutrophils 45%, eosinophils 3%, basophils 2%, monocytes 4%, lymphocytes 7%), and platelets are 180,000. The D-dimer level is 3.4μg/mL (normal value: less than 1.0). Blood chemistry: Total protein is 6.5 g/dL, albumin is 2.9 g/dL, blood urea nitrogen is 21 mg/dL, creatinine is 1.2 mg/dL, Na is 139 mEq/L, K is 4.1 mEq/L, and Cl is 108 mEq/L. CRP is 12mg/dL and lactate is 14mg/dL (normal range: 5-20). Chest X-ray is shown separately. Klebsiella pneumoniae was detected on two sets of blood cultures. What is the most likely diagnosis?\n\n", "choices_en": ["Pneumonia", "Pyelonephritis", "Surgical site infection", "Acute cholangitis", "Pyogenic spondylitis"], "answer": ["a"]}
{"problem_id": "114C61", "problem_text_en": "Along with oxygen administration, 1,500 mL of saline solution was infused. The patient's temperature is 38.1°C, pulse rate is 96/min and regular. Blood pressure is 112/64 mmHg, respiratory rate is 24/min and SpO2 is 97% (with nasal cannula oxygen administration at 3 L/min). Which of the following statements are true regarding this patient's condition? Select two.", "choices_en": ["Septicemia/bacteremia", "Septicemia", "Multi-organ failure", "Septic shock", "Disseminated intravascular coagulation (DIC)"], "answer": ["a", "b"]}
{"problem_id": "114C62", "problem_text_en": "What is the first indicator that should be used to determine the effectiveness of antibiotic therapy?", "choices_en": ["Decrease in respiratory rate", "Disappearance of lower leg edema", "Normalization of CRP levels", "Normalization of white blood cell count.", "Normalization of D-dimer"], "answer": ["a"]}
{"problem_id": "114C63", "problem_text_en": "Read the following text and answer the following question. \n\nA 23-year-old man was found collapsed at his home and transported by ambulance. Present History: He played video games all night and drank a large amount of a commercially available caffeine-containing drink without heeding his mother's objections since last night. The total amount of caffeine ingested is estimated to be more than 2,500 mg. He was found collapsed at his home by his mother this morning and an ambulance was called. Past History: Nothing significant. Lifestyle: He lives with his family and spends most of his time at home, rarely going out. After retiring three years ago, he has not worked. Family history: Nothing significant. Present illness: He opens his eyes and vocalizes with \"ahh\" but cannot respond to questions. He fends off pain stimuli with his hands. Temperature is 38.2℃. Heart rate: 148/min, regular. Blood pressure: 98/70 mmHg. Respiratory rate: 30/min. SpO2: 97% (with mask under 5L/min oxygen administration). Pupils have a diameter of 5 mm and no difference is observed between right and left. Emesis is observed in the oral cavity. No motor paralysis or abnormal tendon reflexes are found. No abnormal heart sounds are found. Coarse crackles are heard in both lung fields. Marked urinary incontinence is observed. Laboratory findings: Blood test: red blood cells: 4.59 million, Hb: 15.1 g/dL, Ht: 44%, white blood cells: 11,400, platelets: 250,000. Blood biochemistry: AST: 28 U/L, ALT: 24 U/L, CK: 624 U/L (baseline: 30-140), blood urea nitrogen: 40 mg/dL, creatinine: 0.9 mg/dL, blood glucose: 112 mg/dL, Na: 142 mEq/L, K: 3.8 mEq/L, Cl: 96 mEq/L. CRP: 2.4 mg/dL. What is the most appropriate composition of the initial fluid replacement? \n\nAnswer:", "choices_en": ["5% glucose solution", "Na+ 35mEq/L, K+ 20mEq/L, Cl- 35mEq/L", "Na+ 154mEq/L, concentrated glycerin, fructose co-formulated solution", "Na+ 30mEq/L, K+ 0mEq/L, Cl- 20mEq/L, L-Lactate- 10mEq/L.", "Na+ 130mEq/L, K+ 4mEq/L, Cl- 109mEq/L, L-lactate- 28mEq/L."], "answer": ["e"]}
{"problem_id": "114C64", "problem_text_en": "What is the next appropriate step following venous access placement?", "choices_en": ["Gastric lavage", "Tracheal intubation", "Hemodialysis", "Hemodialysis", "Activated charcoal administration"], "answer": ["b"]}
{"problem_id": "114C65", "problem_text_en": "After treatment at the emergency department, it was planned to place a central venous catheter from the right internal jugular vein under echocardiography guidance in the intensive care unit. After local anesthesia, during the puncture for catheterization, a backflow of bright red blood was confirmed. As soon as the puncture needle was withdrawn, the same site began to swell rapidly. Blood pressure is 92/60 mmHg, and heart rate is 130 bpm and regular. What is the immediate action that should be taken?", "choices_en": ["Red blood cell transfusion", "Administration of antihypertensive drugs", "Local compression hemostasis", "Blood gas analysis of the refluxed blood", "Continuation of catheter insertion technique on the opposite side"], "answer": ["c"]}
{"problem_id": "114C66", "problem_text_en": "Read the following text and answer the question below: An 80-year-old man presents with dizziness being his chief complaint. His recent medical history reveals that he became progressively less engaged in conversations with his family members about six months ago, and that he would sometimes not answer their questions, but can converse normally if spoken to loudly, and was still able to initiate greetings. For the past two months, he has experienced increasing difficulties with walking indoors and outdoors, and recently began to fall. He cannot use public transportation alone and was accompanied by his family for the visit. His past medical history is unremarkable. He lives with his wife and son and daughter-in-law. He has never smoked and drinks alcohol on occasions. He can bathe and use the toilet by himself. Family history is unremarkable. On examination: the patient is alert and oriented. His height is 164 cm and weight is 58 kg. Temperature is 36.6 °C. Pulse is 72 bpm, regular. Blood pressure is 132/76 mmHg. There is no palpable thyroid or lymphadenopathy. Cardiovascular and respiratory examination is unremarkable. The abdomen is flat and soft, without palpable liver or spleen. On neurological examination, the Weber test shows lateralization to the left. There is a mild dysarthria, but no aphasia. The patient can remember and repeat three objects (sakura, cat, train) after immediate recall, but not after delayed recall. His Cube copying and Clock Drawing Test is inaccurate. Upper limb Barré's sign is negative. There is no abnormality in limb tendon reflexes and no pathological reflexes. He showed a measure disturbance in bilateral upper limbs on the finger-nose test. He has an unsteady gait with ataxia and difficulty with tandem gait. There is no Romberg sign or abnormal superficial or deep sensations. Laboratory examination: CBC: RBC count: 4.5 million, hemoglobin 14.0 g/dL, hematocrit 42%, white blood cell count 5,600, and platelet count of 300,000. Biochemical analysis: Total protein is 7.8 g/dL, albumin 4.0 g/dL, total bilirubin 1.0 mg/dL, AST 16 U/L, ALT 18 U/L, LD 210 (normal range 120-245) ALP 250 U/L (normal range 115-359), γ-GT 18 U/L (normal range 8-50), CK 80 U/L (normal range 30-140), blood urea nitrogen 20 mg/dL, creatinine 0.9 mg/dL, uric acid 5.0 mg/dL, glucose 88 mg/dL, triglyceride 150 mg/dL, HDL cholesterol 40 mg/dL, LDL cholesterol 140 mg/dL, Na 145 mEq/L, K 4.0 mEq/L, Cl 104 mEq/L. His CRP level is 0.1 mg/dL. T2-weighted MRI images of the brain with T2* susceptibility-weighted imaging (SWI) in the horizontal plane are shown in (A-C). Which of the following is not a possible lesion that can be inferred from the neurological examination findings?", "choices_en": ["Bridge", "Hippocampus", "Parietal lobe", "Cerebellar hemisphere", "Posterior spinal tract"], "answer": ["e"]}
{"problem_id": "114C67", "problem_text_en": "Which of the following items in the Comprehensive Geriatric Assessment 7 (CGA7) is not able to be assessed due to unreadable or uninterpretable responses?", "choices_en": ["Motivation", "Emotions", "Cognitive function", "Basic activities of daily living (ADL)", "Instrumental activities of daily living (IADL)"], "answer": ["b"]}
{"problem_id": "114C68", "problem_text_en": "Based on the medical interview and neurological examination, which of the following is most likely to indicate an abnormality?", "choices_en": ["Olfactory test", "Needle electromyography", "Intravesical pressure", "Pure-tone audiometry test", "Somatosensory evoked potential"], "answer": ["d"]}
{"problem_id": "114C69", "problem_text_en": "Read the following text and answer the following question. \n\nA 66-year-old man was brought in by ambulance due to chest and back pain as well as weakness in the left upper and lower limbs. Present illness: At 11:00 am today, while doing desk work, he reached for a document on the top shelf, at which point severe chest and back pain suddenly appeared. Shortly thereafter, left hemiplegia appeared, and he experienced even more heavy chest pain and cold sweats, so he called an ambulance 30 minutes after the onset of symptoms. Past history: He has been undergoing outpatient treatment for hypertension for 2 years. Lifestyle: He lives with his wife, does not smoke, and drinks alcohol occasionally. Family history: His father died at age 86 from a cerebral hemorrhage, and his mother died at age 88 from gastric cancer. Current findings: He is conscious and alert. Height: 162 cm, weight: 80 kg. Blood pressure is 78/62mmHg with no obvious left-right asymmetry. Pulse rate is 108/min (weak), regular. Respiratory rate is 18/min. SpO2 is 99% (room air). His jugular vein is distended. No anemia is visible in the conjunctiva. Heart sounds are both weakened, with II/IV systolic regurgitant murmur heard most strongly at the 3rd left sternal border. Nothing abnormal is heard in the breath sounds. His abdomen is flat and soft, and neither his liver nor spleen can be palpated. In his left upper and lower limbs, partial paralysis is observed, and the Babinski sign is positive. Examination findings: An electrocardiogram showed sinus rhythm at 108 beats/min with low voltage in both the limb and precordial leads, and ST elevation in II, III, and aVF. A chest X-ray taken in the supine position using a mobile X-ray machine (A) and a chest X-ray taken in the standing position 6 months ago (B) are shown separately. While comparing the two X-ray images, the trainee reported the findings and interpretation to the attending physician. Which of the following is appropriate?\n\n（A）急性後壁心筋梗塞 \n（B）急性前壁心筋梗塞\n（C）進行性心不全 \n（D）肺塞栓症\n（E）大動脈解離\n\nAnswer: (A) Acute posterior myocardial infarction", "choices_en": ["\"There are more gastric bubbles compared to 6 months ago.\"", "\"The descending aorta is not visible in today's photo.\"", "\"Significant tracheal deviation is observed in today's photo\"", "\"Comparing the degree of heart enlargement with 6 months ago is difficult.\"", "\"There is no pleural effusion in any of the photos since the CP angle (costophrenic angle) is sharp.\""], "answer": ["d"]}
{"problem_id": "114C70", "problem_text_en": "Which disease is less likely at this point?", "choices_en": ["Cerebral infarction/stroke", "Aortic dissection", "Acute coronary syndrome", "Pulmonary embolism", "Cardiac tamponade"], "answer": ["d"]}
{"problem_id": "114C71", "problem_text_en": "Which test is given priority for determining the treatment plan?", "choices_en": ["Cardiac MRI", "Chest contrast-enhanced CT scan", "Coronary artery CT angiogram", "D-dimer measurement", "Measurement of cardiac troponin T"], "answer": ["b"]}
{"problem_id": "114C72", "problem_text_en": "A 76-year-old woman presents with complaints of general fatigue and loss of appetite. Medical history includes hypertension and osteoporosis, both of which were diagnosed at age 65 and treated with medication. She has been receiving treatment for degenerative knee arthritis for 2 months, but experiences severe pain when standing or walking, and has been spending more time in bed. Loss of appetite began gradually 1 week ago and she has been almost motionless on the bed for the past 3 days, prompting her family to accompany her to the hospital. Past medical history includes a stroke at age 74. She has residual left hemiparesis and paresthesia, but is able to perform activities of daily living independently using a cane. She has no history of smoking or drinking. Her father died of lung cancer at age 68. \n\nOn examination, she is alert and oriented. Her height is 155 cm and weight is 41 kg. Vital signs are as follows: temperature 36.2°C, pulse rate 104 bpm, blood pressure 86/54 mmHg, respiratory rate 16/min, and SpO2 97% on room air. Her eyelids are sunken, conjunctivae are not anemic, and oral mucosa is dry. Jugular veins are collapsed. Heart and breath sounds are normal. Abdomen is flat and soft with no palpable liver or spleen. No edema is detected in the lower legs. She has hemiparesis in the left upper and lower extremities.\n\nUrinalysis shows no protein, glucose, or occult blood. Hematology results reveal RBC 3.96 million/μL, Hb 12.1 g/dL, Hct 39%, WBC 8600/μL, and platelets 250,000/μL. Biochemical analysis shows total protein 6.2 g/dL, albumin 3.1 g/dL, AST 34 U/L, ALT 12 U/L, LD 221 U/L (normal range 120 to 245 U/L), ALP 352 U/L (normal range 115 to 359 U/L), CK 38 U/L (normal range 30 to 140 U/L), BUN 52 mg/dL, creatinine 2.2 mg/dL, glucose 104 mg/dL, Na 142 mEq/L, K 4.4 mEq/L, Cl 108 mEq/L, Ca 12.4 mg/dL, P 3.6 mg/dL, and CRP 0.2 mg/dL. Her Revised Hasegawa Dementia Scale score is 26 out of 30.\n\nA pharmacist on the ward has reviewed her medication notebook, which is presented below:\n\n○△ Clinic Patient Name: Kosai Hanako Patient ID: 114-0021 Physician: Rodo Ichiro Prescription Date: 2019/12/08\n\nRx 1\nAmlodipine 5 mg tablet\n1 tablet once daily\n\n〈Antihypertensive agent〉\n(1 dose per day)\nAfter breakfast, 28-day supply\n\nRx 2\nAspirin 100 mg tablet\n1 tablet once daily \n\n〈Antiplatelet agent〉\n(1 dose per day)\nAfter breakfast, 28-day supply\n\nRx 3\nMecobalamin 500 μg tablet\n1 tablet 3 times daily \n\n〈Vitamin B12〉\n(3 doses per day)\nAfter meals, 28-day supply\n\nRx 4\nAlfacalcidol 1 μg tablet\n1 tablet once daily\n\n〈Active vitamin D〉\n(1 dose per day)\nAfter breakfast, 28-day supply\n\nRx 5\nLoxoprofen 60 mg tablet\n1 tablet 3 times daily \n\n〈NSAID〉\n(3 doses per day)\nAfter meals, 28-day supply\n\nWhich drugs should be discontinued? Select three.", "choices_en": ["Antihypertensive drug", "Antiplatelet agent", "Vitamin B12", "Active form of vitamin D", "Non-Steroidal Anti-Inflammatory Drug (NSAID)"], "answer": ["a", "d", "e"]}
{"problem_id": "114C73", "problem_text_en": "With appropriate adjustment of medication and fluid infusion, the patient's general malaise and loss of appetite improved. However, during hospitalization, mild dysphagia and spasticity in the left lower limb joint were observed during examination. In addition, it was discovered through family discussion that the prescribed medication from the regular doctor was not being taken properly. Which of the following professions are essential for supporting the patient's discharge? Select three.", "choices_en": ["Pharmacist", "Prosthetist/Orthotist", "Speech therapist (literally \"language hearing specialist\")", "Physical therapist", "Clinical engineering technician"], "answer": ["a", "c", "d"]}
{"problem_id": "114C74", "problem_text_en": "Which of the following would be useful in reducing the risk of falls and fractures after discharge in this patient?", "choices_en": ["Restriction on going out.", "Encouragement of light exercise", "Encouragement of weight loss", "Increase in salt intake", "Increased intake of phosphorus"], "answer": ["b"]}
{"problem_id": "114C75", "problem_text_en": "In a certain year, city A with a population of 120,000 had a total of 510 deaths. The table shows the number of deaths by age group for city A and the estimated population by age group for Japan in the same year.\n\nAge Group\nCity A\nJapan\n\n\nDeaths\nPopulation\nPopulation\n\n\n0-19 years\n20\n40,000\n20,000,000\n\n\n20-64 years\n140\n70,000\n70,000,000\n\n\n65 years and older\n350\n10,000\n30,000,000\n\n\nTotal\n510\n120,000\n120,000,000\n\nCalculate the age-adjusted death rate per 1,000 population in city A using the direct method with the population of Japan as the standard population. If a decimal point equals or exceeds the third decimal place, round off to the second decimal place. Answer: ①②.③/1,000", "choices_en": [], "answer": ["100"]}
