{"problem_id": "114D1", "problem_text_en": "What are the useful examinations or tests for diagnosing a patient who presented to the clinic with repeated unilateral transient visual disturbances as a chief complaint?", "choices_en": ["Intraocular pressure measurement", "Visual field examination", "Pupillary light reflex", "Auscultation of the neck", "Eye movement test"], "answer": ["d"]}
{"problem_id": "114D2", "problem_text_en": "What should be differentiated from a chalazion in elderly patients?", "choices_en": ["Sebaceous gland carcinoma", "Papilloma", "Chalazion (a type of eyelid cyst)", "Basal cell carcinoma", "Choroidal tumor"], "answer": ["a"]}
{"problem_id": "114D3", "problem_text_en": "If Shaken Baby Syndrome is suspected, what are the eye findings that should be confirmed?", "choices_en": ["Blepharitis", "Cataract", "Glaucoma", "Corneal leukoma", "Retinal hemorrhage"], "answer": ["e"]}
{"problem_id": "114D4", "problem_text_en": "A photo of a patient's handwriting during which the patient complained of the hand trembling and difficulty writing is shown separately. The characters written by the patient are shaky and difficult to read, but there is no impairment in other movements. Which of the following conditions could be causing the same pathology as this patient?", "choices_en": ["Migraine", "Eyelid spasm", "Simple partial seizure", "Periodic limb paralysis", "Tourette syndrome"], "answer": ["b"]}
{"problem_id": "114D5", "problem_text_en": "A 68-year-old woman underwent sigmoid colectomy. Which of the following complications is most likely to occur, as a postoperative complication?\n\nNote: It is difficult to provide an accurate translation without additional context. However, based on the provided sentence, this is the best possible translation.", "choices_en": ["Right subphrenic", "Below the left diaphragm", "Hepatic flexure groove", "Left colic gutter", "Rectouterine pouch"], "answer": ["e"]}
{"problem_id": "114D6", "problem_text_en": "Which of the following combinations of infection and antimicrobial agent is incorrect?", "choices_en": ["Psittacosis --------- Minocycline", "Actinomycosis --------- Ampicillin", "Nocardiosis --------- ST compound", "Pseudomonas infection --------- Cefazolin", "Legionnaire's disease --------- Levofloxacin"], "answer": ["d"]}
{"problem_id": "114D7", "problem_text_en": "Which of the following is appropriate for the treatment of alcohol dependence?", "choices_en": ["Hospitalization is the first choice.", "Alcoholics Anonymous meetings follow the principle of anonymous participation.", "Administer benzodiazepine for withdrawal symptoms.", "Vitamin D is effective for preventing encephalopathy.", "Administering anti-alcohol drugs to a patient by secretly mixing them into the patient's food without their knowledge."], "answer": ["c"]}
{"problem_id": "114D8", "problem_text_en": "Which of the following is not related to miscarriage?", "choices_en": ["Age", "Hypothyroidism", "Cervical polyp", "Antiphospholipid antibody syndrome", "Carrier of a translocation chromosome abnormality"], "answer": ["c"]}
{"problem_id": "114D9", "problem_text_en": "What is the most common location for small blisters to appear in cases of hand, foot, and mouth disease?", "choices_en": ["Pharynx", "Palm of the hand", "Plantar", "Trunk (of the body)", "Vulva"], "answer": ["a"]}
{"problem_id": "114D10", "problem_text_en": "Which of the following does not result in cyanosis?", "choices_en": ["Tetralogy of Fallot", "Aortic valve", "Complete transposition of the great arteries", "Total anomalous pulmonary venous return syndrome", "Eisenmenger syndrome"], "answer": ["b"]}
{"problem_id": "114D11", "problem_text_en": "Which of the following is the strongest indication of infectious mononucleosis in the differential diagnosis with streptococcal infection?", "choices_en": ["Headache", "Fever", "Pharyngeal redness", "Dry cough", "Swollen cervical lymph nodes"], "answer": ["e"]}
{"problem_id": "114D12", "problem_text_en": "Here are separate photos of instruments (A, B) used in neurosurgery. Which procedures are these instruments used for? Select two.", "choices_en": ["Endovascular coil embolization for cerebral aneurysm", "Burr hole drainage for chronic subdural hematoma", "Endoscopic transsphenoidal tumor resection for pituitary adenoma", "Carotid endarterectomy for cervical internal carotid artery stenosis", "Ventriculoperitoneal shunt for normal pressure hydrocephalus"], "answer": ["b", "e"]}
{"problem_id": "114D13", "problem_text_en": "Which of the following are correct in anatomy of the genitourinary system? Select two.", "choices_en": ["The ureteral orifice opens into the trigone of the bladder.", "The ejaculatory duct opens into the prostatic urethra.", "The right adrenal vein drains into the right renal vein.", "The testicular artery branches out from the internal iliac artery.", "There are three physiological narrowing points in the ureter."], "answer": ["b", "e"]}
{"problem_id": "114D14", "problem_text_en": "Which of the following are included as prognostic factors in the severity assessment criteria for acute pancreatitis? Select two.", "choices_en": ["CRP (C-reactive protein)", "Partial pressure of carbon dioxide in arterial blood (PaCO2)", "Blood urea nitrogen (BUN)", "Lipase", "Trypsin"], "answer": ["a", "c"]}
{"problem_id": "114D15", "problem_text_en": "A 64-year-old woman presents with diplopia and insomnia. Two months ago, she noticed that her eyelids became heavy in the evening and objects appeared double. One month ago, she became aware that she sometimes had liquid backflow into her nose when drinking water in a hurry while tired. Her symptoms tended to worsen in the evening and she had experienced insomnia. There is no significant past medical history. She tested positive for anti-acetylcholine receptor antibodies. Chest X-ray (A) and contrast-enhanced chest CT (B) are shown separately. Which of the following is the most appropriate initial treatment?", "choices_en": ["Thymectomy with extended thymic resection, including thymoma.", "Cyclosporine administration", "Administration of benzodiazepine-type sleep medicine", "Radiation therapy", "Chemotherapy"], "answer": ["a"]}
{"problem_id": "114D16", "problem_text_en": "A 58-year-old woman presents with abdominal distension as the chief complaint. She noticed a lower abdominal bulge about three months ago that caused her clothing to feel tight. She was diagnosed with a chocolate cyst at age 30, and has been menopausal since the age of 50. On examination, a non-tender, immobile mass measuring 10 cm is palpated in the left adnexal region. Laboratory results are as follows: Red blood cells 3.6 million/µL, Hemoglobin 10.1 g/dL, Hematocrit 32%, White blood cells 6,800/µL, Platelets 260,000/µL. Serum tests show tumor markers: CEA 3.8 ng/mL (normal: <5 ng/mL), CA19-9 38 U/mL (normal: <37 U/mL), and CA125 280 U/mL (normal: <35 U/mL). The results of cervical smear and endometrial cytology are negative. Esophagogastroduodenoscopy and colonoscopy show negative results. She was admitted for surgery, and laparotomy showed a mass in the left adnexa without ascites. Cytology of abdominal lavage was negative. There was no adhesion between the tumor and intestine, and no peritoneal dissemination was observed. There were no abnormalities in the greater omentum or lymph nodes. Swift pathological diagnosis showed clear cell carcinoma. What other organs or tissues should be resected in addition to the left adnexal region, uterus and greater omentum?", "choices_en": ["Vaginal wall", "Urinary bladder", "Sigmoid colon", "Right adnexa (referring to the right ovary and fallopian tube)", "Mesenteric lymph node"], "answer": ["d"]}
{"problem_id": "114D17", "problem_text_en": "A 42-year-old primiparous (G1P0) woman was admitted due to the onset of labor pains. She had a history of laparoscopic myomectomy at the age of 35 and hysteroscopic resection of endometrial polyps at the age of 38. After 8 hours of hospitalization, she delivered a 3,450 g male infant vaginally, and the placenta was smoothly delivered 5 minutes after the baby. The amount of bleeding during delivery was 100 mL, and the perineal laceration was sutured. Mild confusion appeared 20 minutes after delivery, and her pulse was 120 beats/minute and regular, blood pressure was 72/40 mmHg, and respiratory rate was 24/minute, with complaints of abdominal pain. Only a small amount of genital bleeding was observed, and vaginal inspection revealed slight bleeding from the cervix. What is the most likely cause?", "choices_en": ["Cervical spine injury", "Relaxed bleeding / hemorrhage", "Uterine rupture", "Placenta accreta", "Uterine inversion"], "answer": ["c"]}
{"problem_id": "114D18", "problem_text_en": "A 51-year-old woman complains of facial sweating. She has also been feeling fatigued for the past 6 months and experienced increased episodes of sweating, heat sensation in the back of the neck, and stiff shoulders. She is 162 cm tall and weighs 56 kg. Her body temperature is 36.0℃, and her pulse rate is 72 bpm and regular, with a blood pressure of 124/76 mmHg. She has not menstruated in the past year. Physical examination reveals no apparent abnormalities. Laboratory results indicate a red blood cell count of 3.87 million, Hb concentration of 12.8 g/dL, Ht level of 39%, white blood cell count of 6,300, and platelet count of 210,000. Her blood biochemistry shows AST of 24 U/L, ALT of 20 U/L, TSH of 1.2 mU/mL (normal range 0.2-4.0), FT4 of 1.1 ng/dL (normal range 0.8-2.2), and FSH of 38 mIU/mL (normal range for postmenopausal women is 30 or above). No abnormalities are observed in her electrocardiogram. What is the most likely cause of this condition?", "choices_en": ["Liver", "Ovary", "Pituitary gland", "Coronary artery", "Thyroid gland"], "answer": ["b"]}
{"problem_id": "114D19", "problem_text_en": "A 65-year-old man is accompanied by his wife to the hospital due to concerns about his behavior. He has hypertension and is currently taking antihypertensive medication. He usually takes a morning walk but became obsessed with leaving at an exact time six months ago. He has also become irritable, shouting suddenly at his son and grandchildren during a visit. He insists on having the same meal and becomes angry if served different food, leaving the table in the middle of a meal. A friend from his hobby group called his wife to ask for help, saying that he is causing problems by trying to push his opinions too strongly. He has no problems with forgetfulness and there are no communication difficulties. His daily life is not affected. His wife has no idea what could be causing these changes in his behavior. Even in the examination room, he seems unhappy about the visit and verbally abuses his wife. What is the most likely finding in this patient?", "choices_en": ["Hallucinations", "Repetition disorder", "Executive function disorder", "Visual-spatial cognitive impairment", "Episodic memory impairment"], "answer": ["c"]}
{"problem_id": "114D20", "problem_text_en": "A 22-year-old man complains of palpitations, sweating, and hand tremors. He has been experiencing palpitations and sweating before breakfast and dinner for the past 3 months. He noticed that the symptoms disappeared after eating. He is not taking any medication currently. His paternal grandmother had a glucagonoma. He is alert and conscious. His height is 171 cm and weight is 62 kg. His pulse rate is 68 beats/min and regular, and blood pressure is 136/80 mmHg. No abnormal heart or breath sounds are heard. His abdomen is flat, soft, and non-tender, with no palpable liver or spleen. Laboratory findings: Hemoglobin 14.6 g/dL, white blood cell count 3,900/µL, and platelet count 240,000/µL. Blood chemistry (2 hours after breakfast): BUN 13 mg/dL, creatinine 0.6 mg/dL, glucose 120 mg/dL, Na 140 mEq/L, K 4.0 mEq/L, and Cl 106 mEq/L. The results of a 24-hour continuous glucose monitor are shown separately. What diagnostic test is necessary?", "choices_en": ["Fasting test", "Water restriction test", "TRH stimulation test", "LHRH stimulation test", "Glucagon stimulation test"], "answer": ["a"]}
{"problem_id": "114D21", "problem_text_en": "A 68-year-old man comes to the hospital complaining of general fatigue and weight loss. He has lost 5 kg in the past 6 months, and his fatigue has become pronounced over the past 2 months. He is 164 cm tall and weighs 44 kg. His pulse rate is 72 beats/minute and regular, and his blood pressure is 104/70 mmHg. He is alert and oriented. His conjunctivae are pale. No abnormalities are noted on cardiac and pulmonary examination. His abdomen is flat and soft, with no palpable liver or spleen. There is swelling in both legs. Urinalysis shows proteinuria (3+), glucose-negative, 1+ occult blood, and 5-9 red blood cells per high-power field on microscopic examination. The urine protein/creatinine ratio is checked, and the result is 4.6 g/g Cr (normal range < 0.15). His complete blood count reveals anemia with a red blood cell count of 3 million cells/μL, a hemoglobin level of 10.7 g/dL, a hematocrit of 31%, and a normal white blood cell count of 7,800 cells/μL and platelet count of 280,000 cells/μL. Blood biochemical analysis shows a protein level of 5.5 g/dL, an albumin level of 3.1 g/dL, an IgG level of 764 mg/dL (normal range: 960 – 1,960), an IgA level of 100 mg/dL (normal range: 110 – 410), an IgM level of 42 mg/dL (normal range: 65 – 350), a blood urea nitrogen level of 23 mg/dL, a serum creatinine level of 1.6 mg/dL, an HbA1c level of 5.6% (normal range: 4.6 – 6.2), and a total cholesterol level of 200 mg/dL. Immunological tests show negative results for MPO-ANCA, PR3-ANCA, and anti-nuclear antibodies. Urine immunoelectrophoresis reveals the presence of monoclonal proteins. The serum free light chain kappa/lambda ratio is 0.01 (normal range: 0.26 – 1.65). Echocardiography shows mild left ventricular hypertrophy. Abdominal ultrasonography shows enlarged kidneys. What is the potential cause of the renal lesion?", "choices_en": ["Diabetic nephropathy", "Lupus nephritis", "Amyloid nephropathy", "Chronic interstitial nephritis", "ANCA-associated nephritis"], "answer": ["c"]}
{"problem_id": "114D22", "problem_text_en": "A 30-year-old man presented to the hospital for evaluation of anemia. He had not exhibited any abnormalities during his annual health checkup last year, but he had experienced dyspnea on exertion for two weeks and was referred for examination after being diagnosed with anemia at a clinic near his home. His pulse was regular, with a rate of 88 beats per minute, and his blood pressure was 122/78 mmHg. His conjunctiva appeared pale, but jaundice was not observed. The examination of the chest revealed a systolic ejection murmur that was loudest at the second intercostal space on the right side of the sternum, but there were no abnormalities observed in his breathing. His abdomen was flat, soft, and free of hepatosplenomegaly. Hematological results showed low red blood cell count of 3.02 million cells per microliter, hemoglobin concentration of 8.3 g/dL, and hematocrit of 28%, with a low platelet count of 50,000 cells per microliter. White blood cells count was 2,400 cells per microliter (segmented neutrophils 3%, band neutrophils 28%, eosinophils 2%, monocytes 5%, and lymphocytes 62%). Biochemical blood analysis demonstrated that total protein level was 7.4 g/dL, albumin level was 4.2 g/dL, total bilirubin level was 0.5 mg/dL, direct bilirubin level was 0.2 mg/dL, aspartate transaminase level was 27 U/L, alanine transaminase level was 19 U/L, lactate dehydrogenase level was 948 U/L (normal range, 120-245), and alkaline phosphatase level was 476 U/L (normal range, 115-359). Laboratory values were not indicative of renal dysfunction with a blood urea nitrogen level of 12 mg/dL and a creatinine level of 0.9 mg/dL. His uric acid level was 8.5 mg/dL, sodium level was 140 mmol/L, potassium level was 4.0 mmol/L, chloride level was 102 mmol/L, calcium level was 10.0 mg/dL, and phosphorus level was 6.0 mg/dL. C-reactive protein level was 0.8 mg/dL. Bone marrow smear and cytogenetic tests were performed. The patient was found to have a Philadelphia chromosome, and CD10 and CD19 were positive on surface marker analysis, whereas CD20 and CD33 were negative. Which medication should be administered to this patient?", "choices_en": ["Imatinib", "Gefitinib", "Rituximab", "Bleomycin", "All-trans retinoic acid"], "answer": ["a"]}
{"problem_id": "114D23", "problem_text_en": "A 2-year-old boy was brought to the hospital by his mother due to abdominal pain. He has been complaining of intermittent abdominal pain since this morning. He had a bowel movement, but there was no blood in it. He is quiet during the examination. He is 86 cm tall and weighs 11.5 kg. He is alert and oriented. His body temperature is 36.8°C. His pulse rate is 100 beats per minute and regular. His blood pressure is 96/60 mmHg. His respiratory rate is 24 breaths per minute. No abnormalities are detected in heart and lung sounds. His abdomen is slightly distended but soft. He has tenderness in the upper part of the umbilicus. Bowel sounds are slightly hyperactive. A separate image of an abdominal ultrasonography is shown. What is the possible diagnosis?", "choices_en": ["Constipation", "Intestinal obstruction", "Acute appendicitis", "Duodenal ulcer", "Malrotation of the intestines"], "answer": ["b"]}
{"problem_id": "114D24", "problem_text_en": "A 3-year-old girl is brought to the hospital by her grandmother with a complaint of fever and rash all over her body. She had a temperature in the 38-degree Celsius range and a facial rash two days ago, which has spread throughout her body since yesterday. She has no history of oral medication. Her temperature is 38.1 degrees Celsius, pulse rate is 132 beats per minute and regular, blood pressure is 96/58 mmHg, respiratory rate is 30 breaths per minute, and SpO2 is 98% on room air. There is scaling, yellow crusts, and erythema around the mouth and nose. The diffuse erythematous rash is severe on the neck, axillae, abdomen, and groin. The patient complains of tenderness and is irritable with lethargy. The neck rash has small vesicles and pustules. There are no abnormalities in the conjunctiva or oral mucosa. Blood tests show a red blood cell count of 4.34 million, Hb of 12.1 g/dL, Ht of 35%, and a white blood cell count of 12,300 with 330,000 platelets. Immunological testing shows a CRP value of 0.8 mg/dL and an ASO level of 230 units (normal range: <250). A photograph of the patient's face to chest is shown separately. What is the most likely diagnosis?", "choices_en": ["Rubella", "Measles", "Scarlet fever", "Stevens-Johnson Syndrome", "Staphylococcal Scalded Skin Syndrome (SSSS)"], "answer": ["e"]}
{"problem_id": "114D25", "problem_text_en": "A 78-year-old man presented with abdominal pain. The pain started suddenly 4 hours ago and gradually increased in intensity, prompting him to seek medical attention. He has been undergoing medication therapy for atrial fibrillation for 2 years. His temperature is 37.1℃. His pulse is 120 bpm and irregular. His blood pressure is 86/56 mmHg. His respiratory rate is 24 breaths per minute. His abdomen is distended and tender to palpation. His blood test reveals: red blood cells of 5.1 million/mm3, Hb 15.8 g/dL, Ht 45%, white blood cells 9,500/mm3, platelets 130,000/mm3. His blood chemistry indicates: total protein 6.8 g/dL, albumin 3.4 g/dL, AST 16 U/L, ALT 14 U/L, LD 310 U/L (normal range: 120-245), CK 275 U/L (normal range: 30-140), blood urea nitrogen 31 mg/dL, creatinine 0.8 mg/dL, Na 134 mEq/L, K 5.2 mEq/L, Cl 108 mEq/L. The abdominal contrast-enhanced CT scan is shown separately. Which treatment is appropriate?", "choices_en": ["Emergency laparotomy surgery", "Hyperbaric oxygen therapy", "Endoscopic reduction surgery", "Superior mesenteric artery embolization", "Transanal ileus tube placement"], "answer": ["a"]}
{"problem_id": "114D26", "problem_text_en": "A 48-year-old woman presents with a chief complaint of loss of appetite and malaise. She developed cold-like symptoms and reduced appetite 5 days ago, and took over-the-counter medications and bed-rest. Yesterday, she became increasingly fatigued, and this morning she presented with shortness of breath and dizziness. Her medical history, lifestyle, and family history are unremarkable. She is 160 cm tall and weighs 50 kg. Her pulse rate is 116 beats/minute, regular. Blood pressure is 86/50 mmHg. Respiratory rate is 24/minute. SpO2 is 93% on room air. Heart sounds are tachycardic with gallop rhythm. Crackles are heard in both lower chest areas. Laboratory tests revealed red blood cells: 4.95 million/μL, Hb: 14.6 g/dL, white blood cells: 11,000/μL, platelets: 170,000/μL. Biochemical findings showed AST: 2324 U/L, ALT: 2532 U/L, LD: 3292 U/L (normal range: 120-245), CK: 6,064 U/L (normal range: 30-140), blood urea nitrogen: 47 mg/dL, creatinine: 0.9 mg/dL, total bilirubin: 1.4 mg/dL, CRP: 2.3 mg/dL. An electrocardiogram (A) at the time of presentation is shown separately. An echocardiogram showed left ventricular end-diastolic dimension of 50 mm, ejection fraction of 20%. Complete atrioventricular block then appeared, and coronary angiography was performed with temporary pacemaker placement. The coronary angiogram is shown (B) separately. What is the most likely diagnosis?", "choices_en": ["Acute myocarditis", "Dilated cardiomyopathy", "Acute myocardial infarction", "Takotsubo cardiomyopathy", "Acute pulmonary embolism"], "answer": ["a"]}
{"problem_id": "114D27", "problem_text_en": "A 71-year-old woman presents with a complaint of difficulty in urination. She had noticed a perineal mass a year ago which she had been manually reducing. She came for consultation due to difficulty in urination which had began three months ago. She is 156 cm tall and weighs 55 kg. Her temperature is 36.6℃. Her pulse rate is 72 / minute and regular, and blood pressure is 132/72 mmHg. Her blood test results reveal the following: RBC count 3.5 million, Hb 11.2 g/dL, Hct 34%, WBC count 4,000, platelets 250,000. Her blood biochemistry results reveal the following: BUN 23 mg/dL, creatinine 0.9 mg/dL, Na+ 144 mEq/L, K+ 4.2 mEq/L, Cl- 100 mEq/L, CRP 0.7 mg/dL. A separate photo of the external genitalia is shown. What is the diagnosis?", "choices_en": ["Rectal prolapse", "Bladder tumor", "Vulvar Paget's disease", "Urethral caruncle", "Genital warts"], "answer": ["b"]}
{"problem_id": "114D28", "problem_text_en": "A 78-year-old woman presented with left hip joint pain as the chief complaint. She had left hip joint pain without any apparent cause ten years ago, and left it untreated. Recently, the pain has worsened. An X-ray of the hip joint is shown separately. Which of the following is not an appropriate treatment for this condition?", "choices_en": ["Use of a cane", "Muscle strength training", "Manual therapy", "Administration of NSAIDs", "Total hip arthroplasty"], "answer": ["c"]}
{"problem_id": "114D29", "problem_text_en": "A 6-year-old girl is brought to the clinic by her grandfather with fever and rash as the main complaints. She developed a fever and cough 3 days ago. Although the fever subsided temporarily, she had another episode of fever today and a rash appeared on her trunk, prompting the visit to the clinic. The family traveled to a region with a measles outbreak 1 week ago. Which part of the body is the most important to examine for differential diagnosis?", "choices_en": ["Labium oris (Lips)", "Buccal mucosa", "Ocular conjunctiva", "Cervical lymph nodes", "BCG vaccination site"], "answer": ["b"]}
{"problem_id": "114D30", "problem_text_en": "A 47-year-old female patient presents with neck stiffness and left hand numbness as her main complaints. She reports experiencing numbness in her left index and middle fingers while doing household chores for one month. She has been taking medication for rheumatoid arthritis for 20 years. Her grip strength is 16 kg on the right and 14 kg on the left. She has buttonhole deformity on both hands. The patient exhibits mild sensory impairment in the left index and middle fingers, but no abnormality is noted in her lower limb muscle strength or tendon reflexes, and she shows no walking difficulties. As the patient has expressed a desire to discuss her hospital treatment options with her family, particularly because her second son is preparing to take an entrance exam, she has been prescribed a cervical collar. X-rays of the cervical spine (A to C) are provided separately. Which of the following is the correct instruction to give the patient regarding her daily life?", "choices_en": ["\"Please use a low pillow.\"", "\"Please remove the neck collar when washing your face.\"", "\"We recommend a massage of the muscles surrounding the neck.\"", "\"Please try not to use the left upper limb as much as possible.\"", "\"When getting up, please use the recoil of your upper body.\""], "answer": ["a"]}
{"problem_id": "114D31", "problem_text_en": "A 47-year-old man presents with chief complaint of pain in his right ankle. The patient reports feeling as though he was kicked from behind at the right ankle while playing tennis, and heard a snapping sound, followed by pain in the right ankle. Although he is able to walk, he is unable to stand on tiptoe with his right foot. What is the most likely diagnosis in this patient?", "choices_en": ["Surgery is not indicated as a treatment option.", "Unable to perform automatic movements of the ankle joint.", "Instability in the anteroposterior direction of the ankle joint occurs.", "The ankle joint dorsiflexes in the calf muscle grip test.", "Use ankle dorsiflexion restriction orthosis as a conservative treatment."], "answer": ["e"]}
{"problem_id": "114D32", "problem_text_en": "A 25-year-old man presents with fatigue and purple spots on his extremities. He has been experiencing fatigue for a month and developed the purple spots two weeks ago, which have not improved, so he sought medical attention. He has no significant medical history. He is 172 cm tall and weighs 58 kg. His temperature is 37.2°C. His pulse is 96 beats/minute and regular, and blood pressure is 132/82 mmHg. A systolic ejection murmur is heard on the right edge of the sternum. No abnormal respiratory sounds are detected. The abdomen is flat, soft, and no liver or spleen enlargement is palpated. No edema is observed. Laboratory findings are as follows: RBC count 1.9 million/μL, Hb 6.6 g/dL, Hct 19%, reticulocyte count 0.7%, WBC count 1,600/μL (neutrophils 11%, eosinophils 3%, basophils 2%, monocytes 9%, lymphocytes 75%), and platelet count 7,000/μL. Blood chemistry findings reveal a total protein of 6.7 g/dL, an albumin level of 4.7 g/dL, a total bilirubin level of 0.8 mg/dL, a direct bilirubin level of 0.2 mg/dL, AST of 25 U/L, ALT of 29 U/L, LD of 154 U/L (normal range: 120-245), a blood urea nitrogen level of 15 mg/dL, a creatinine level of 0.6 mg/dL, and a uric acid level of 5.8 mg/dL. A bone marrow smear stain with May-Giemsa shows no increase in blast cells and no dysplasia in any of the three blood cell lineages. Chromosome analysis shows a normal 46, XY karyotype. A histopathological examination of bone marrow tissue is provided separately. What is the inappropriate medication?", "choices_en": ["Cyclosporine", "Doxorubicin", "Anti-thymocyte globulin", "Adrenal cortex steroid", "Thrombopoietin receptor agonist"], "answer": ["b"]}
{"problem_id": "114D33", "problem_text_en": "A 5-year-old boy is brought to the hospital by his father complaining of reddish-brown rash on the face and back of the hands. The rash appeared on the face after a sports event a month ago and has not improved. Diffuse erythema is observed primarily on the cheeks around the nose bridge. Flat-topped papules with scales, about the size of millet, are observed in clusters on the proximal interphalangeal joints, distal interphalangeal joints, and metacarpal joint on the back of the hands. The child complains of grip pain in the proximal muscles of the four limbs. The urinalysis showed no protein, glucose, or occult blood. Blood analysis showed 4.41 million red blood cells, a hemoglobin level of 13.0 g/dL, a hematocrit level of 38%, 5,200 white blood cells, and 300,000 platelets. Blood biochemistry analysis showed an AST level of 54 U/L, ALT level of 23 U/L, LD level of 417 U/L (reference range 280 to 400), CK level of 312 U/L (reference range 30 to 140), aldolase level of 13.4 U/L (reference range 2.7 to 7.5), and Na, K, and Cl levels of 138, 3.8, and 102 mEq/L, respectively. Immunoserological analysis showed 160 fold ANA titer (reference range 20 or less) and anti-dsDNA antibody level of 6 IU/mL (reference range 12 or less). Photographs of the face (A) and back of the hands (B) are shown separately. What is the most likely diagnosis in this case?", "choices_en": ["Dermatomyositis", "Fibromyalgia", "Rhabdomyolysis", "Pityriasis alba", "Systemic Lupus Erythematosus (SLE)"], "answer": ["a"]}
{"problem_id": "114D34", "problem_text_en": "A 20-year-old man presented for evaluation after being told he has tall stature and long fingers. He developed a cold-like illness one week earlier and was advised to seek care from a specialized medical facility based on his height and finger length by a physician at a local clinic. He has been an active volleyball player since middle school. He has no history of smoking or alcohol consumption. His father had sudden death at the age of 34 years. His 15-year-old sister also has tall stature. The patient is alert and oriented. His height is 190 cm and weight is 75 kg. His pulse rate is 80 beats per minute and regular. His blood pressure is 132/72 mmHg. His extremities are long and he has spider-like fingers. Examination of the chest reveals a grade II/VI systolic murmur at the left sternal border in the third intercostal space. No abnormal breath sounds are heard. His abdomen is flat and soft, and there is no palpable liver or spleen. Laboratory studies show erythrocyte count of 4.24 million/mm3, hemoglobin level of 13.5 g/dL, white blood cell count of 6,800/mm3, and platelet count of 180,000/mm3. Serum total protein level is 7.0 g/dL, albumin level is 4.3 g/dL, AST level is 21 U/L, ALT level is 21 U/L, blood urea nitrogen level is 13 mg/dL, and creatinine level is 0.6 mg/dL. An echocardiogram shows mild dilatation of the ascending aorta and aortic valve regurgitation. Left ventricular ejection fraction is 60%. There is no other abnormal finding on chest and abdomen contrast CT. An ophthalmologic examination shows lens subluxation. Which of the following statements would be appropriate to explain to this patient?", "choices_en": ["\"This is a disease caused by an endocrine disorder.\"", "\"There is no need to impose restrictions on participating in sports competitions.\"", "\"There is a possibility of further progression of large blood vessel changes in the future\"", "\"There's no possibility that a taller sister has the same disease.\"", "\"Taking angiotensin-converting enzyme (ACE) inhibitors is prohibited.\""], "answer": ["c"]}
{"problem_id": "114D35", "problem_text_en": "A 21-year-old male patient complains of hand tremors. He had been working as a clerk since he was 18 years old, and started working part-time in inventory management at a large paint store contracted by his company last year, three days a week in the morning. Four days ago, he went diving on an isolated island and returned home by jet plane the day before yesterday. On the flight back, the weather was bad, and he couldn't move away from his seat due to turbulence. He noticed pain in the proximal interphalangeal joint of his right middle finger before going to bed on the day of his return. He also felt discomfort in his fingertips yesterday. He visited the hospital today because he experienced tremors in his fingers while writing. What is the most likely condition?", "choices_en": ["Decompression sickness (also known as \"the bends\" or Caisson disease)", "Motion sickness", "Cervicobrachial disorder (disorder affecting the neck, shoulder, and arm)", "Organic solvent poisoning", "Disorder caused by VDT work (Visual Display Terminal work)"], "answer": ["a"]}
{"problem_id": "114D36", "problem_text_en": "A 47-year-old man complained of cyanosis in both fingers and came to the hospital. He had been experiencing whitening and numbness in his fingertips and earlobes when he went out in the winter since three years ago. These symptoms disappeared when he returned home and warmed up. This winter, he was transferred to a cold district and came to receive medical treatment because his fingertips became numb and discolored blue-black during the outdoor moving work. His pulse was regular at 80 beats per minute, and his blood pressure was 132/80 mmHg. His conjunctiva was anemic, and his sclera showed jaundice. A systolic ejection murmur was heard at the second right intercostal space. His abdomen was flat, soft, and no palpable liver or spleen was detected. Urinalysis revealed negative protein and glucose, and 3+ occult blood. Blood test results showed red blood cells at 2.52 million, Hb at 9.0 g/dL, Ht at 26%, and white blood cells at 4200 (2% rod-shaped neutrophils, 70% segmented neutrophils, 2% eosinophils, 5% monocytes, and 21% lymphocytes), and platelets at 320,000. Blood chemistry findings showed total protein at 6.8 g/dL, albumin at 3.2 g/dL, total bilirubin at 3.2 mg/dL, direct bilirubin at 0.8 mg/dL, AST at 38 U/L, ALT at 30 U/L, LDH at 980 U/L (normal range: 120-245), ALP at 230 U/L (normal range: 115-359), urea nitrogen at 20 mg/dL, creatinine at 0.7 mg/dL, blood glucose at 90 mg/dL, Na at 142 mEq/L, K at 4.0 mEq/L, and Cl at 104 mEq/L. What are the expected test results for this patient?", "choices_en": ["Low reticulocyte count", "High cold agglutinin titer", "Positive for IgG autoantibodies", "Elevated serum haptoglobin level", "GPI anchor protein deficiency red blood cell positive"], "answer": ["b"]}
{"problem_id": "114D37", "problem_text_en": "An 8-year-old girl comes to the hospital with her parents due to abdominal pain. She has been experiencing upper abdominal pain since yesterday evening, vomited food residue in the middle of the night, and came to the hospital because the pain didn't improve this morning. Her morning bowel movement was soft and brown. The patient is conscious with a height of 120 cm, weight of 23 kg, a body temperature of 37.8°C, a pulse rate of 80/min (regular), a blood pressure of 100/72 mmHg, and a respiratory rate of 20/min. There is slight conjunctival icterus. There is no palpable thyroid nodules or cervical lymph nodes. Heart and breath sounds are normal. The abdomen is slightly swollen, but liver and spleen are not palpable. Mild tenderness is found in the upper abdomen and bowel sounds are decreased. Blood tests show red blood cells of 4.67 million/μL, Hb of 13.7 g/dL, Hct of 42%, white blood cells of 18,700/μL, platelets of 300,000/μL, and PT-INR of 1.0 (normal range 0.9-1.1). Additionally, total protein is 6.8 g/dL, total bilirubin is 4.7 mg/dL, direct bilirubin is 4.0 mg/dL, AST is 267 U/L, ALT is 270 U/L, and amylase is 539 U/L (normal range 37-160). CRP is 0.9 mg/dL. An abdominal ultrasound reveals gallbladder enlargement, and MRCP is recommended. What is the diagnosis?", "choices_en": ["Pancreatic calculi / Pancreatic stones", "Bile duct cancer", "Annular pancreas", "Congenital bile duct dilation (biliary dyskinesia, biliary hyperplasia)", "Acute obstructive suppurative cholangitis"], "answer": ["d"]}
{"problem_id": "114D38", "problem_text_en": "A 66-year-old woman presented to the clinic with a complaint of swelling in the right cheek for the past month. She had a history of surgery for chronic sinusitis on both sides 28 years ago. Aspiration of the swollen gingiva in the right maxilla yielded a viscous fluid. Head CT (A) and head MRI T1-weighted image (B) are shown separately. What is the most likely diagnosis?", "choices_en": ["Maxillary sinus cancer", "Dental maxillary sinusitis", "Fungal sinusitis", "Chronic sinusitis", "Postoperative maxillary cyst"], "answer": ["e"]}
{"problem_id": "114D39", "problem_text_en": "A one-year-old boy was brought to the clinic by his mother with complaints of fever and rash. He has had a fever of 38-39°C for four days, and his mother noticed a rash this morning. His temperature is 39.3°C with a regular pulse rate of 140 bpm. A photograph of the patient's back at the time of consultation is shown separately. There is conjunctival congestion in both eyes and erythema of the lips. Multiple 2cm lymph nodes are palpable on both sides of the neck. There is erythema and edema of the limbs. Cardiovascular and respiratory examinations are normal. Blood tests reveal red blood cells of 4.1 million, Hb of 11.7 g/dL, Ht of 36%, white blood cells of 13,600 (6% segmented neutrophils, 61% bands, 4% monocytes, 29% lymphocytes), platelets of 410,000, fibrinogen of 860 mg/dL (normal 186-355). Biochemical blood tests reveal a total protein of 6.0 g/dL, albumin of 3.0 g/dL, AST of 240 U/L, ALT of 195 U/L, and CRP of 4.2 mg/dL. No abnormal findings were noted on echocardiography. The patient is admitted for standard treatment. What finding will be used to assess the effectiveness of the treatment?", "choices_en": ["Fever", "Trunk rash", "Redness of the conjunctiva of the eye", "Swollen cervical lymph nodes", "Erythema and edema of the limbs"], "answer": ["a"]}
{"problem_id": "114D40", "problem_text_en": "A 74-year-old woman presents with palpitations. She suddenly experienced severe palpitations at around 7:00 am today. She lay down on the sofa and watched her condition, but the symptoms did not improve after 30 minutes, and she became increasingly anxious, so she sought medical attention. Her medical history includes hypertension and stenosis of the bilateral carotid arteries due to arteriosclerosis. She is alert and oriented. Her body temperature is 36.6℃. Her pulse is 168 beats per minute and regular. Her blood pressure is 132/88 mmHg. Her respiratory rate is 18 breaths per minute. Her peripheral oxygen saturation is 98% (room air). No abnormalities are noted in heart and breath sounds. An electrocardiogram shows the presence of regularly-occurring narrow QRS complexes. Which of the following is an inappropriate response?", "choices_en": ["Valsalva maneuver", "Verapamil administration", "Administration of Disopyramide", "Carotid sinus massage", "Adenosine triphosphate administration"], "answer": ["d"]}
{"problem_id": "114D41", "problem_text_en": "A 65-year-old woman presents with complaints of lower leg edema. She has had lower leg edema and mild exertional dyspnea for the past month, which hasn't improved, leading her to consult a doctor. Her temperature is 36.5℃, her pulse rate is 72 bpm and regular, and blood pressure is 110/80 mmHg. Her respiratory rate is 14 breaths per minute and her room air SpO2 is 95%. There are weak heart sounds and an early diastolic extra heart sound. There are no abnormal respiratory sounds. Significant lower leg edema is present bilaterally. CT findings of the chest (A) and right heart catheterization (B, C) are provided separately. What is the appropriate treatment option?", "choices_en": ["Beta-blockers", "Colchicine", "Pericardiectomy", "Pericardial drainage", "Transcatheter ventricular septal ablation therapy"], "answer": ["c"]}
{"problem_id": "114D42", "problem_text_en": "A 78-year-old woman presents with complaints of pain and swelling in her right knee. She visited the hospital due to sudden onset of pain and swelling in the same area 2 days ago. Her body temperature is 37.6℃. Pulse rate is 88/min and regular, blood pressure is 130/70 mmHg, respiratory rate is 14/min. Patellar tap is present in the right knee, and spontaneous pain, redness, and warmth are observed. There is no abnormality in the right knee joint simple X-ray. Urinalysis: no protein, glucose, occult blood, bacteria, or white blood cells in sediment. Blood test results: red blood cell count 4.56 million, Hb 12.6 g/dL, Ht 41%, white blood cell count 12,300 (segmented neutrophils 76%, eosinophils 2%, basophils 1%, monocytes 8%, lymphocytes 13%), platelet count 160,000. Blood biochemistry results: total protein 6.8 g/dL, albumin 3.2 g/dL, total bilirubin 1.0 mg/dL, AST 20 U/L, ALT 15 U/L, LD 220 U/L (normal range 120-245), ALP 290 U/L (normal range 115-359), blood urea nitrogen 20 mg/dL, creatinine 0.9 mg/dL, uric acid 4.7 mg/dL, blood glucose 112 mg/dL, CRP 8.6 mg/dL. What is the next appropriate step?", "choices_en": ["Joint fluid examination", "Knee joint arthrography CT", "Lower limb immobilization with a plaster cast", "Intravenous drip of broad-spectrum antibiotics", "Intra-articular administration of adrenal cortex steroids"], "answer": ["a"]}
{"problem_id": "114D43", "problem_text_en": "A 63-year-old woman presents with complaints of headache and behavioral changes. She started experiencing morning headaches three months ago and gradually developed nausea, which led her to seek medical attention. Her family noticed abnormalities such as forgetting appointments and having difficulty dressing herself two months ago. Her level of consciousness is JCS I-2. Her pulse is 68 beats per minute and regular, and her blood pressure is 142/88 mmHg. Neurological examination revealed left hemiparesis. Head MRI images (A) are provided separately. After admission, she underwent surgery to remove the tumor, and a H&E stained specimen of the lesion is displayed separately (B). What is the diagnosis?", "choices_en": ["Glioblastoma", "Meningioma", "Brain abscess", "Malignant lymphoma", "Multiple sclerosis"], "answer": ["a"]}
{"problem_id": "114D44", "problem_text_en": "A 20-year-old woman presents with a complaint of right chest pain. She developed sudden right chest pain and dyspnea yesterday evening and the symptoms worsened today, leading her to seek medical attention. Her respiratory rate is 22 breaths per minute. Her SpO2 is 95% on room air. Breath sounds are decreased over the right chest compared to the left. A chest x-ray is shown separately. What is the next test that should be performed?", "choices_en": ["Thoracic CT", "Sputum cytology", "Stress electrocardiogram (ECG)", "Bronchoscopy exam.", "Respiratory function test."], "answer": ["a"]}
{"problem_id": "114D45", "problem_text_en": "A 50-year-old man was transferred to our hospital complaining of right lower abdominal pain. He had experienced right lower abdominal pain and fever while working at sea 7 days ago and visited a hospital at his port of call. He was diagnosed with acute appendicitis and admitted to the hospital. He received intravenous fluid and antibiotic therapy via a peripheral intravenous line under fasting, and his fever subsided, and his lower abdominal pain improved on the third day of hospitalization. He wished to receive treatment near his home and was referred to our hospital. He was alert and his height was 173 cm, weight 70 kg, and body temperature 36.2°C. His abdomen was flat, soft, and showed no signs of tenderness. Bowel sounds were normal. Laboratory findings: red blood cells 4.86 million, Hb 14.8 g/dL, Ht 43%, WBC 6,400, platelets 210,000. Biochemical findings: total protein 6.4 g/dL, albumin 3.2 g/dL, total bilirubin 0.7 mg/dL, AST 14 U/L, ALT 14 U/L, blood urea nitrogen 19 mg/dL, creatinine 0.8 mg/dL, and CRP 0.8 mg/dL. He had passed gas and stool after transfer. What should be done next?", "choices_en": ["Initiation of oral feeding", "Appendectomy", "Right hemicolectomy", "Abscess drainage", "Surgical ileus release surgery"], "answer": ["a"]}
{"problem_id": "114D46", "problem_text_en": "An 89-year-old woman was brought in by ambulance due to abdominal pain and fever. She had been experiencing dull upper abdominal pain and loss of appetite for 5 days, and her family requested an ambulance this morning when she developed a fever. Her consciousness level is JCS I-2. Her body temperature is 38.8°C. Her heart rate is 108/min and regular. Her blood pressure is 94/60 mmHg. Her respiratory rate is 24/min. Her SpO2 is 96% (on 3 L/min oxygen via nasal cannula). Mild conjunctival yellowing is observed. Her abdomen is flat, and she has mild tenderness in the right hypochondriac region. Blood tests show a red blood cell count of 3.53 million, Hb of 10.4 g/dL, Ht of 31%, white blood cell count of 13,600, and platelet count of 200,000. Biochemical blood tests show total protein of 6.6 g/dL, albumin of 3.5 g/dL, total bilirubin of 4.1 mg/dL, direct bilirubin of 3.2 mg/dL, AST of 889 U/L, ALT of 459 U/L, ALP of 1,299 U/L (normal range: 115-359), γ-GT of 188 U/L (normal range: 8-50), blood urea nitrogen of 28 mg/dL, creatinine of 1.0 mg/dL, and blood glucose level of 122 mg/dL. Her CRP level is 7.1 mg/dL. Abdominal contrast-enhanced CT images (A, B) are shown separately. What is the most likely condition?", "choices_en": ["Acute hepatitis", "Cholecystitis with cholelithiasis", "Peritonitis", "Mirizzi syndrome", "Acute obstructive suppurative cholangitis"], "answer": ["e"]}
{"problem_id": "114D47", "problem_text_en": "A 72-year-old woman comes to the clinic with her eldest daughter, reporting visual hallucinations. A week ago, she called her daughter and said that her grandchild who had been at their house suddenly disappeared. According to the daughter, however, the grandchild had never come over. The patient said she saw the grandchild sitting in the living room quietly as if studying hard, so she didn't disturb him. She said she saw the grandchild walking around the house, but when she called out to him, he disappeared. Her daughter noticed that the patient talked in her sleep and sometimes laughed during the night when she stayed at her house a few years ago. The patient often said that she was dreaming. She had a slow movement, noticeable for about six months. During the consultation, the patient showed natural expression and maintained politeness, and her sense of time and place was not impaired. There were no abnormalities found in her blood tests and brain waves. An MRI of her head showed mild cerebral atrophy but no other abnormalities were detected. What is the most likely condition?", "choices_en": ["Delusional disorder", "Vascular dementia", "Frontotemporal dementia", "Lewy body dementia", "Alzheimer's type dementia"], "answer": ["d"]}
{"problem_id": "114D48", "problem_text_en": "A 62-year-old woman presents to the clinic with proteinuria and renal dysfunction. She has been receiving chemotherapy including cisplatin for lung cancer for the past 4 months. At the beginning of treatment, her proteinuria was negative and serum creatinine was 0.8 mg/dL. Yesterday, proteinuria and renal dysfunction were detected during outpatient examination, leading to referral and subsequent visit. The patient is conscious and alert. She is 158 cm in height and weighs 54 kg. Her pulse rate is 68 beats/min and regular. Her blood pressure is 134/74 mmHg. Her heart sounds and breath sounds are normal. Her abdomen is flat and soft, with no palpable liver or spleen. Urinalysis shows a specific gravity of 1.014, 1+ for protein, 2+ for glucose, 1+ for occult blood, and 5-9 red blood cells per high-power field on microscopic examination. The patient's daily urine volume is 1,200 mL, and her urine protein excretion is 1.1 g/day. Her urinary β2-microglobulin level is 54,630 μg/L (reference range: <=200 μg/L). Blood tests show a red blood cell count of 3.08 million/μL, hemoglobin level of 10.8 g/dL, hematocrit of 32%, white blood cell count of 4,000/μL, and platelet count of 140,000/μL. Biochemical blood tests show a total protein level of 6.4 g/dL, albumin level of 3.5 g/dL, AST level of 16 U/L, ALT level of 11 U/L, ALP level of 489 U/L (reference range: 115-359 U/L), γ-GT level of 16 U/L (reference range: 8-50 U/L), BUN level of 24 mg/dL, creatinine level of 1.3 mg/dL, uric acid level of 1.8 mg/dL, glucose level of 84 mg/dL, HbA1c level of 5.2% (reference range: 4.6-6.2%), Na level of 142 mEq/L, K level of 3.3 mEq/L, Cl level of 120 mEq/L, Ca level of 7.8 mg/dL, and P level of 1.2 mg/dL. Arterial blood gas analysis (room air) shows a pH of 7.30, PaCO2 of 30 Torr, PaO2 of 98 Torr, and HCO3- of 15 mEq/L. What is the most likely condition the patient is experiencing?", "choices_en": ["Nephrogenic diabetes insipidus", "Liddle syndrome", "Bartter syndrome", "Fanconi syndrome", "Gitelman syndrome"], "answer": ["d"]}
{"problem_id": "114D49", "problem_text_en": "A 48-year-old woman came to a medical institution after an abnormality was detected in her stomach during an upper gastrointestinal series exam for gastric cancer screening. She had no symptoms and was not taking any medication. A separately provided image from the upper gastrointestinal endoscopy performed after her visit is shown. What is the appropriate course of action?", "choices_en": ["Follow-up examination after 1 year", "Proton pump inhibitor administration", "Eradication of Helicobacter pylori", "Endoscopic polyp removal surgery", "Gastrectomy"], "answer": ["a"]}
{"problem_id": "114D50", "problem_text_en": "A 74-year-old female patient complains of difficulty swallowing and visited the hospital. She had occasionally felt a choking sensation in her chest for the past 6 months. On an upper gastrointestinal endoscopy 3 months ago, she was diagnosed with reflux esophagitis and prescribed medication. However, the symptoms persisted, and she revisited the clinic two weeks ago because she was having difficulty eating. She has Hashimoto's disease, hypertension, osteoporosis, and insomnia and is receiving medical treatment. Her height is 156 cm, weight is 45 kg, pulse rate is 76 bpm and regular, and blood pressure is 140/86 mmHg. There are no abnormalities in the conjunctiva or eyeballs. There are no abnormalities in heart sounds or respiratory sounds. The abdomen is flat and soft, and the liver and spleen are not palpable. Which of the medications she is taking is expected to improve the symptoms if discontinued?", "choices_en": ["Thyroid hormone", "Proton pump inhibitor", "Oral bisphosphonate medication", "Benzodiazepine sleeping pills", "Angiotensin-converting enzyme (ACE) inhibitor"], "answer": ["c"]}
{"problem_id": "114D51", "problem_text_en": "A 70-year-old female patient presents with a complaint of fever and a neck lump. She was diagnosed with rheumatoid arthritis 8 years ago and has been on prednisolone, methotrexate, and NSAIDs. She visited the clinic because she had been running a fever without an identifiable cause for a week. Physical examination shows a height of 155 cm and a weight of 43 kg, a body temperature of 38.4 ℃, a pulse rate of 104 beats per minute and blood pressure of 120/80 mmHg, and a respiratory rate of 20 breaths per minute. There is no enlargement of the tonsils. One lymph node with a diameter of 2 cm and without tenderness is palpable in both cervical regions and both axillae. No abnormalities are found in heart and lung sounds. The abdomen is flat, soft and there is no palpable liver or spleen, and no swelling or tenderness in joints. Blood test results: red blood cell count of 3.15 million, hemoglobin level of 10.2 g/dL, hematocrit of 32%, white blood cell count of 2,800 (neutrophils: 36%, bands: 44%, eosinophils: 2%, basophils: 1%, monocytes: 8%, and lymphocytes: 9%), and platelet count of 120,000. Blood biochemistry findings: total protein level of 6.6 g/dL, albumin level of 3.3 g/dL, AST level of 35 U/L, ALT level of 23 U/L, and LD level of 780 U/L (reference range: 120-245). Immunology findings: CRP level of 2.2 mg/dL, negative ANA test result, soluble IL-2 receptor level of 952 U/mL (reference range: 157-474), and negative measurement for interferon-gamma release assay (IGRA) specific to tuberculosis. Contrast-enhanced CT scan shows multiple lymph node enlargements in the mediastinum and mesentery. What should be the first response?", "choices_en": ["Discontinuation of NSAIDs", "Addition of JAK inhibitor", "Addition of anti-TNF-α antibodies", "Discontinuation of prednisolone", "Discontinuation of methotrexate"], "answer": ["e"]}
{"problem_id": "114D52", "problem_text_en": "An 80-year-old woman presented complaining of right upper abdominal pain, weight loss, and jaundice. She had been experiencing mild nausea after eating for a year. For the past three months, she had been avoiding her favorite tempura due to right upper abdominal pain after eating. She visited the hospital because she had lost weight for a month and her family pointed out the jaundice of her skin. Her height was 145 cm, weight was 38 kg, body temperature was 36.7°C, and blood pressure was 114/70 mmHg. Her pulse rate was 92/min and regular, and respiratory rate was 14/min. Her palpebral conjunctiva appeared slightly anemic, and there was jaundice in her bulbar conjunctiva. Heart and lung sounds were normal. Her abdomen was flat, with tenderness and a 3-cm palpable mass moving in response to respiration, extending from the epigastric region to the right lower rib. Urine examination showed protein (-), sugar (-), urobilinogen (-), occult blood (-), and bilirubin 1+. Fecal occult blood test was negative. Blood test showed red blood cell count 3.54 million, hemoglobin 10.9 g/dL, hematocrit 34%, white blood cell count 6,700, and platelets 140,000. Biochemical blood test showed total protein 5.8 g/dL, albumin 3.1 g/dL, total bilirubin 4.8 mg/dL, AST 76 U/L, ALT 65 U/L, LD 759 U/L (normal range 120-245), γ-GTP 145 U/L (normal range 8-50), amylase 134 U/L (normal range 37-160), blood urea nitrogen 19 mg/dL, creatinine 0.7 mg/dL, blood glucose 118 mg/dL, Na 138 mEq/L, K 4.0 mEq/L, Cl 100 mEq/L, CEA 6.7 ng/mL (normal range < 5), and CA19-9 89 U/mL (normal range < 37). CRP was 0.4 mg/dL. The chest and abdominal X-ray did not show any abnormalities. Abdominal ultrasound examination revealed dilation of the intrahepatic bile ducts on both sides and interruption of the common bile duct. Which of the following tests should be performed next?", "choices_en": ["Abdominal contrast-enhanced CT", "Endoscopic ultrasound", "Lower gastrointestinal endoscopy", "Upper gastrointestinal endoscopy", "Endoscopic retrograde cholangiopancreatography (ERCP)"], "answer": ["a"]}
{"problem_id": "114D53", "problem_text_en": "A 64-year-old man presented with numbness in his right leg and weight loss. He had been experiencing decreased appetite and numbness in his right leg for a month, and had lost 3 kg of weight, so he came to the hospital. On a health check-up 6 months ago, high blood sugar was noted for the first time, but there were no indications of kidney impairment. He was 170 cm tall and weighed 58 kg, had a body temperature of 37.0℃, a pulse rate of 92 beats per minute, and a normal blood pressure of 148/86 mmHg. There were no abnormalities in heart or breath sounds or in the calf, where no swelling or purpura was observed. Urinalysis showed 3+ protein, (-) glucose, 2+ occult blood, 30-49/high-powered field (HPF) red blood cells, and 1-4/HPF granular casts. Blood tests revealed 3.11 million red blood cells, an Hb of 9.5 g/dL, an Ht of 29%, 9,500 white blood cells (63% segmented neutrophils, 4% eosinophils, 1% basophils, 7% monocytes, 25% lymphocytes), and 240,000 platelets. Blood chemistry tests revealed a total protein of 6.8 g/dL, albumin of 3.0 g/dL, blood urea nitrogen of 69 mg/dL, creatinine of 4.3 mg/dL, blood glucose of 122 mg/dL, HbA1c of 6.3% (reference range: 4.6-6.2%), total cholesterol of 266 mg/dL, triglycerides of 160 mg/dL, Na of 140 mEq/L, K of 6.0 mEq/L, Cl of 110 mEq/L, Ca of 8.6 mg/dL, and P of 5.0 mg/dL. Immunoserology tests results were CRP of 3.5 mg/dL, and CH50 of 54 U/mL (reference range: 30-40). A separate PAS-stained specimen of the kidney biopsy is shown. What is the most likely condition?", "choices_en": ["Diabetic nephropathy", "Malignant nephrosclerosis", "Microscopic polyangiitis", "Acute post-infectious glomerulonephritis", "Cholesterol embolism syndrome"], "answer": ["c"]}
{"problem_id": "114D54", "problem_text_en": "A 67-year-old man presents with left eye pain and visual impairment as his main complaints. He reports that 7 days ago, while pruning a plant, a branch hit his left eye. Since the next day, he has noticed left eye pain and visual impairment, which gradually worsened. A photo of the anterior segment of the left eye is provided separately. His left eye visual acuity is hand motion in front of the eye. Intraocular pressure is 16 mmHg in the right eye and 18 mmHg in the left eye. What is the part of the eye where the lesion initially occurred?", "choices_en": ["Conjunctiva", "Cornea", "Anterior chamber", "Iris", "Crystalline lens"], "answer": ["b"]}
{"problem_id": "114D55", "problem_text_en": "A newborn with 0 days of age was diagnosed with fetal growth restriction from 31 weeks of gestation. At a gestational age of 38 weeks, the baby was born with a weight of 1,890g and was admitted to the Neonatal Intensive Care Unit (NICU) due to low birth weight. Although the crying was weak, the baby had to be placed in an incubator and given oxygen due to repeated episodes of apnea. The baby's characteristic facial features included small eyes, a small mouth, and a small lower jaw. Additionally, overlapping fingers, flexion contractures, and chair-like soles of the feet were observed. There was hypertonia throughout the body. Which of the following conditions best matches the symptoms of this infant?", "choices_en": ["The prognosis is good.", "Causes developmental delay.", "Heart disease is less likely to be complicated.", "Prone to developing acute leukemia.", "Characterized by high-pitched crying."], "answer": ["b"]}
{"problem_id": "114D56", "problem_text_en": "A 42-year-old man presents with wheezing as his chief complaint. He developed bronchial asthma in early childhood, but had been asymptomatic without any asthma attacks since the age of 12. However, he recently started experiencing attacks again and came for medical attention. He has no history of allergic rhinitis. He was treated with inhaled corticosteroids, inhaled long-acting beta2-agonists, inhaled long-acting anticholinergics, leukotriene receptor antagonists, and sustained-release theophylline, and his symptoms have recently improved, with consideration of reducing medication. Laboratory tests show RBC count of 4.3 million, Hb of 14.5 g/dL, WBC count of 7,800 (segmented neutrophils 63%, eosinophils 10%, basophils 1%, monocytes 5%, lymphocytes 21%), and platelet count of 250,000. All specific IgE antibodies were negative. Which of the following drugs should not be discontinued as part of his treatment plan?", "choices_en": ["Theophylline sustained-release agent", "Inhaled corticosteroids", "Long-acting inhaled beta2 agonist", "Long-acting inhaled anticholinergic drug.", "Leukotriene receptor antagonist"], "answer": ["b"]}
{"problem_id": "114D57", "problem_text_en": "A 65-year-old woman presented with fever and chills as her chief complaints. Her consciousness level was JCS II-10, and she was 155 cm in height and weighed 68 kg. Her body temperature was 38.8℃, and her pulse was 96 bpm, regular. Her blood pressure was 92/52 mmHg, and her respiratory rate was 28 breaths/min. Her abdomen was flat and soft without palpable liver or spleen. Right costovertebral angle tenderness was noted. Her urine test revealed 1+ protein, negative glucose and ketones, and 1+ occult blood. Microscopic examination of the sediment showed 10-50 red blood cells and 50-99 white blood cells per high-power field. Her blood test revealed 4.34 million red blood cells, a hemoglobin level of 11.8 g/dL, a hematocrit level of 37%, and a white blood cell count of 2,200 per cubic millimeter, with a platelet count of 220,000 per cubic millimeter. The results of her blood chemistry test revealed a total protein level of 6.5 g/dL, an albumin level of 2.8 g/dL, AST level of 19 U/L, ALT level of 19 U/L, a blood urea nitrogen level of 12 mg/dL, and a creatinine level of 0.8 mg/dL. The CRP level was 21 mg/dL. Blood and urine samples for cultures were obtained, and she was treated with intravenous fluids, but her blood pressure did not improve. Administration of catecholamines and antibiotics was started. Abdominal CT (A, B) was performed. What is the immediate treatment that should be performed?", "choices_en": ["Urethrotomy", "Creation of a vesicointestinal fistula/vesicostomy/bladder fistula.", "Transurethral ureterolithotripsy", "Ureteral stent placement procedure", "Extracorporeal shock wave lithotripsy (ESWL)"], "answer": ["d"]}
{"problem_id": "114D58", "problem_text_en": "A neonate with zero days of age was born to a mother with Graves' disease, taking anti-thyroid medication, and with positive anti-thyroid antibodies. What is the most important consideration during the neonatal period?", "choices_en": ["Blood pressure", "Urinary output/volume", "Respiratory rate", "Heart rate", "Arterial oxygen saturation"], "answer": ["d"]}
{"problem_id": "114D59", "problem_text_en": "A 65-year-old woman presents to the hospital with a complaint of chest pain. She had been aware of right chest pain for the past month, which had not improved, prompting her to seek medical attention. She had a history of right breast cancer and underwent surgery 13 years ago. She has been working in the construction industry for 30 years. Breath sounds were weakened in the right lower chest, and dullness was heard in the right dorsal side upon percussion of the chest. Chest X-ray (A), chest contrast-enhanced CT (B), and FDG-PET/CT (C) are shown separately. Results of the thoracoscopic biopsy showed the presence of malignant cells staining positive for calretinin immunohistochemical staining. Which test showed abnormal results in this patient?", "choices_en": ["Hyaluronic acid in pleural effusion", "Triglycerides in pleural effusion", "Serum alpha-fetoprotein (AFP)", "Adenosine deaminase in pleural effusion (ADA)", "Serum angiotensin converting enzyme (ACE)"], "answer": ["a"]}
{"problem_id": "114D60", "problem_text_en": "A 20-year-old man, accompanied by his parents due to concerns about his abnormal behavior, seeks medical attention. He has been living alone in an apartment since entering university 2 years ago. He went home a month ago because he felt unwell and has since spent most of his time locked in his room. He complains that \"what is happening to him is broadcasted on television every day,\" \"TV cast members send secret messages to him that only he can understand,\" and \"people around him are talking behind his back.\" He has started shouting at the neighboring house at night. He was brought to a psychiatric clinic by his parents. During the examination, he has a flat affect and avoids eye contact. He answers questions in a short, low voice. He did not have any developmental or adjustment problems before entering university. Blood tests, head MRI, and EEG are all normal. Which of the following would be an appropriate medication for treatment?", "choices_en": ["Imipramine", "Lithium carbonate", "Phenytoin", "Risperidone", "Carbamazepine"], "answer": ["d"]}
{"problem_id": "114D61", "problem_text_en": "A 60-year-old man came to the hospital with a chief complaint of a lump in the right submandibular area. He noticed it while washing his face a month ago but had left it alone because it wasn't painful. A soft lump can be felt in the lower part of the right parotid gland. Fine-needle aspiration cytology revealed a cystic background with a cluster of epithelial cells showing eosinophilic cytoplasm. An MRI of the neck was also shown. Accumulation was observed in the lesion area on a 99mTcO4- salivary gland scintigraphy. What is the diagnosis?", "choices_en": ["Parotid gland cancer", "Cervical vascular malformation", "Warthin tumor (a type of salivary gland tumor)", "IgG4-related disease", "Parotid gland pleomorphic adenoma"], "answer": ["c"]}
{"problem_id": "114D62", "problem_text_en": "A 78-year-old woman presented with a complaint of a rash on her face. She had developed a rash in her right inner canthus four years ago that gradually increased in size, prompting her to seek medical attention. On examination, a scaly irregular erythematous plaque with scaling at its center was noted in the right inner canthus. A skin biopsy was taken from the center of the plaque. Photos of the face (A) and pathological tissue image from the biopsy (B) are separately provided. What is observed to be the proliferation of atypical keratinocytes?", "choices_en": ["Stratum corneum", "Clear layer", "Granule cell layer", "Stratum spinosum", "Basal layer"], "answer": ["e"]}
{"problem_id": "114D63", "problem_text_en": "A 65-year-old woman has been diagnosed with stage IB lung cancer in the right lung. She underwent a procedure to remove the right lower lobe and lymph nodes affected by cancer. On the first day after the surgery, which included meals, she developed a milky white pleural effusion of 860mL, which was subsequently drained. Which test should be performed to determine the definitive diagnosis of the pleural effusion?", "choices_en": ["Protein", "Bacteria", "Triglyceride.", "悪性細胞 (akusei saibou)", "白血球"], "answer": ["c"]}
{"problem_id": "114D64", "problem_text_en": "A 57-year-old woman presents to the clinic with complaints of abnormal vaginal bleeding. She had menopause at 54 years of age. She has had intermittent vaginal bleeding for 6 months, which has become continuous for the past month. She was diagnosed with endometrial cancer after undergoing an endometrial biopsy at a clinic near her home. She is 155 cm tall, weighs 80 kg, and blood tests reveal mild anemia but no other abnormalities. Imaging tests show no progression or metastasis outside the uterus. A T2-weighted sagittal MRI image of the pelvis is shown separately. Which treatment is appropriate for this patient?", "choices_en": ["Surgical excision", "Radiation exposure", "Administration of bactericidal drugs", "Administration of molecular targeted drugs", "Hormone medication administration"], "answer": ["a"]}
{"problem_id": "114D65", "problem_text_en": "A 60-year-old woman presents with a lump in her right breast. A mass of 3 cm in diameter is palpated on physical examination of the right breast. Mammograms of both breasts are shown separately. Which of the following is the most appropriate initial test to perform?", "choices_en": ["Positron emission tomography/computed tomography (PET/CT)", "Contrast-enhanced CT scan", "Contrast-enhanced MRI (Magnetic Resonance Imaging)", "Breast duct imaging test (also known as galactography)", "Ultrasound-guided needle biopsy"], "answer": ["e"]}
{"problem_id": "114D66", "problem_text_en": "A 73-year-old woman presented with complaints of lower back pain. She had been experiencing lower back pain for a year, which had gradually worsened over the past three months. Her face was pale and her conjunctivas showed signs of anemia, but no jaundice was observed. Her abdomen was flat, soft and non-tender, and liver and spleen were not palpable. No superficial lymph nodes were palpable. Urine examination showed 1+ protein. Blood test results revealed 3 million red blood cells, a hemoglobin level of 8.1 g/dL, 4,400 leukocytes and 220,000 platelets. The blood biochemistry test showed total protein 10.1 g/dL, albumin 2.9 g/dL, IgG 5,475 mg/dL (range: 960 to 1,960), IgA 36 mg/dL (range: 110 to 410), and IgM 22 mg/dL (range: 65 to 350). Total bilirubin was 1.4 mg/dL, AST was 52 U/L, ALT was 45 U/L, blood urea nitrogen was 30 mg/dL, creatinine was 1.5 mg/dL, blood sugar was 124 mg/dL, Na was 140 mEq/L, K was 4.1 mEq/L, Cl was 108 mEq/L, and Ca was 8.8 mg/dL. What are the two necessary diagnostic examinations?", "choices_en": ["Bone marrow aspiration", "Ham test", "Abdominal contrast-enhanced CT", "Protein leak test", "Serum protein immunoelectrophoresis."], "answer": ["a", "e"]}
{"problem_id": "114D67", "problem_text_en": "A 79-year-old man visited the hospital complaining of fever, cough, and difficulty breathing. He reported loss of appetite, fever, cough, and phlegm for the past three days, and said that he could not sleep due to breathing difficulties the previous night. He was fully conscious with a body temperature of 38.5°C, a pulse rate of 108 beats/min (regular), blood pressure of 96/54 mmHg, a respiratory rate of 32 breaths/min, and an SpO2 of 91% on room air. Coarse crackles were heard on the left side of his chest, and chest radiography showed opacification in the left lower lung field. He was started on oxygen therapy and intravenous infusion of normal saline. Which of the following tests will be performed first to determine the treatment plan? Select two.", "choices_en": ["Blood culture", "Sputum Gram staining", "Sputum Grocott staining", "Aspergillus antigen in blood", "Cytomegalovirus antigen in the blood"], "answer": ["a", "b"]}
{"problem_id": "114D68", "problem_text_en": "A male neonate at 3 days of age was born by suction delivery due to prolonged labor at 38 weeks and 2 days of gestation, weighing 2,648 g. He had a postnatal head tumor and was admitted to the NICU due to lethargy, increasing head tumor size, and pallor. He was conscious and had a height of 48.5 cm, weight of 2,648 g, and body temperature of 36.2℃. His heart rate was 148/min, regular, and blood pressure was 48/20 mmHg. His respiratory rate was 58/min, and SpO2 was 96% (room air). Soft tumors, 4 cm in diameter, were palpable in both dorsal and occipital regions of the head. No abnormalities were detected in heart and breath sounds. His abdomen was flat, soft, and non-tender, with no palpable liver or spleen. Blood test results showed hemoglobin level of 6.8 g/dL, hematocrit of 18%, and platelet count of 200,000/mm3. His PT-INR was 1.1 (normal range 0.9-1.1), APTT was 122 seconds (normal range 27-40), and fibrinogen level was 262 mg/dL (normal range 130-380). A coronal view of a head CT is shown separately. Which of the following possibilities may cause the decreased activity in this patient? Select two.", "choices_en": ["Factor VII", "Factor VIII", "Factor IX", "Factor X", "Factor XIII"], "answer": ["b", "c"]}
{"problem_id": "114D69", "problem_text_en": "A 65-year-old woman underwent lumbar fixation surgery in a prone position yesterday. This morning, the nurse changed her bed to a sitting position for breakfast when suddenly the patient complained of dyspnea and chest pain, which led to a decreased level of consciousness. The patient was intubated and transferred to the ICU where mechanical ventilation was initiated. The patient is 152 cm tall and weighs 70 kg. Her heart rate is 130 beats per minute and regular. Blood pressure is 80/40 mmHg. Laboratory tests reveal: red blood cells, 3.52 million/μL; hemoglobin, 10.4 g/dL; hematocrit, 32%; white blood cells, 10,400/μL; platelets, 160,000/μL; PT-INR, 1.1 (control, 0.9-1.1); APTT, 31.5 seconds (control, 32.2 seconds); D-dimer, 30.6 μg/mL (control, ≤ 1.0 μg/mL); total protein, 5.0 g/dL; albumin, 2.8 g/dL; AST, 80 U/L; ALT, 56 U/L; LD, 276 U/L (control, 120-245 U/L); γ-GT, 85 U/L (control, 8-50 U/L); CK, 30 U/L (control, 30-140 U/L); BUN, 10 mg/dL; creatinine, 0.6 mg/dL. CRP was 0.8 mg/dL. The troponin T was negative. The electrocardiogram showed atrial fibrillation. Chest X-ray showed no significant abnormal shadows in the lungs. What are the two necessary tests for a definitive diagnosis?", "choices_en": ["Head MRI", "Coronary angiography.", "Chest contrast-enhanced CT scan", "Echocardiography", "FDG-PET/CT"], "answer": ["c", "d"]}
{"problem_id": "114D70", "problem_text_en": "A 7-year-old boy is brought to the clinic by his grandmother with the chief complaint of a rash on his trunk. The boy developed a few skin lesions on his trunk yesterday, and because the rash has increased, he has come for medical attention. On examination, the body temperature is 36.5°C, the pulse is 80 beats/minute, and the respiration rate is 20 breaths/minute. The patient has mainly vesicular rash on his trunk. There is no abnormality in the conjunctivae and eyeball conjunctivae. No redness is observed in the throat. No lymph nodes are palpable in the neck. No abnormalities are detected in heart and lung sounds. The abdomen is flat, soft, and neither the liver nor spleen are palpable. A photo of the boy's trunk is included separately. Which of the following are important items for medical interview? Select two.", "choices_en": ["Conditions at birth", "Growth and development status", "Status of urination and defecation", "Vaccination status / Vaccination history", "Epidemic situation of surrounding infectious diseases"], "answer": ["d", "e"]}
{"problem_id": "114D71", "problem_text_en": "An 80-year-old woman was found collapsed in her room this morning by her family members and was brought into the hospital by ambulance. She had a fever of 38℃, nasal discharge, and sore throat a week ago, but no medical attention was sought as she was still able to eat. She had also taken her oral hypoglycemic drug for type 2 diabetes which she had been on for 30 years. She had her dinner the night before and went to bed, but did not wake up in the morning which prompted her family to check on her and found her collapsed in her room. Upon arrival in the hospital, her consciousness level was JCS III-100. She was 152 cm tall, weighed 42 kg, and had a body temperature of 37.8℃. Her heart rate was 104 beats per minute and regular, blood pressure was 88/46 mmHg, and respiratory rate was 18 per minute. She had left-sided hemiplegia and right lower limb spasm. Her skin and oral mucosa were quite dry. Urinalysis showed protein (±), glucose 4+, and no ketones. Blood chemistry showed blood urea nitrogen at 60 mg/dL, creatinine at 2.4 mg/dL, blood glucose at 1,160 mg/dL, HbA1c at 6.6% (normal range 4.6-6.2%), sodium at 156 mEq/L, potassium at 4.0 mEq/L, and chloride at 116 mEq/L. Which of the following should be immediately administered via intravenous injection? Select two.", "choices_en": ["Insulin", "Thrombolytic agent (medication used to dissolve blood clots)", "Physiological saline", "Anticonvulsant medication", "7% sodium bicarbonate"], "answer": ["a", "c"]}
{"problem_id": "114D72", "problem_text_en": "A 28-year-old female patient presented with a complaint of fever and left anterior chest pain. She had a sore throat and had been experiencing a fever of around 37.5℃, which was treated with over-the-counter cold medicine. Since yesterday, she has experienced persistent pain in the left anterior chest, which worsens with deep breathing. There is no significant medical or family history. Her body temperature is 37.5℃. Her pulse rate is 100 beats/minute and regular. Her blood pressure is 112/60 mmHg. Her respiratory rate is 20 breaths/minute. Her SpO2 is 97% (room air). A pericardial friction rub is audible from heart sounds. Dullness is found on percussion and a decrease in breath sounds on auscultation is detected in the left lower chest. Her abdomen is flat and soft, and no liver or spleen enlargement is palpable. What should be done at this point? Select three.", "choices_en": ["Electrocardiogram (ECG/EKG)", "Respiratory function test", "Echocardiography exam", "Chest X-ray examination", "Treadmill exercise stress test (TMT) electrocardiogram (ECG)"], "answer": ["a", "c", "d"]}
{"problem_id": "114D73", "problem_text_en": "An 83-year-old man fell from a height of 3 meters while working and was brought to the hospital by ambulance due to back pain and difficulty breathing. Chest CT images (A-C) after chest drainage are shown separately. Which of the following findings are observed on the images? Select three.", "choices_en": ["Pneumothorax", "Pulmonary contusion", "Tracheal rupture", "Mediastinal emphysema", "Rib fracture."], "answer": ["a", "b", "e"]}
{"problem_id": "114D74", "problem_text_en": "A 5-year-old boy was brought to the hospital by his grandfather with complaints of fever and bloody diarrhea. Two days ago, he developed fever and frequent diarrhea, and today he visited the hospital because of blood in his stool. He ate beef, pork, and chicken with family at a barbecue 3 days ago. He is conscious and alert, with a height of 110 cm and a weight of 18 kg. His body temperature is 39.2 °C, pulse rate is 132/min and regular. His blood pressure is 100/66 mmHg, respiratory rate is 24/min, and SpO2 on room air is 98%. There are no abnormal heart sounds or breath sounds. The abdomen is flat, soft, and non-tender, with no palpable liver or spleen. Mild spontaneous pain and tenderness are observed throughout the abdomen. Which of the following microorganisms is the most likely cause? Select three.\n", "choices_en": ["Escherichia coli", "Helicobacter pylori (a type of bacteria commonly associated with stomach ulcers)", "Campylobacter jejuni", "Pseudomonas aeruginosa", "Salmonella spp. (Salmonella species of bacteria)"], "answer": ["a", "c", "e"]}
{"problem_id": "114D75", "problem_text_en": "This is the result of arterial blood gas analysis under oxygen administration (FIO2 0.28): pH 7.38, PaCO2 36 Torr, PaO2 58 Torr, HCO3- 21.2 mEq/L. Calculate the alveolar-arterial oxygen tension difference (A-aDO2). Assume atmospheric pressure is 760 Torr, saturated vapor pressure at 37℃ is 47 Torr, and respiratory exchange ratio is 0.8. If a numerical value with decimal places is obtained, round to the first decimal place. Answer: ①② Torr.", "choices_en": [], "answer": ["97"]}
