{"problem_id": "114E1", "problem_text_en": "Which of the following is appropriate for making decisions about medical care and care at the end of life?", "choices_en": ["If the patient's own will cannot be confirmed, follow the family's wishes.", "If the patient's intentions can be confirmed, respect the patient's wishes.", "When the patient has dementia, it is judged that the patient's own intention cannot be confirmed.", "Judgment of the patient's decision-making ability requires examination by a psychiatrist.", "If the opinions of the patient's spouse and biological children are in conflict, the opinion of the spouse should be given priority."], "answer": ["b"]}
{"problem_id": "114E2", "problem_text_en": "What is the correct method for performing a surgical procedure on a patient under local anesthesia?", "choices_en": ["An 18G needle is used to inject the anesthesia.", "Disinfect within an area smaller than the hole in the sterilized sheet.", "Perform treatment immediately after applying povidone-iodine.", "After injecting the anesthesia, confirm the presence of pain before proceeding with the procedure.", "Insert the needle and confirm the presence of blood reflux before injecting the anesthetic."], "answer": ["d"]}
{"problem_id": "114E3", "problem_text_en": "Which of the following statements is correct regarding community health?", "choices_en": ["The entity responsible for implementing immunizations is the board of education.", "Local hygiene institutes primarily perform interpersonal services.", "The entity responsible for establishing Regional Comprehensive Support Centers is the prefecture.", "The tasks of the Medical Safety Support Center are regulated by the Medical Law.", "A physician must always be stationed at regional health centers."], "answer": ["d"]}
{"problem_id": "114E4", "problem_text_en": "Which of the following statements from a physician during a medical interview is not appropriate for a patient who continues to feel anxious despite being told that no abnormalities were found in other medical institutions?", "choices_en": ["\"Please tell me how you feel.\"", "\"What illness are you concerned about?\"", "\"It seems that you are still anxious even though you were told that there are no abnormalities.\"", "\"I think there might be a problem with your personality as you tend to worry too much.\"", "\"You must be anxious, but you're doing a great job.\""], "answer": ["d"]}
{"problem_id": "114E5", "problem_text_en": "In the eye examination of a patient with impaired consciousness, which finding has the highest urgency?", "choices_en": ["Eye discharge", "Ala nasi (wing of nose)", "Subconjunctival hemorrhage", "Conjunctival injection of eyelids", "Difference in pupil diameter between left and right eyes"], "answer": ["e"]}
{"problem_id": "114E6", "problem_text_en": "Which of the following statements is correct with regards to smoking?", "choices_en": ["The dependence on smoking is caused by tar.", "PM2.5 is included in tobacco smoke.", "Prevention of passive smoking is possible by separating smoking areas indoors.", "Cancer caused by smoking is mainly due to nicotine.", "If you quit smoking, the lung cancer mortality rate becomes the same as that of non-smokers."], "answer": ["b"]}
{"problem_id": "114E7", "problem_text_en": "Illustrations of the cervical and anterior thoracic regions (A) and the upper and lower arms (B) in adults. What is the appropriate insertion site for a peripherally inserted central catheter (PICC) in adults?", "choices_en": ["1", "Unfortunately, without additional context, I cannot provide an accurate translation for ②. It could refer to a number or a specific option in a list. Please provide more information for me to assist you better.", "Sorry, it is not possible to translate \"③\" without more context. It is a symbol used for numbering or indicating different options in a multiple-choice question. Please provide additional information or the full question so that I can assist you better.", "Sorry, I cannot accurately translate \"④\" without any context. It appears to be a symbol used for labeling options in a multiple-choice question, but I need more information about the question to provide an appropriate translation.", "⑤ (this is not a word, it is a numbering symbol)"], "answer": ["d"]}
{"problem_id": "114E8", "problem_text_en": "Which of the following is correct regarding graft-versus-host disease (GVHD) after blood transfusion?", "choices_en": ["Develops within 6 hours after blood transfusion.", "More likely to occur with stored blood compared to fresh blood.", "Radiation irradiation of blood transfusions is effective for prevention.", "More likely to occur after multiple blood transfusions compared to the first one.", "More likely to occur when receiving blood from a non-relative, as compared to a blood relative."], "answer": ["c"]}
{"problem_id": "114E9", "problem_text_en": "Which of the following is not related to hormonal changes during the menstrual cycle?", "choices_en": ["Body weight", "Mid-cycle bleeding", "Breast engorgement", "Clear cervical mucus", "Yellow frothy vaginal discharge"], "answer": ["e"]}
{"problem_id": "114E10", "problem_text_en": "What can be caused by a uterine intramural fibroid with a diameter of 10 cm?", "choices_en": ["Migraine", "Anovulation", "Menorrhagia", "Scanty menstruation", "Premenstrual syndrome"], "answer": ["c"]}
{"problem_id": "114E11", "problem_text_en": "Which of the following is incorrect regarding the confirmation of signs of peritoneal irritation by palpation?", "choices_en": ["Pay attention to the patient's facial expression.", "Start from an area without spontaneous pain.", "Be cautious when performing percussion on a painful area.", "The palpation of sites with marked peritoneal irritation should be kept to a minimum.", "Rebound tenderness should be confirmed by applying pressure with the entire palm."], "answer": ["e"]}
{"problem_id": "114E12", "problem_text_en": "Which of the following is correct regarding the use of antimicrobial agents?", "choices_en": ["Discontinue the antibacterial medication immediately after the fever has subsided.", "Administer antibiotics to patients with fever.", "Administering antibiotics after collecting a specimen for bacterial testing.", "Continue broad-spectrum antibiotics regardless of the results of susceptibility testing.", "Co-administration of antipyretics makes it easier to assess the effectiveness of antibiotics."], "answer": ["c"]}
{"problem_id": "114E13", "problem_text_en": "Which of the following is observed in major depression?", "choices_en": ["Delusions of grandeur", "Delusion of guilt", "Persecutory delusion", "Delusion of poisoning", "Delusion of theft"], "answer": ["b"]}
{"problem_id": "114E14", "problem_text_en": "What actions by a physician would be considered a violation of professional ethics when presenting at an academic conference?", "choices_en": ["To disclose conflict of interest related to the content of the presentation.", "To ensure that the patient's personal information cannot be identified.", "Manipulating data to fit one's hypothesis.", "Presenting a summary of several cases that one has experienced.", "To announce research results obtained from a study supported by a medical equipment manufacturer's grant."], "answer": ["c"]}
{"problem_id": "114E15", "problem_text_en": "What are the factors that hinder interdisciplinary team healthcare?", "choices_en": ["To use abbreviations specific to the profession.", "Listen to the wishes of the patient's family.", "Respect opinions from other professions.", "Each profession has established expertise.", "Understanding the roles and functions of other professions."], "answer": ["a"]}
{"problem_id": "114E16", "problem_text_en": "Which of the following statements about HbA1c is correct?", "choices_en": ["Affected by anemia.", "Other sugars besides glucose are also affected.", "Reflects blood glucose status of the past 1-2 weeks.", "Formed by enzymatic reaction within red blood cells.", "It is included in the diagnostic criteria for metabolic syndrome in Japan."], "answer": ["a"]}
{"problem_id": "114E17", "problem_text_en": "Which of the following statements is true regarding randomized controlled trials (RCTs)?", "choices_en": ["Double-blind testing is necessary.", "Placebos are currently prohibited from use.", "Randomization is performed to reduce the number of cases.", "To determine the number of cases, an estimate of treatment efficacy is necessary.", "Analysis by intention to treat (ITT) is based on the actual treatment administered."], "answer": ["d"]}
{"problem_id": "114E18", "problem_text_en": "Which of the following combinations of Japanese researchers who won the Nobel Prize in Physiology or Medicine and the research they contributed to is incorrect?", "choices_en": ["Yoshinori Ohsumi ------- Elucidation of the Mechanisms of Autophagy", "Tomohiro Omura --------- Discovery of a new treatment for malaria", "Susumu Tonegawa - Discovery of the genetic principles for generation of antibody diversity.", "Shinya Yamanaka - Discovery of immune checkpoint molecules.", "Shinya Yamanaka - Acquisition of Pluripotency through Reprogramming of Mature Cells"], "answer": ["b"]}
{"problem_id": "114E19", "problem_text_en": "Which of the following has a smooth surface on palpation of the skin?", "choices_en": ["Lipoma", "Bowen's disease", "Common warts", "Seborrheic keratosis", "Keratoacanthoma"], "answer": ["a"]}
{"problem_id": "114E20", "problem_text_en": "Which of the following is not isotonic?", "choices_en": ["Physiological saline solution.", "5% glucose solution", "Acetic acid (Lugol's) solution", "Lactated Ringer's solution", "25% albumin solution"], "answer": ["e"]}
{"problem_id": "114E21", "problem_text_en": "Which of the following decreases in concentration in the blood of healthy adults due to dietary intake?", "choices_en": ["GH stands for Growth Hormone.", "Insulin", "Glucose", "Triglycerides", "Free thyroxine (FT4)"], "answer": ["a"]}
{"problem_id": "114E22", "problem_text_en": "We decided to conduct an observational study to investigate the renal function prognosis of diabetic nephropathy. Which of the following is clinically the most important outcome?", "choices_en": ["HbA1c (stands for Hemoglobin A1c)", "Renal failure", "Proteinuria", "Lower leg edema", "Pathological findings"], "answer": ["b"]}
{"problem_id": "114E23", "problem_text_en": "For patients hospitalized due to cerebral infarction, what is assessed by a speech therapist?", "choices_en": ["Orientation (awareness of one's surroundings)", "Swallowing function", "Fine motor skills", "Muscle strength in all four limbs", "Mental state"], "answer": ["b"]}
{"problem_id": "114E24", "problem_text_en": "A woman in her 70s presents to the emergency department with a complaint of her first-ever fainting episode. What test should be performed first along with glucose measurement?", "choices_en": ["Electroencephalogram (EEG) test", "Cervical spine MRI", "Electrocardiogram (ECG or EKG) test", "Carotid artery ultrasound examination", "Chest X-ray examination"], "answer": ["c"]}
{"problem_id": "114E25", "problem_text_en": "Which one requires preventive measures according to the same route of infection as measles virus?", "choices_en": ["Group A streptococcus", "Mumps virus", "Varicella-zoster virus (VZV)", "Multidrug-resistant Pseudomonas aeruginosa (MDRP)", "Methicillin-resistant Staphylococcus aureus (MRSA)"], "answer": ["c"]}
{"problem_id": "114E26", "problem_text_en": "A 42-year-old woman presented with fever and chills and was feeling lethargic, and was brought to the hospital by her family. Yesterday evening, she had a fever with chills, so she came to the hospital. She has no sore throat, cough, sputum, or runny nose, and no nausea, vomiting, abdominal pain, or diarrhea. There are no people with similar symptoms around her. She has had atopic dermatitis since childhood, and her skin condition has worsened over the past few days, with generalized pruritus and scratches. Her conscious level is JCS I-2. Her body temperature is 39.2°C. Her pulse rate is 112 beats/min and regular. Her blood pressure is 86/58 mmHg. Her respiratory rate is 28 breaths/min. There are no abnormal heart sounds or respiratory sounds. There are no abnormalities in the oral cavity or pharynx. There is no tenderness on percussion of either side of the back. There are erythema, pigmentation, scales, and crusts on the face, trunk, both upper limbs, and both knees, together with multiple scratches and some scabs. What is the most appropriate test?", "choices_en": ["Urine culture", "Blood culture", "Sputum Gram staining", "Measles antibody titer measurement", "Influenza rapid test"], "answer": ["b"]}
{"problem_id": "114E27", "problem_text_en": "A newborn infant at birth (age: 0 days) was born at 39 weeks and 5 days by vaginal delivery. The infant had weak crying, so warmness was provided and the oral cavity was suctioned for amniotic fluid, followed by skin stimulation. At 30 seconds after birth, spontaneous breathing was not observed, but the heart rate was 110 bpm. What is the first response that should be taken?", "choices_en": ["Tracheal intubation", "Chest compressions", "Intravenous administration of physiological saline solution", "Intravenous administration of adrenaline", "Artificial respiration with a bag valve mask"], "answer": ["e"]}
{"problem_id": "114E28", "problem_text_en": "A 38-year-old primigravida (G1P0) was brought in by ambulance at 34 weeks of gestation due to severe abdominal pain and vaginal bleeding. Her pregnancy had been uneventful, except for mild hypertension, lower leg edema, and proteinuria detected at the 33-week prenatal check-up. She smoked 20 cigarettes a day before pregnancy but reduced to 5 cigarettes a day after becoming pregnant. Her body temperature was 36.9℃, and her heart rate was 72 beats/min and regular. Her blood pressure was 170/90 mmHg. She was in distress due to abdominal pain, her abdomen was distended and board-like with tenderness. Vaginal speculum examination found a small amount of vaginal bleeding, and cervical examination showed the cervix was closed. The urine test revealed 2+ proteinuria. Ultrasound showed marked thickening of the placenta at the uterine fundus. Fetal heart rate monitoring presented reduced baseline variability and late decelerations with transient bradycardia. What is the most likely condition in the patient?", "choices_en": ["Threatened premature delivery", "Threatened miscarriage", "Placenta previa", "Chorioamnionitis", "Premature separation of placenta previa"], "answer": ["e"]}
{"problem_id": "114E29", "problem_text_en": "A 28-year-old man presented with dizziness accompanied by his family. He became absent from school during high school and began to confine himself to his bedroom on the second floor of his home. He dropped out of high school, didn't work, and spent all day playing online games with the curtains closed. He had a severe eating disorder and his mother provided his meals in front of his bedroom, but he ate very little. Three months ago, his family noticed that he was swaying from side to side when he walked in the dark to go to the convenience store at night. He had no dizziness during the day, but this swaying was only noticed when he went to the toilet. He had no history of smoking or drinking. There was no anemia in his conjunctiva and no abnormalities in his heart and respiratory sounds. His abdomen was flat, soft, and did not detect the liver or spleen. On neurological examination, his eyeball movements were normal and he did not have nystagmus. He did not show abnormalities in the finger-to-nose test or heel-knee test, and he had no involuntary movements. The tendon reflex was generally decreased, and there was an increase in the trunk's disturbance with standing and closing the eyes. What is the nutrient deficiency that is considered to be the cause of this patient's symptoms along with vitamin B12?", "choices_en": ["Iron", "Copper", "Folic acid", "Vitamin D", "Magnesium"], "answer": ["b"]}
{"problem_id": "114E30", "problem_text_en": "A 72-year-old woman complains of left knee pain and has come to the hospital. She first noticed left knee pain while walking 2 years ago, and it has gradually worsened. She visited the hospital recently because walking became difficult. She has no history of trauma to her left knee. Her height is 155 cm, weight is 64 kg, body temperature is 36.3℃, and pulse rate is 64 beats/min and regular. She has patellar bounce and varus deformity on the left knee, but no redness or warmth. Separate X-rays of the left knee joint are shown. Which of the following explanations for future treatment is incorrect?\n\n(Note: It is implied that a description of future treatment is given, but without the full context, an accurate translation is difficult.)", "choices_en": ["\"Let's strengthen the muscles in the thighs.\"", "\"Please avoid using a cane\"", "\"Please avoid sitting in the Japanese traditional seated position (seiza).\"", "\"Let's reduce your body weight\"", "\"Surgical therapy is effective\""], "answer": ["b"]}
{"problem_id": "114E31", "problem_text_en": "A 48-year-old man was brought in by ambulance due to impaired consciousness and right hemiplegia. He does not open his eyes spontaneously and does not respond to verbal commands, but opens his eyes when pain is applied. He groans in response to pain, but no meaningful speech is observed. There is no movement in the right upper and lower limbs in response to pain, but the left upper and lower limbs show a pushing movement. What is the correct assessment total score based on the Glasgow Coma Scale?\n\n(Note: The Glasgow Coma Scale assesses the level of consciousness after a brain injury. The score ranges from 3 to 15, with a lower score indicating a more severe injury.)", "choices_en": ["3 o'clock", "6 o'clock", "9 o'clock", "12 o'clock.", "15 points"], "answer": ["c"]}
{"problem_id": "114E32", "problem_text_en": "A 43-year-old man visited for a health checkup. He has a smoking history of 20 cigarettes per day for 13 years, and typically smokes within 5-30 minutes after waking up in the morning. Recently, he has been experiencing increased irritability after reducing the amount of cigarettes he smokes per day. He is 170 cm tall, weighs 80 kg, and has a blood pressure of 150/90 mmHg. Which of the following is a mistaken short-term support for smoking cessation?", "choices_en": ["To grasp the smoking status.", "Refer to a smoking cessation outpatient clinic.", "Explain the dangers of smoking.", "Explain the importance of smoking cessation.", "Instruct to reduce smoking amount."], "answer": ["e"]}
{"problem_id": "114E33", "problem_text_en": "A 23-year-old woman presents with fever and headache. She has had a temperature of 38℃, headache, and frequent vomiting since yesterday. She denies nasal discharge, sore throat, cough, or dysuria. She is alert and oriented. Her height is 155 cm, weight is 48 kg. Her temperature is 39.6℃, pulse is 104/min and regular, blood pressure is 108/50 mmHg, respiratory rate is 22/min, and oxygen saturation is 99% on room air. There is no cervical lymphadenopathy. Heart and lung sounds are normal. Her abdomen is flat, soft and non-tender, with no hepatosplenomegaly. There is no costovertebral angle tenderness. There is no nuchal rigidity or Kernig's sign, but she has a positive jolt accentuation. Urine analysis shows negative results for protein, glucose, ketones, occult blood, and white blood cells. Blood tests show red blood cells 4.4 million/μL, hemoglobin 13.0 g/dL, hematocrit 44%, white blood cells 3,600/μL (9% segmented neutrophils, 55% band neutrophils, 3% eosinophils, 2% basophils, 4% monocytes, and 27% lymphocytes), and platelets 140,000/μL. Blood biochemistry tests show a blood urea nitrogen of 26 mg/dL, creatinine 1.1 mg/dL, sodium 135 mEq/L, potassium 4.1 mEq/L, and chloride 93 mEq/L. The C-reactive protein level is 0.3 mg/dL. Blood cultures were taken and antimicrobial treatment was started. What is the next step to take?", "choices_en": ["Urine culture", "Stool culture", "Pharyngeal culture", "Sputum culture", "Lumbar puncture"], "answer": ["e"]}
{"problem_id": "114E34", "problem_text_en": "A 72-year-old woman, who is being treated for hypertension, consulted a physician in an internal medicine outpatient clinic, stating that she is having trouble dealing with her husband. Her husband began drinking after retiring from work 2 years ago and has recently become more isolated, drinking at home from morning on without going out. He sometimes yells and acts violently when he is drinking. Even though she has asked him to stop drinking, he doesn't listen and gets angry when she suggests seeing a doctor. The physician is very concerned and unsure how to proceed. What would be the most appropriate response from the physician in this situation?", "choices_en": ["Report to the police immediately.", "Create a referral letter for a psychiatric consultation.", "Directly contact the husband and persuade him to quit drinking.", "Explain that they should consult with the Regional Inclusive Support Centers.", "Contact the local home doctor and request for a visiting medical examination for the husband."], "answer": ["d"]}
{"problem_id": "114E35", "problem_text_en": "A 42-year-old woman visited the clinic with concern about a lump in her left breast. A physical examination showed that the mass was hard and immobile, neither attached to the skin nor muscle. No axillary lymph nodes were palpable on either side. Mammography showed a 2.5 cm lesion with spicules. Biopsy results revealed invasive ductal carcinoma, and no metastases were detected on chest/abdominal CT or bone scintigraphy. What is the most appropriate treatment plan at this time?", "choices_en": ["Breast surgery", "エストロゲン投与", "NSAID (Non-Steroidal Anti-Inflammatory Drug) administration", "Observation", "全身照射 (Zenshin shōsha)"], "answer": ["a"]}
{"problem_id": "114E36", "problem_text_en": "A 71-year-old man presents with a complaint of hemoptysis. He has had a low-grade fever for the past two months and intermittent episodes of hemoptysis for the past two weeks. His regular physician has been treating him for diabetes, but his blood sugar control is reported to be poor. Coarse crackles are heard on auscultation of the lungs bilaterally. Chest X-ray (A) and contrast-enhanced chest CT images (B, C) are shown below. What is the next appropriate test that should be performed?", "choices_en": ["FDG-PET (Fluorodeoxyglucose-Positron Emission Tomography)", "Spirometry", "Sputum acid-fast bacillus examination", "Urinary pneumococcal antigen test.", "Plasma EGFR mutation testing"], "answer": ["c"]}
{"problem_id": "114E37", "problem_text_en": "A 48-year-old woman presents with rectal bleeding after defecation. She has a history of constipation and occasionally notices fresh blood on toilet paper after bowel movements. She came to the hospital yesterday because the amount of blood on the paper was larger than usual. Which of the following is incorrect in the procedure for rectal and anal digital examination?", "choices_en": ["Examine in a supine position.", "Wear gloves.", "Inspect the area around the anus.", "Insert a lubricated finger into the anus.", "Perform a digital rectal examination."], "answer": ["a"]}
{"problem_id": "114E38", "problem_text_en": "A 28-year-old man is brought in by ambulance due to a transient loss of consciousness. According to witnesses, he was sitting in a chair at work when suddenly his vision went dark and he lost consciousness without convulsions. He regained consciousness about 1 minute later. Worried coworkers called an ambulance. The patient's father died suddenly at 54 years old. The patient appears conscious with a heart rate of 64 beats per minute, regular rhythm, blood pressure of 120/70 mmHg, respiratory rate of 16 breaths per minute. Heart sounds and breath sounds are normal, and there are no abnormal findings in a neurological examination. The ECG is shown separately. What is the most likely cause of the loss of consciousness?", "choices_en": ["Situational syncope", "Epilepsy", "Ventricular arrhythmia.", "Atrial arrhythmia", "Vagus nerve reflex"], "answer": ["c"]}
{"problem_id": "114E39", "problem_text_en": "A 71-year-old man complains of difficulty urinating and nocturia for the past 6 months. There is no significant medical or family history. Physical examination shows a height of 162 cm, a weight of 60 kg, a body temperature of 36.4℃, a pulse rate of 72 beats per minute and a blood pressure of 154/82 mmHg, and a respiratory rate of 14 breaths per minute. The abdomen is flat and soft, without palpable liver or spleen. A prostate of approximately 40 mm is palpated on digital rectal examination, but no hardness is noted. Urine analysis shows no protein or sugar, and no red or white blood cells in the sediment. The serum PSA level is 2.5 ng/mL (reference value, <4.0 ng/mL). The International Prostate Symptom Score is 28 points (mild, 0-7 points; moderate, 8-19 points; severe, 20-35 points). Abdominal ultrasound examination estimates the prostate volume at 60 mL. Urine flow measurement shows a voiding volume of 120 mL, a maximum urine flow rate of 2.5 mL/second, and a residual urine volume of 240 mL. Which of the following medications is not appropriate for treatment?", "choices_en": ["Alpha-1 blocker (medication)", "Anticholinergic drug", "Anti-androgenic drugs", "5-alpha reductase inhibitor drugs", "PDE5 inhibitors (Phosphodiesterase 5 inhibitors)"], "answer": ["b"]}
{"problem_id": "114E40", "problem_text_en": "A 65-year-old man was admitted by ambulance due to hematemesis. He had been diagnosed with alcoholic liver disease 10 years ago, but had not been visiting a hospital. He vomited blood after dinner, so his family called an ambulance. His consciousness level is JCS II-10. He is 168cm tall and weighs 74kg. His body temperature is 36.8°C. His heart rate is 112 beats per minute, regular. His blood pressure is 88/68 mmHg. His respiratory rate is 22 breaths per minute. His SpO2 is 95% with nasal cannula oxygen therapy at 3L/min. His skin is moist. His conjunctiva is pale and mild jaundice is observed in the sclera. No abnormalities are observed in heart sounds and breath sounds. His abdomen is slightly distended and there is wave motion. He has cold sweat on his limbs. What should be done first?", "choices_en": ["Intravenous infusion", "Gastric tube placement", "Abdominal paracentesis", "AED attachment (refers to attaching an automated external defibrillator)", "Urinary catheterization"], "answer": ["a"]}
{"problem_id": "114E41", "problem_text_en": "Read the following passage and answer the question below it. A 72-year-old man presented with complaints of lower abdominal pain. He has a past medical history of hypertension for 10 years and has been on antihypertensive medication. He developed atrial fibrillation with palpitations a month ago and was prescribed antiarrhythmic and anticoagulant drugs. Yesterday, he noticed a lack of urine output and slight abdominal distention, but he was monitoring his condition. He woke up this morning with worsening abdominal pain and decided to seek medical attention. He has no remarkable past medical history. He has a 40-year history of smoking 20 cigarettes per day and drinks 1-2 servings of sake per day. His father died at the age of 68 from gastric cancer. On examination, he was alert and oriented. His height was 165 cm, weight was 61 kg, and his temperature was 36.9°C. His pulse was irregular and 52 beats per minute, his blood pressure was 142/94 mmHg, and his respiratory rate was 18 breaths per minute. Oxygen saturation was 96% (room air). He had no jugular venous distension. A grade II/VI systolic murmur was audible at the apex of the heart. Lung auscultation revealed no abnormalities. His abdomen was distended in the lower region and was tender to touch. No lower extremity edema was present. On abdominal ultrasound, bladder volume was found to be enlarged and a urethral catheter was temporarily placed. Which of the following is correct with regards to the indwelling catheter?\n\nThe correct answer was not provided.", "choices_en": ["Place the patient in lateral position during insertion.", "Disinfect after applying lubricant to the penis.", "Hold the penis slightly pulled up in a vertical direction.", "The urinary drainage bag is fixed to the bed rails at the same height as the bladder.", "If strong resistance is encountered during insertion, inflate the balloon at that position."], "answer": ["c"]}
{"problem_id": "114E42", "problem_text_en": "During treatment in the outpatient department, there was a message from the testing room saying, \"The panic values ​​are out, so we will urgently report the test results.\" Test findings are as follows: Urine findings: Protein 2+, Glucose (-), Occult blood 2+, Sediment findings include 30-50/HPF red blood cells, 1-4/HPF white blood cells, and no bacteria. Blood findings show: Red blood cell count of 4.5 million, Hb 13.2 g/dL, Ht 42%, white blood cell count of 8,200, platelets of 240,000 and PT-INR of 1.9 (reference range 0.9-1.1). Blood chemistry shows: Total protein 6.8 g/dL, AST 44 U/L, ALT 20 U/L, serum urea nitrogen (BUN) 68 mg/dL, serum creatinine 3.8 mg/dL, blood glucose 136 mg/dL, Na 134 mEq/L, K 7.2 mEq/L, Cl 106 mEq/L, and Ca 8.4 mg/dL. CRP is 1.2 mg/dL. What is the immediate action that should be taken?", "choices_en": ["Abdominal CT scan", "Electrocardiogram (ECG/EKG) examination", "Cystoscopy", "Arterial blood gas analysis", "Vein puncture at a different site"], "answer": ["b"]}
{"problem_id": "114E43", "problem_text_en": "Read the following passage and answer the questions below. \n\nA 49-year-old man complains of palpitations and shortness of breath. He reports experiencing strong palpitations and shortness of breath during breakfast this morning. When he checked his pulse, he observed that the rhythm was irregular, and the heart rate was between 112 and 124 beats per minute. The palpitations and shortness of breath lasted for about two hours but gradually improved, and the symptoms had disappeared by the time he came to the clinic. The patient's medical history includes hyperuricemia, for which he has been following a dietary regimen. He has been smoking 40 cigarettes per day for 24 years and drinking 3 liters of beer per day for 29 years. There is no history of heart disease in his family. On examination, he is alert and oriented. His height is 167 cm, weight is 79 kg, and temperature is 36.2℃. Blood pressure is 152/94 mmHg, pulse is 80 beats per minute and regular, respiratory rate is 18 breaths per minute, and SpO2 is 97% on room air. There are no abnormalities in the conjunctiva and eyeball. Heart, lung, and abdominal examinations are unremarkable. Laboratory findings show a red blood cell count of 4.63 million, hemoglobin level of 14.5 g/dL, white blood cell count of 7,600, and platelet count of 200,000. Blood biochemistry shows AST 35 U/L, ALT 38 U/L, γ-GT 47 U/L (normal range 8-50), blood urea nitrogen 18 mg/dL, creatinine 1.1 mg/dL, uric acid 8.1 mg/dL, Na 138 mEq/L, K 4.9 mEq/L, and Cl 101 mEq/L. Chest X-ray shows a cardiothoracic ratio of 57%, and the electrocardiogram (ECG) shows normal sinus rhythm with a heart rate of 76 beats per minute and no significant ST-T changes. Echocardiography reveals an enlarged left ventricle with an end-diastolic diameter of 58 mm and a reduced ejection fraction of 45%. What is the most useful information in differentiating the cause of palpitations?\n\nAnswer: The most useful information in differentiating the cause of palpitations is irregular heart rhythm at the time of palpitation.", "choices_en": ["Family history", "Smoking history", "Hyperuricemia", "Rhythm of the pulse during palpitations", "Electrocardiogram findings at time of visit"], "answer": ["d"]}
{"problem_id": "114E44", "problem_text_en": "Which of the following statements is incorrect regarding the explanation about drinking habits?", "choices_en": ["\"Heavy drinking increases blood pressure\"", "\"Excessive drinking is likely to cause heart failure.\"", "\"Excessive drinking is likely to cause arrhythmia.\"", "\"Recovery from heart dysfunction can be expected by abstaining from alcohol.\"", "\"To avoid negative effects on the heart, you should change the type of alcohol consumed.\""], "answer": ["e"]}
{"problem_id": "114E45", "problem_text_en": "Read the following text and answer the question below. \n\nA 20-year-old male is a sophomore medical student. He plans to participate in a one-week hospital internship for the first time and has come to consult with the physician in charge of the internship with the results of an antibody test taken 10 months ago (during his freshman year). Medical history: No history of infectious disease. No adverse reactions such as fever have been observed following vaccination. Lifestyle: He has no smoking or drinking history. Family history: Nothing notable. Test results: Report of the antibody test taken 10 months ago is shown.\n\nBlood antibody titer report  Name: ○○○○\n\nMeasurement method Test result　Meeting the internship criteria Positive　unit\n\nMeasles (IgG-EIA method) 20.4 (≧16.0)\n\nRubella (IgG-EIA method) 10.0 (≧8.0)\n\nVaricella (IgG-EIA method) 6.4 (≧4.0)\n\nEpidemic parotitis (IgG-EIA method) Positive Positive\n\nHepatitis B (CLIA method) 4.8 (≧10.0) mIU/mL\n\nTuberculosis (IGRA)* Negative Negative\n\n*Whole-blood interferon-gamma release assay specific for tuberculosis\n\nWhat is appropriate to discuss with this student during the consultation?", "choices_en": ["\"BCG vaccination is necessary\"", "\"Revaccination with MR vaccine is necessary\"", "\"You are highly likely to develop herpes zoster\"", "\"Please tell me about your vaccination status for Hepatitis B.\"", "\"I cannot participate in the medical treatment of patients with epidemic parotitis (mumps)\""], "answer": ["d"]}
{"problem_id": "114E46", "problem_text_en": "Subsequent course: The student who consulted went on to graduate from medical school and started working at the same university hospital five years later as a resident physician. While working in the emergency department on a weekday, a 54-year-old man came to the hospital with abrasions resulting from a bicycle accident. He was a new patient without a medical history at the hospital. While the resident was performing suture treatment on the wound, they accidentally stabbed themselves with the suture needle. The resident immediately squeezed blood from the wound and thoroughly washed it with running water, and at the same time, conducted a blood test for both themselves and the patient. Which of the following is necessary in the event that the blood test result of the trauma patient is positive, and prompt prophylactic administration is required for the resident?", "choices_en": ["HIV", "Hepatitis B virus", "Hepatitis C virus", "Syphilis", "Human T-lymphotropic virus type 1 (HTLV-1)"], "answer": ["a"]}
{"problem_id": "114E47", "problem_text_en": "Read the following passage and answer the questions below. \n\nA 48-year-old man visited the hospital complaining of fatigue and thirst. He had been diagnosed with diabetes two years ago but had not received any medical treatment. He had experienced tiredness, weight loss, and thirst over the past three months, and came to hospital due to an extreme thirst that had developed in the past few days. His medical history was unremarkable. He worked as a company employee and lived alone. He had smoked 15 cigarettes a day for 28 years, but quit drinking at the age of 36. He had a diet that consisted of sweet buns for breakfast, set meals from the company cafeteria for lunch, and convenience store side dishes for dinner. His father was diagnosed with pancreatic cancer at the age of 72 and his mother had dyslipidemia. On examination, he was conscious and alert. He was 174 cm tall and weighed 90 kg. His temperature was 36.8°C, pulse rate was 80 beats per minute and regular, blood pressure was 126/88 mmHg, and respiratory rate was 24 breaths per minute. No abnormalities were observed in the conjunctiva or globe. Dryness was observed in the oral cavity. No abnormalities were heard in breath or heart sounds. His abdomen was flat and soft, and the liver and spleen were not palpable. A decrease in Achilles tendon reflex was observed. Laboratory findings showed 1+ protein, 4+ sugar, 4+ ketone bodies, and (-) blood in urine. Blood tests revealed red blood cell count of 4.78 million/mm3, hemoglobin of 15.4 g/dL, hematocrit of 35%, white blood cell count of 9,800/mm3, and platelet count of 150,000/mm3. The results of blood chemistry showed total protein of 7.1 g/dL, aspartate aminotransferase (AST) of 29 U/L, alanine aminotransferase (ALT) of 54 U/L, lactate dehydrogenase (LD) of 214 U/L (reference range: 120 to 245), gamma-glutamyl transpeptidase (γ-GT) of 173 U/L (reference range: 8 to 50), blood urea nitrogen (BUN) of 12 mg/dL, creatinine of 0.8 mg/dL, random blood sugar of 281 mg/dL, hemoglobin A1c (HbA1c) of 10.8% (reference range: 4.6 to 6.2), total cholesterol of 150 mg/dL, sodium level of 134 mEq/L, potassium level of 4.2 mEq/L, and chloride level of 98 mEq/L. The patient was diagnosed with diabetes and started treatment. The doctor decided to educate the patient about the disease and admitted him to the hospital. What is the appropriate treatment for the patient?", "choices_en": ["Not applicable to a clinical pathway.", "To educate on the management of sickle cell crisis.", "Create a guidance plan based solely on the judgment of the attending physician.", "The condition is that there is no educational hospitalization history in the past.", "If diabetic complications are diagnosed, the educational hospitalization will be suspended."], "answer": ["b"]}
{"problem_id": "114E48", "problem_text_en": "Which of the following is appropriate for instructing self-injection of insulin for blood sugar control?", "choices_en": ["We also provide instructions on how to use self-blood glucose monitoring devices.", "Store unused insulin products at room temperature.", "Use a 21-gauge injection needle.", "Instruct to administer injections in the same area every time.", "Instruct to administer the medication as rapidly as possible."], "answer": ["a"]}
{"problem_id": "114E49", "problem_text_en": "Read the following passage and answer the question below. \n\nA 79-year-old woman accompanied by her husband visited the hospital for a workup for anemia. Medical history: Two weeks ago, an abnormality was found in blood tests that had been considered normal one year ago during a general health checkup, and further examination was recommended, with no symptoms. Past history: She has been taking antihypertensive medication since the age of 65 and has been living in a wheelchair due to osteoarthritis of the knee since she was 76 years old. Life history: She lives with her 80-year-old husband. Family history: Nothing significant to note. Current findings: The patient is alert and conscious. She is 150 cm tall and weighs 54 kg. Her body temperature is 36.2 ℃, pulse rate is 96/min and regular, blood pressure is 126/80 mmHg, respiratory rate is 18/min, and SpO2 on room air is 98%. The conjunctiva of eyes appears pale. No thyroid nodules or cervical lymph nodes are palpable. No abnormal heart or breath sounds are heard. The abdomen is flat, soft and non-tender, with no palpable liver or spleen. Tendon reflexes are normal. No abnormalities are found in the sensory system. Laboratory findings: Hematological findings: RBC 3.81 million, Hb 8.5 g/dL, Ht 29%, WBC 4,500, and platelets 290,000. Blood biochemical findings: Total protein 6.9 g/dL, albumin 4.5 g/dL, total bilirubin 0.4 mg/dL, AST 24 U/L, ALT 22 U/L, LD 163 U/L (reference range 120-245), ALP 146 U/L (reference range 115-359), blood urea nitrogen 11 mg/dL, creatinine 0.7 mg/dL, and blood glucose 93 mg/dL. After explaining the patient's condition and recommending a lower gastrointestinal endoscopy for diagnosis the next day, the patient responded with \"I don't want to undergo the test\" as her first words. What is the appropriate response for the physician at this point?\n\nThe appropriate response for the physician at this point would be to learn the reasons for the patient's reluctance to undergo the test and to provide more information to reassure and persuade the patient to undergo the test if it is necessary for her diagnosis and treatment.", "choices_en": ["\"Let's stop the examination\"", "\"The exam is not a dangerous thing.\"", "\"Let's hear your family's opinion\"", "\"It seems like you don't understand the necessity of the examination.\"", "\"Please tell us why you don't want to take the test\""], "answer": ["e"]}
{"problem_id": "114E50", "problem_text_en": "Afterward, the patient underwent a lower gastrointestinal endoscopy, and early colorectal cancer was detected. The patient was admitted to a four-bed room for treatment. When the doctor visited the room to explain the treatment options, the patient was sitting in a chair next to the bed, which had been raised up, and talking with her husband. The four-bed room was full, and there were no empty chairs available. What is the preferred way for the doctor to provide the explanation of the patient's condition?", "choices_en": ["Talk to the husband alone sitting in a separate room.", "Speak while standing at the patient's bedside.", "Talk to the patient while sitting on the bed by their side.", "Bring a chair and sit beside the patient's bed to talk.", "Place the patient in a wheelchair and move to another room with her husband while in a wheelchair to have a conversation."], "answer": ["e"]}
