{"problem_id": "112F1", "problem_text_en": "Which of the following statements about lipid metabolism is correct?", "choices_en": ["Triglycerides are synthesized in the liver.", "Most of the lipids in our diet are cholesterol.", "Lipoprotein lipase breaks down cholesterol.", "The energy value of 1 gram of triglyceride is 4 kcal.", "Most of the lipids digested and absorbed in the small intestine flow into the portal vein."], "answer": ["a"]}
{"problem_id": "112F2", "problem_text_en": "Which of the following indicates the best prognosis for recurrent metastatic liver tumors after primary tumor resection?", "choices_en": ["Esophageal cancer", "Gastric cancer", "Gallbladder cancer", "Pancreatic cancer", "Colorectal cancer"], "answer": ["e"]}
{"problem_id": "112F3", "problem_text_en": "Which of the following is not stipulated in the Medical Care Act?", "choices_en": ["Designated Function-Specific Hospital", "Regional Medical Support Hospital", "Clinical research core hospital", "Community inclusive support center", "Medical Safety Support Center"], "answer": ["d"]}
{"problem_id": "112F4", "problem_text_en": "Which of the following is the correct method for disposal of an injection needle used on a patient?", "choices_en": ["Recap and dispose of as general waste.", "Dispose of as non-special waste without recapping.", "Recap and dispose of as infectious waste.", "Dispose of as infectious waste without recapping.", "Boil without recapping and dispose of as infectious waste."], "answer": ["d"]}
{"problem_id": "112F5", "problem_text_en": "Which of the following combinations of global recommendations related to health care is incorrect?", "choices_en": ["WHO Constitution --------- Definition of health", "Ottawa Charter for Health Promotion", "The Lisbon Declaration ---------Patient rights", "Helsinki Declaration ---------- Definition of Public Health", "Alma-Ata Declaration - Primary Health Care."], "answer": ["d"]}
{"problem_id": "112F6", "problem_text_en": "Which of the following is the most appropriate example of health promotion in the community?", "choices_en": ["Development/maintenance of safe sidewalks for walking.", "Establishment of a transport system to a medical emergency institution", "Establishment of medical institutions that perform transplant medicine", "Establishment of a special nursing home for the elderly", "Establishment of a palliative care ward"], "answer": ["a"]}
{"problem_id": "112F7", "problem_text_en": "Which of the following is correct regarding normal occiput posterior presentation during labor?", "choices_en": ["The second and fourth semicircular canals of the labyrinth are oriented in the same direction.", "The fourth ventricle of the brainstem occurs almost simultaneously with the appearance.", "The first and third rotations of the fetal head are the same movement.", "The child's scapula rotates to match the widest part of the pelvis.", "The infant's scapula is delivered outside the mother's body before the mother's scapula."], "answer": ["d"]}
{"problem_id": "112F8", "problem_text_en": "Which one is a self-administered psychological test?", "choices_en": ["Rorschach test", "Tsumori-Inamori developmental assessment scale", "State-Trait Anxiety Inventory (STAI) test", "Mini-Mental State Examination (MMSE)", "Brief Psychiatric Rating Scale (BPRS)"], "answer": ["c"]}
{"problem_id": "112F9", "problem_text_en": "What is the recommended maximum daily intake of sodium (as salt equivalent) for adults according to the Japanese dietary guidelines for 2020?", "choices_en": ["Males less than 7.0g and females less than 6.5g", "Less than 7.5g for males, and less than 6.5g for females.", "Less than 7.5g for males and less than 7.0g for females", "Less than 8.0g for males and less than 7.0g for females", "Less than 8.0g for males, less than 7.5g for females."], "answer": ["b"]}
{"problem_id": "112F10", "problem_text_en": "Which of the following is found in higher amounts in mature milk compared to colostrum?", "choices_en": ["Immunoglobulin A", "Complement", "Fat", "Lysozyme team.", "Lactoferrin"], "answer": ["c"]}
{"problem_id": "112F11", "problem_text_en": "What is a mandatory requirement for a randomized controlled trial (RCT)?", "choices_en": ["Double-blind test", "Use of placebo", "Random selection of participants", "Tracking the endpoint", "意図分析法 (Intention-to-treat analysis)"], "answer": ["d"]}
{"problem_id": "112F12", "problem_text_en": "The separate images show a head MRI (①-⑤). Which section shows the substantia nigra?", "choices_en": ["① (This is not a translation. It is a numeric character that is commonly used in multiple-choice questions in Japan to indicate the first choice.)", "This is not a phrase or word and cannot be translated without context. It appears to be a number or label used in a list or in a question. Please provide more context or information about the topic of the question.", "Sorry, I cannot translate this choice without additional context. It is just a number \"3\" and could be referring to different things depending on the question.", "It is not possible to translate the choice as it is only a numeric code and has no meaning without context.", "I'm sorry, it is not possible to translate the choice in a multiple-choice question without knowing its context. The symbol \"⑤\" on its own does not provide enough information to determine its meaning."], "answer": ["c"]}
{"problem_id": "112F13", "problem_text_en": "What is observed with aging?", "choices_en": ["Resting tremor in upper extremities", "Loss of patellar tendon reflex", "Weakness of the iliopsoas muscles", "Babinski sign positive", "Loss of position sense in the 3rd toe"], "answer": ["c"]}
{"problem_id": "112F14", "problem_text_en": "Which of the following statements is correct about national medical expenses?", "choices_en": ["Includes the cost of the health check-up.", "Includes expenses related to normal pregnancy and delivery.", "The ratio of national medical expenses to GDP is decreasing.", "The national medical expenses in fiscal year 2018 exceeded 40 trillion yen.", "The national medical expenses per person for those over 65 are about twice as much as those under 65."], "answer": ["d"]}
{"problem_id": "112F15", "problem_text_en": "What are the symptoms that are considered indicative of a personality disorder?", "choices_en": ["Fear", "Autism", "Bipolarity", "Dissociative disorder", "Obsession"], "answer": ["d"]}
{"problem_id": "112F16", "problem_text_en": "The following shows the proportion of deaths by location in the 2015 vital statistics:\n \nPlace of Death\n(A)\n(B)\n(C)\n(D)\n(E)\nOther\n \nPercentage (%)\n74.6\n12.7\n6.3\n2.3\n2.0\n2.1\n \nWhat does (B) represent?", "choices_en": ["One's own home", "Hospital", "Clinic", "Nursing home (for elderly)", "Long-term care health facility for the elderly"], "answer": ["a"]}
{"problem_id": "112F17", "problem_text_en": "Which of the following is incorrect regarding integrated community care systems?", "choices_en": ["Aiming to support independent living.", "Aiming to preserve the dignity of elderly people.", "To support living in one's familiar community.", "Provide services on a secondary medical care area basis.", "Comprehensive provision of medical care, nursing care, prevention, life support, and housing."], "answer": ["d"]}
{"problem_id": "112F18", "problem_text_en": "Which of the following milestones has the latest age of occurrence in the developmental process?", "choices_en": ["Play pretend.", "Tell your own age.", "To skip.", "Stand on one foot.", "Riding a tricycle."], "answer": ["c"]}
{"problem_id": "112F19", "problem_text_en": "Comparing patient surveys from 1996 (Heisei 8) and 2014 (Heisei 26), which condition had the largest increase in number of patients?", "choices_en": ["Mood disorder", "Schizophrenia", "Vascular dementia", "Alcohol dependency", "Neurogenic anorexia nervosa"], "answer": ["a"]}
{"problem_id": "112F20", "problem_text_en": "This shows the proportion of major causes of death in low-income and high-income countries in 2015, as announced by WHO. Which one is (A)?", "choices_en": ["Infectious disease", "Malignant neoplasm (cancer)", "Cardiovascular disease", "Unforeseen accident", "Perinatal abnormalities"], "answer": ["a"]}
{"problem_id": "112F21", "problem_text_en": "Which primary immunodeficiency disorder affects both T-cell and B-cell systems?", "choices_en": ["Chronic granulomatous disease", "Severe combined immunodeficiency (SCID)", "Agammaglobulinemia", "Chédiak-Higashi syndrome", "DiGeorge syndrome"], "answer": ["b"]}
{"problem_id": "112F22", "problem_text_en": "Which of the following is incorrect regarding the function of the larynx?", "choices_en": ["Swallowing", "Articulation", "Respiration/breathing", "Mastication", "Articulation/vocalization."], "answer": ["d"]}
{"problem_id": "112F23", "problem_text_en": "In a city with a population of 100,000, a survey will be conducted to investigate the exercise habits of residents aged 65 and older. Which of the following methods would most accurately reflect the overall status of the city's population aged 65 and older?", "choices_en": ["Randomly selecting residents using the basic resident register.", "Select all residents who used sports facilities within a certain period in the city.", "Select the residents who could be contacted using phone numbers generated by random numbers.", "Select a resident monitor registered with an internet survey company.", "Randomly extract information from residents using the long-term care insurance payment details (receipts)."], "answer": ["a"]}
{"problem_id": "112F24", "problem_text_en": "Which combination of laws and regulations correctly delineates the obligations of physicians?", "choices_en": ["Confidentiality obligation --------- Medical Practitioners Act", "Compulsory military service --------- Civil law", "Obligation to explain --- Medical care law", "Obligation to provide prescription - Health Insurance Act", "Obligation to report unusual death - Criminal Law"], "answer": ["c"]}
{"problem_id": "112F25", "problem_text_en": "Which of the following is incorrect as a public health center task?", "choices_en": ["To receive consultations regarding rare diseases.", "Receive a report of a food poisoning patient.", "Perform administrative tasks related to health insurance.", "Carry out home visit activities by public health nurses.", "Perform administrative tasks related to population dynamics statistics."], "answer": ["c"]}
{"problem_id": "112F26", "problem_text_en": "Which of the following cannot be palpated during the first stage of labor in a normal cephalic delivery?", "choices_en": ["Cape", "Coccyx", "Ischial spine", "Koizumi's aperture/Jejunal orifice of the duodenum", "Sagittal suture"], "answer": ["a"]}
{"problem_id": "112F27", "problem_text_en": "Which of the following is not included in the considerations for local medical plans by prefectures?", "choices_en": ["Healthcare delivery system", "Placement of health centers", "Securing and training healthcare workers", "Future projection of healthcare demand", "Promotion of functionally differentiated hospital beds."], "answer": ["b"]}
{"problem_id": "112F28", "problem_text_en": "Which site should the red electrode of a 3-lead ECG monitor be placed on? (Note: \"赤黄緑の3点誘導式心電図モニター\" refers to a 3-lead ECG monitor with red, yellow, and green electrodes.)", "choices_en": ["Left subclavian", "Right infraclavicular", "Epigastric region", "Lower left chest", "Lower right chest"], "answer": ["b"]}
{"problem_id": "112F29", "problem_text_en": "Which of the following is appropriate as an example of universal design?", "choices_en": ["Installation of revolving door", "Maintenance of underground pedestrian walkway", "Installation of elevator", "Installation of escalators", "Establishment of facilities for people with disabilities (children)"], "answer": ["c"]}
{"problem_id": "112F30", "problem_text_en": "Which of the following is included in instrumental activities of daily living (IADL)?", "choices_en": ["Movement", "Changing clothes", "Cooking", "Bathing", "Excretion"], "answer": ["c"]}
{"problem_id": "112F31", "problem_text_en": "Which of the following is least likely to cause genital bleeding?", "choices_en": ["Cervical cancer", "Atrophic vaginitis", "Endometrial cancer", "Endometriosis", "Submucosal uterine fibroid"], "answer": ["d"]}
{"problem_id": "112F32", "problem_text_en": "Which of the target items set in Healthy Parents and Children 21 (Phase 1) was evaluated to be worse in the final evaluation of 2013 than at the time of goal setting?", "choices_en": ["Perinatal mortality rate.", "Suicide rate among teenagers", "Percentage of 3-year-old children without cavities", "Smoking rate of parents at home during the child-rearing period", "Percentage of individuals who completed BCG vaccination until 6 months of age."], "answer": ["b"]}
{"problem_id": "112F33", "problem_text_en": "Which statement about the International Classification of Functioning, Disability, and Health (ICF) is incorrect?", "choices_en": ["Disease is included in the state of health.", "Environmental factors are included in background factors.", "Health condition affects participation.", "It is a classification based on the subject being classified as disabled.", "Activities are restricted even if there is no functional impairment."], "answer": ["d"]}
{"problem_id": "112F34", "problem_text_en": "Which is correct regarding team care in home medical care?", "choices_en": ["Patient information is shared among various professions.", "Not applicable if the patient lives alone.", "It is better to have one doctor in the team.", "Forming a team led by a care manager.", "Patient family members cannot attend multi-disciplinary conferences."], "answer": ["a"]}
{"problem_id": "112F35", "problem_text_en": "Which of the following statements is correct regarding patient surveys?", "choices_en": ["Conducted yearly.", "Survey only outpatients.", "Estimating treatment rates by type of injury/illness.", "To be implemented in all medical facilities within the country.", "Includes investigation on medical expenses."], "answer": ["c"]}
{"problem_id": "112F36", "problem_text_en": "Which of the following are useful for distinguishing between iron-deficiency anemia and anemia associated with chronic disease? Select two.", "choices_en": ["Serum iron", "Red blood cell count (RBC)", "Serum ferritin", "Total iron binding capacity (TIBC)", "Mean corpuscular volume (MCV)"], "answer": ["c", "d"]}
{"problem_id": "112F37", "problem_text_en": "Which of the following is correct? Select two.", "choices_en": ["Emotional incontinence is observed in adjustment disorders.", "Bipolarity is characteristic of depression.", "Obsessive thinking is observed in obsessive-compulsive disorder.", "Confabulation is observed in Korsakoff syndrome.", "Word salad is characteristic of schizophrenia."], "answer": ["d", "e"]}
{"problem_id": "112F38", "problem_text_en": "Which of the following are correct about child abuse? Select two.", "choices_en": ["Reports of child abuse should be made to the public health center.", "Verbal abuse is not included in child abuse.", "Communication between children and parents cannot be restricted.", "Includes involving children in obscene acts.", "Anyone other than a physician who discovers a child who is suspected of being abused can report it."], "answer": ["d", "e"]}
{"problem_id": "112F39", "problem_text_en": "Which of the following are correct in warm-type autoimmune hemolytic anemia? Select two.", "choices_en": ["It is intravascular hemolysis.", "It is caused by IgM type antibodies.", "High levels of haptoglobin", "Indirect bilirubin is elevated.", "Direct Coombs test is positive."], "answer": ["d", "e"]}
{"problem_id": "112F40", "problem_text_en": "Which of the following are conditions that are likely to be associated with complete atrioventricular block? Select two.", "choices_en": ["Wolff-Parkinson-White Syndrome", "Hypertrophic cardiomyopathy", "Aortic valve stenosis", "Acute myocardial infarction (inferior wall)", "Cardiac sarcoidosis"], "answer": ["d", "e"]}
{"problem_id": "112F41", "problem_text_en": "Which of the following are implemented based on the Maternal and Child Health Law? Select two.", "choices_en": ["Maternal health examination during pregnancy and puerperium", "Neonatal care and medical treatment of premature infants", "Routine vaccinations during infancy and early childhood", "Research project for treating chronic specific diseases in children", "Establishment of child consultation centers"], "answer": ["a", "b"]}
{"problem_id": "112F42", "problem_text_en": "Which cytokines are therapeutic targets for the treatment of rheumatoid arthritis? Select two.", "choices_en": ["IL-4 means Interleukin-4.", "Interleukin-5", "IL-6 (Interleukin-6)", "Transforming growth factor beta (TGF-β)", "Tumor necrosis factor alpha (TNF-α)"], "answer": ["c", "e"]}
{"problem_id": "112F43", "problem_text_en": "Which of the following are correct regarding newborn mass screening using filter paper blood samples? Select two.", "choices_en": ["Take blood sample on day 1", "Blood sampling is performed from the lateral part of the heel.", "Apply blood sample twice on filter paper.", "After applying blood, dry it by hot air using gauze.", "Informed consent is necessary."], "answer": ["b", "e"]}
{"problem_id": "112F44", "problem_text_en": "Which of the following are factors that contribute to polypharmacy? Select three.", "choices_en": ["Increase in remaining drugs (in the body)", "Shortening of prescription duration", "Lack of cooperation/collaboration among medical institutions", "Prescriptions from multiple medical institutions", "Increase of elderly persons with multiple diseases"], "answer": ["c", "d", "e"]}
{"problem_id": "112F45", "problem_text_en": "A 62-year-old man was brought in by ambulance due to lower limb weakness. He has been drinking heavily and eating very little, and yesterday he fell asleep drunk on the floor without eating anything substantial since a light breakfast. He woke up at 5 a.m. today, but was unable to walk due to weakness in his legs and had to crawl to the phone to call for an ambulance at 6 a.m. He lives alone in a hot and humid room without air conditioning. He is conscious and alert. He is 165 cm tall and weighs 62 kg. His body temperature is 36.1°C. His heart rate is 124 bpm and regular, and his blood pressure is 86/54 mmHg. His respiratory rate is 28 breaths per minute. His SpO2 is 96% on room air. There are no abnormalities in heart or lung sounds. He complains of pain in the lower back and both thighs, but there is no aphasia. Muscle strength in both legs is graded as 2/5 on manual muscle testing, but there are no other neurological abnormalities. Urinalysis shows dark brown urine with a specific gravity of 1.022, pH of 6.0, 2+ protein, ± glucose, 1+ ketones, 3+ occult blood, no bilirubin, 1-4 red blood cells and 2-3 white blood cells per high power field, and granular and hyaline casts are seen. Blood test results show a red blood cell count of 3.3 million, hemoglobin of 12.0 g/dL, hematocrit of 33%, white blood cell count of 14,700, and platelet count of 170,000. What is the most likely condition in the patient?", "choices_en": ["Cerebral infarction/stroke", "Urinary tract calculi (stones)", "Urinary tract infection (UTI)", "Rhabdomyolysis", "Acute glomerulonephritis"], "answer": ["d"]}
{"problem_id": "112F46", "problem_text_en": "A 45-year-old man was found sitting in a hallway at a hospital with multiple departments, including a closed mental ward, and was taken into protective custody. When questioned by a hospital staff member, it was discovered that he was a patient receiving treatment at the hospital's psychiatric department, diagnosed with schizophrenia, living alone and had no immediate family with whom to contact easily. The patient stated that he was not sick and was only searching for a place to sleep in the hallway after hearing a voice instructing him to do so. Present at the time of the incident were an internal medicine resident, a psychiatrist with a certificate of qualification in mental health, and an on-call administrator. Following the psychiatrist's examination, hospitalization was deemed necessary. Despite repeated explanations from the psychiatrist about the need for inpatient treatment, the patient refused and insisted on staying in the hospital's hallway. What is the most appropriate form of hospitalization at this time?", "choices_en": ["Voluntary hospitalization", "Involuntary hospitalization", "Emergency hospitalization", "Medical care protection hospitalization", "Emergency admission"], "answer": ["c"]}
{"problem_id": "112F47", "problem_text_en": "A 70-year-old man comes to the hospital for regular follow-up after treatment for lung cancer. He was diagnosed with limited-stage small cell lung cancer with lymph node metastasis 6 months ago and received concurrent chemotherapy and chest radiation therapy. The chemotherapy lasted for 3 months, while the radiation therapy ended in 3 weeks. Currently, he has sputum and dyspnea on exertion, but there is no change compared to before the start of lung cancer treatment. He had previously undergone artificial valve replacement surgery for the mitral valve at the age of 63. His body temperature is 36.4℃, pulse rate is 68 beats/min and regular, blood pressure is 122/72 mmHg, and respiratory rate is 18 breaths/min. His SpO2 on room air is 97%. There are no abnormal respiratory sounds. Laboratory data: Hb 10.8 g/dL, WBC 5,400. CRP 0.9 mg/dL. His chest X-rays at the time of the lung cancer diagnosis and the current visit (A) and the irradiation field of the radiation therapy (B) are shown separately. What is the appropriate treatment?\n\n", "choices_en": ["Antibiotic administration", "Additional chemotherapy for cancer", "Additional thoracic radiation therapy", "Steroid pulse therapy", "Chest X-ray imaging after 1 week of follow-up observation."], "answer": ["e"]}
{"problem_id": "112F48", "problem_text_en": "A 42-year-old man came to the clinic for specific health guidance. His height is 170 cm, BMI is 25.5, and waist circumference is 94 cm. His blood pressure is 124/72 mmHg. His blood sugar level is 98 mg/dL and triglycerides are 160 mg/dL. He smokes 20 cigarettes per day for 22 years and hardly drinks alcohol. He has no noteworthy symptoms. He has not been undergoing regular check-ups or taking medication. He feels physically inactive due to his desk work. Which of the following is the appropriate response?", "choices_en": ["It is classified as active support level.", "The evaluation after health guidance will be conducted one year later.", "Instruction using methods such as telephone or email is not possible.", "It is necessary to uniformly implement standardized instructional content.", "There is no need to recommend exercise or weight control."], "answer": ["a"]}
{"problem_id": "112F49", "problem_text_en": "A 55-year-old woman presents with the chief complaint of abdominal fullness. Two months ago, the fullness appeared and gradually worsened. She is 154 cm tall, weighs 63 kg, has a body temperature of 36.7 °C, a pulse rate of 92/min, and a blood pressure of 136/86 mmHg. A 10-cm mass is palpated in the lower abdomen, with no tenderness. Ovarian cancer is suspected, and surgery is performed. There is no macroscopic dissemination in the abdominal cavity or ascites. Rapid intraoperative pathological examination reveals endometrioid adenocarcinoma arising from the right ovary. Which of the following does not require removal?", "choices_en": ["Greater omentum", "Cerebellar vermis", "Uterus", "Ovary", "Fallopian tube"], "answer": ["b"]}
{"problem_id": "112F50", "problem_text_en": "A 66-year-old woman presented with worsening posterior neck pain and left upper limb numbness as her chief complaints. She is receiving outpatient chemotherapy for advanced lung adenocarcinoma. She had previously experienced posterior neck pain due to cervical and thoracic vertebral metastases and had received acetaminophen and oxycodone for pain relief concurrently with chemotherapy. Although she had achieved good pain relief, she experienced an aggravation of posterior neck pain and new-onset left upper limb numbness two weeks ago, leading her to seek medical attention due to disturbed sleep. A chest CT scan at the soft-tissue window level of the first thoracic vertebra is shown separately. Which of the following is not an appropriate response?", "choices_en": ["Radiation therapy", "Laminectomy", "Increase in Oxycodone dose", "Addition of phosphate codeine", "Opioid rotation"], "answer": ["d"]}
{"problem_id": "112F51", "problem_text_en": "A neonate with postnatal age of 0. The mother is 42 years old, gravida 1, para 1. During a fetal ultrasound examination at 19 weeks of gestation, ventriculomegaly, cerebellar hypoplasia, and heart malformation were detected. The baby was delivered by cesarean section due to pelvic presentation at 37 weeks of gestation. The baby had weak spontaneous breathing at birth and required artificial respiratory support. The baby's measurements are as follows: height, 41.5 cm (-2.42 SD); birth weight, 1528 g (-3.72 SD); head circumference, 31.5 cm (-0.83 SD); and body temperature, 36.1°C. The baby's heart rate was 144 bpm and regular, while blood pressure was 60/30 mmHg. Mild coldness was observed at the distal limbs. The anus was flat, soft and dilated 2×2 cm. There were no abnormalities in heart and respiratory sounds. The abdomen was flat, soft and the liver and spleen were not palpable. The bowel sounds were weak, and muscle tone was poor. The external genitalia were male. The chest X-ray showed a cardiothoracic ratio of 58%. Photos of the head, hands and feet are presented separately. What could be the possible conditions?", "choices_en": ["Cri-du-chat syndrome", "Trisomy 13", "Trisomy 18", "Down Syndrome", "Klinefelter syndrome"], "answer": ["c"]}
{"problem_id": "112F52", "problem_text_en": "A 75-year-old woman underwent a colonoscopy for evaluation of persistent hematochezia and poor appetite, and was diagnosed with ascending colon cancer. She is anxious about undergoing surgery. She is 150 cm tall and weighs 46 kg. She lost 5 kg of weight over 3 months. Her temperature is 36.2°C, pulse rate is 72 beats per minute, blood pressure is 120/60 mmHg, and respiratory rate is 12 breaths per minute. Mild conjunctival anemia is observed. Chest and abdominal X-rays, as well as abdominal CT, do not suggest metastasis or obstruction in other organs, intestinal dilation, or ascites. Which of the following is appropriate for perioperative management of the patient?", "choices_en": ["There is no need to request for nutritional support team (NST) assistance.", "Antibiotics are not administered just before surgery.", "Drinking water is allowed up to 4 hours before surgery.", "Perform preoperative central venous nutrition.", "Remain on bedrest for more than 72 hours after surgery."], "answer": ["c"]}
{"problem_id": "112F53", "problem_text_en": "A 12-year-old girl was transported to the emergency room in a hypoglycemic coma. She developed type 1 diabetes at age 11 and has been receiving intensive insulin therapy. She lost consciousness during physical education class. Upon arrival, her blood glucose level was 22 mg/dL, and after an infusion of 20% glucose solution, her consciousness recovered in 2 minutes. She was admitted for examination and treatment. During the interview after admission, she stated, \"I thought I might have low blood sugar, but I don't have any teachers or friends at my new junior high school to consult with, and it was difficult to measure my blood sugar, so I passed out without realizing it.\" Which of the following is not an appropriate instruction for her school life after discharge?", "choices_en": ["Introducing a summer camp for pediatric diabetes.", "Instruct to always carry a stick of sugar.", "Teach that it is easy to become hypoglycemic after physical education classes.", "Requesting the homeroom teacher to facilitate the provision of an environment that enables self-monitoring of blood glucose.", "Instruct the homeroom teacher to administer a subcutaneous insulin injection if the student loses consciousness."], "answer": ["e"]}
{"problem_id": "112F54", "problem_text_en": "A 54-year-old man presents with a chief complaint of vomiting blood. Three days ago, he had black stools but had ignored it. However, because he had a cupful of vomiting blood this morning, he visited the emergency department. He is alert and awake with a body temperature of 36.4°C, pulse rate of 124 beats/minute, regular, blood pressure of 86/60 mmHg, respiratory rate of 20 breaths/minute, and moist skin. His extremities are cold and pale. The conjunctiva is slightly anemic but there is no yellowing in the sclera. The abdomen is flat and tender to palpation in the epigastric region, but there is no muscular defense. First, rapid infusion therapy was initiated, and the pulse rate decreased to 96 beats/minute and the blood pressure increased to 104/68 mmHg. What should be done next?", "choices_en": ["Blood transfusion", "Angiography", "Open surgery", "Upper gastrointestinal endoscopy", "Proton pump inhibitor intravenous injection"], "answer": ["d"]}
{"problem_id": "112F55", "problem_text_en": "A 28-year-old primiparous woman was admitted for the onset of labor at 39 weeks and 0 days of gestation. There were no abnormalities in her pregnancy course thus far. On admission, cervical examination revealed the cervix to be 3 cm dilated, 50% effaced, station at -2 cm, of moderate consistency, and positioned posteriorly. What is the Bishop score for this patient?", "choices_en": ["5 points", "6 o'clock", "7 points", "8 o'clock", "9 o'clock"], "answer": ["a"]}
{"problem_id": "112F56", "problem_text_en": "A 28-year-old woman presents with fever, joint pain in her fingers, and a rash. She had been experiencing joint pain in both her fingers for 2 months, and visited the clinic because she developed discoid rash on her cheeks 2 weeks ago. Her body temperature is 38.3°C. Her pulse is 84/min and regular. Her blood pressure is 120/80 mmHg, and her respiratory rate is 18/min. Swelling and tenderness are noted in both hand joints. Urinalysis showed no protein or occult blood. Blood tests show hemoglobin level: 11.1 g/dL, white blood cell count: 3,000/μL (neutrophils 70%, monocytes 4%, lymphocytes 26%), platelet count: 110,000/μL. Biochemical analysis showed blood urea nitrogen: 10 mg/dL, creatinine: 0.5 mg/dL, and immunological studies showed CRP: 0.2 mg/dL, negative rheumatoid factor, anti-nuclear antibody: 1,280-fold (reference value less than 20), anti-dsDNA antibody: 84 IU/mL (reference value less than 12), CH50: 12 U/mL (reference value 30-40), C3: 33 mg/dL (reference value 52-112), and C4: 7 mg/dL (reference value 16-51). Which is the most appropriate explanation to give to the patient?", "choices_en": ["\"There is a high possibility of joint deformity\"", "\"Please avoid getting pregnant until your medical condition stabilizes.\"", "\"We will start with a medication called methotrexate.\"", "\"Please avoid receiving influenza vaccination from now on.\"", "\"Please try to sunbathe as much as possible to improve the rash\""], "answer": ["b"]}
{"problem_id": "112F57", "problem_text_en": "A newborn infant immediately after birth was delivered by emergency cesarean section due to placental abruption at 38 weeks and 3 days' gestation. The Apgar score was 0 (1 minute) and the infant was resuscitated immediately. Which item in the Apgar score is likely to reach a score of 1 or more first?", "choices_en": ["Breathing", "Heartbeat", "Skin color", "Muscle stiffness/spasticity", "Response to stimulus"], "answer": ["b"]}
{"problem_id": "112F58", "problem_text_en": "A 25-year-old male in his first year of residency at a hospital had a needle stick accident while collecting blood from a patient under his care. The patient had chronic hepatitis C and the virus is not currently cleared. The resident tested negative for HCV antibodies at the time of employment. Immediately after the needle stick, he squeezed out blood from the wound into running water and informed a physician in charge of infection control department. Which of the following explanations to the resident is appropriate for the physician to give after being contacted?", "choices_en": ["\"Let's get vaccinated now\"", "\"Let's administer gamma globulin right away\"", "\"It is said that the probability of developing hepatitis C is about 20%.\"", "\"Let's test for the presence of hepatitis C virus infection after one week.\"", "\"You cannot receive medical treatment for 1 week, so please stay at home and wait.\""], "answer": ["d"]}
{"problem_id": "112F59", "problem_text_en": "A 28-year-old primigravida presents with complaints of nausea and vomiting at 10 weeks of pregnancy. Nausea and vomiting began at around 7 weeks of pregnancy and gradually worsened. She has had difficulty eating for a week, and has had difficulty walking on her own for two days, requiring assistance from her husband to come to the hospital. She has no significant medical history. The patient is alert and oriented. She is 161 cm tall, and her pre-pregnancy weight was 55 kg, currently 48 kg. Her temperature is 36.9°C. Her pulse is regular at 92 bpm and her blood pressure is 92/56 mmHg. Respiratory rate is 20 bpm. Her skin is dry, and there is no scleral yellowing. Her abdomen is flat and soft, and liver and spleen are not palpable. Urinalysis shows light brown color, mild turbidity, protein 3+, glucose 1+, ketone 4+. Labs show RBC 3.96 million/μl, Hb 14.1 g/dL, Ht 42%, and WBC 13,100/μl. Serum total protein is 7.4 g/dL, AST 30 U/L, ALT 22 U/L, blood glucose 92 mg/dL, Na 126 mEq/L, K 3.6 mEq/L, and Cl 100 mEq/L. CRP is 0.2 mg/dL. Transvaginal ultrasonography shows a gestational sac in the uterus. The fetal heart rate is positive, and the crown-rump length (CRL) is 33 mm. What should be done first?", "choices_en": ["Oral administration of thickened fluid food", "Administration of enteral nutrition via a gastric tube.", "Massive intravenous infusion of physiological saline solution", "Rapid intravenous infusion of 20% glucose solution", "Intravenous administration of maintenance fluid containing vitamin B₁"], "answer": ["e"]}
{"problem_id": "112F60", "problem_text_en": "A 38-year-old man with no previous medical history presented to the clinic with jaundice and right hypochondriac pain which started two weeks ago. He has no smoking history and drinks alcohol occasionally. He has been working in a printing factory doing printing work since he was 20 years old. Abdominal ultrasound examination revealed a tumor in the hepatic hilum. Which of the following should be evaluated for diagnosis?", "choices_en": ["Smoking regulations in the workplace", "Medical examination visit status in the last 5 years", "Status of working overtime in the past 3 months", "Usage of dust mask during working", "Types of organic solvents that have been used in the past work."], "answer": ["e"]}
{"problem_id": "112F61", "problem_text_en": "A 52-year-old man presents with chief complaints of generalized edema and nocturnal dyspnea. He was diagnosed with diabetes at 42 years of age and has been self-administering insulin injections. Two years ago, he was found to have high levels of proteinuria and serum creatinine. The edema gradually worsened over the past two months and he sought medical attention three days ago when he became increasingly dyspneic in the supine position. He is 170 cm tall and weighs 85 kg. His pulse rate is 88 beats/min and regular. His blood pressure is 190/100 mmHg, and respiratory rate is 24 breaths/min. Generalized edema is observed throughout his body. Laboratory findings include: erythrocytes 3.23 million/µL, Hb 9.2 g/dL, Ht 28%, platelets 260,000/µL, TP 6.4 g/dL, albumin 3.0 g/dL, BUN 88 mg/dL, serum creatinine 9.0 mg/dL, uric acid 8.6 mg/dL, blood glucose 116 mg/dL, HbA1c 6.3% (reference range 4.6-6.2%), Na 141 mEq/L, K 5.0 mEq/L, Cl 110 mEq/L, and fasting C-peptide 1.2 ng/dL (reference range 0.6-2.8 ng/dL). Which of the following treatments is not indicated for this patient?", "choices_en": ["Hemodialysis", "Peritoneal dialysis", "Living donor kidney transplant.", "Kidney transplantation after cardiac arrest", "Simultaneous pancreas-kidney transplant in brain dead donor"], "answer": ["e"]}
{"problem_id": "112F62", "problem_text_en": "A 77-year-old man visited the hospital because his left eye became very red after taking a bath. He feels a burden in the eye, but there is no pain or discharge. His vision is 0.5 OD (1.2 x -0.75D) and 0.6 OS (1.2 x -0.5D), and the intraocular pressure is 14 mmHg in the right eye and 13 mmHg in the left eye. An anterior segment photograph of the left eye is shown separately. What is the appropriate response?", "choices_en": ["Pressure eye patch", "Observation (in a medical context, it refers to monitoring a patient's condition without actively intervening or treating)", "Subconjunctival irrigation", "Eye massage", "Application of antibacterial eye ointment"], "answer": ["b"]}
{"problem_id": "112F63", "problem_text_en": "A 72-year-old woman was brought to the emergency room after sustaining burns in a house fire. She complained of difficulty breathing and was transported with supplemental oxygen. She was alert and her body temperature was 36.8°C. Her heart rate was 120 beats per minute, regular, and blood pressure was 150/84 mmHg. She had a respiratory rate of 26 breaths per minute, and her SpO2 was 96% (with 6 liters/minute of oxygen administered via mask). The burns were limited to her face and both forearms, with no burns on the anterior neck or other body parts. Soot was present on her face and in her mouth, and her nose hairs were singed. She could speak but with hoarseness and continued to complain of difficulty breathing. Which of the following is the most appropriate airway management for this patient?", "choices_en": ["Tracheal intubation", "Tracheotomy", "Incision of the cricoid-thyroid ligament.", "Nasopharyngeal airway insertion", "Insertion of laryngeal mask"], "answer": ["a"]}
{"problem_id": "112F64", "problem_text_en": "A 90-year-old woman presents with a chief complaint of fever. She had a cerebral hemorrhage 6 years ago, which caused a decline in her activities of daily living (ADL), and she now resides in a long-term care facility. She has had a fever in the 38 degree Celsius range for 3 days, and chest X-ray reveals pneumonia. What is the most likely pathogen to be detected from this patient's sputum?", "choices_en": ["Escherichia coli", "Klebsiella pneumoniae", "Pseudomonas aeruginosa (an infectious bacteria)", "Streptococcus pneumoniae", "Staphylococcus epidermidis"], "answer": ["d"]}
{"problem_id": "112F65", "problem_text_en": "A 30-year-old woman accompanied by her concerned mother visited the hospital due to a weight loss of 6kg over the past two years. She denies any drug use and reports eating, albeit with reduced intake. She is 156cm tall, weighs 38kg, has a body temperature of 37.0℃, a pulse rate of 72 beats per minute, regular rhythm, and blood pressure of 90/52mmHg. She appears apathetic, showing a lack of expression and minimal verbal response during the interview. Pigmentation is noted on her oral mucosa and on her limbs and trunk. Laboratory findings include a red blood cell count of 3.41 million and white blood cell count of 2,500. Blood test results show a fasting blood glucose level of 62 mg/dL, Na level of 132 mEq/L, and K level of 5.6mEq/L. Which combination of diagnostic tests will be required for diagnosis?", "choices_en": ["ACTH and cortisol", "Free thyroxine and TSH", "Insulin and anti-insulin antibodies", "Plasma renin activity and aldosterone", "Plasma catecholamines and urinary metanephrines"], "answer": ["a"]}
{"problem_id": "112F66", "problem_text_en": "A 5-year-old girl presents to the clinic with fever and pain in both ears. Three days ago, she developed nasal discharge and cough, which were left untreated. Fever and pain in both ears started yesterday, and her response to her mother's calls deteriorated. She is irritable, has decreased appetite, and has a body temperature of 39.2℃. Examination of her respiratory sounds reveals no abnormalities. No abnormalities detected in other physical examinations. No abnormalities are detected in her auricles or external auditory canals. The left tympanic membrane is shown separately. Which of the following treatments are appropriate? Select two.", "choices_en": ["Tympanotomy", "Ear tube ventilation", "Antibiotic administration", "Nasal irrigation (sinus rinse)", "Intravenous administration of adrenal cortex steroid"], "answer": ["a", "c"]}
{"problem_id": "112F67", "problem_text_en": "A 65-year-old man was pointed out to have microscopic hematuria during a routine health checkup and came to the hospital. There is no significant medical history. He has been smoking 20 cigarettes per day for 40 years and drinking about 1 go of Japanese sake per day. Urinalysis: negative for protein, 1+ for occult blood, 10-20 red blood cells per high power field in sediment. Which of the following tests should be performed next? Select two.", "choices_en": ["Renal scintigraphy", "Urinary cytology examination.", "Cystourethrography", "Abdominal ultrasonography", "Renogram"], "answer": ["b", "d"]}
{"problem_id": "112F68", "problem_text_en": "A 24-year-old woman complains of amenorrhea and visits the hospital. She suspected pregnancy as her menstrual cycle has been irregular with a length of 28 to 56 days, and she has not had her period for more than two months since her last menstrual period. The uterus is anteverted and soft, and larger than normal size. Urine pregnancy test is positive, and the diagnosis is a twin pregnancy. Which of the following explanations are correct for the woman? Choose two.\n\n", "choices_en": ["\"The two placentas will be separate.\"", "\"Usually, the genders of two individuals are different.\"", "\"There may be a difference in the amount of amniotic fluid between the two.\"", "\"Two people are seperated by a membrane called the amniotic membrane.\"", "\"There is a risk of two umbilical cords getting tangled with each other\""], "answer": ["c", "d"]}
{"problem_id": "112F69", "problem_text_en": "Read the following passage and answer questions 69-71. \n\nA middle-aged woman was brought in by ambulance due to impaired consciousness. Present illness: She was found collapsed in her hotel room by an employee who called an ambulance due to poor response. She was having seizures at the time of the ambulance's arrival but stopped immediately after transport began. Past history: Unknown Life history: Unknown Family history: Unknown Present symptoms: JCS II-20 level of consciousness. She is 160 cm tall and weighs 50 kg. Her body temperature is 38.6°C. Heart rate is 106 bpm and regular. Blood pressure is 94/50 mmHg. Respiratory rate is 24 bpm. SpO2 is 100% (with a mask and 5 L/min oxygen delivery). The skin is somewhat dry. Pupil diameter on both sides is 6.5 mm, and the light reflex is slightly slow on both sides. No abnormalities are observed in the conjunctiva or sclera. The oral cavity is dry. No jugular vein distension is seen. No abnormalities are observed in heart sounds or breath sounds. The abdomen is flat, soft, without palpable liver or spleen. Bowel sounds are decreased. There is no paralysis in the limbs, and the tendon reflex is normal. Examination findings: Urine analysis: no protein, glucose, ketones, or white blood cells observed in the sediment. Blood test results: red blood cells 4.5 million, Hb 13.9 g/dL, Ht 42%, white blood cells 11,200, platelets 160,000, PT-INR 1.2 (standard 0.9-1.1). Blood biochemistry results: total protein 7.0 g/dL, albumin 3.9 g/dL, total bilirubin 0.9 mg/dL, direct bilirubin 0.2 mg/dL, AST 46 U/L, ALT 32 U/L, CK 1,500 U/L (standard 30-140), blood urea nitrogen 18 mg/dL, creatinine 0.8 mg/dL, blood glucose 98 mg/dL, Na 141 mEq/L, K 4.5 mEq/L, Cl 102 mEq/L. Arterial blood gas analysis (with a mask and 5 L/min oxygen delivery): pH 7.35, PaCO2 28 Torr, PaO2 100 Torr, HCO3- 15 mEq/L. Electrocardiogram shows sinus rhythm with prolonged QRS width and extended QT intervals. There is no ST-T change. Chest X-ray shows no abnormalities in the cardiothoracic ratio or pulmonary fields. No abnormalities are observed in the head CT. Information was obtained that showed multiple empty drug packages were thrown away in the hotel room's waste bin. What is the most likely drug?", "choices_en": ["Narcotics", "Cholinergic agent", "Tricyclic antidepressants", "Sympathomimetic agent", "Benzodiazepine hypnotics (sleeping pills)"], "answer": ["c"]}
{"problem_id": "112F70", "problem_text_en": "Which specimen is used for rapid and simple qualitative identification of toxic substances?", "choices_en": ["Urine", "Stool (or feces)", "Gastric juice", "Blood", "Cerebrospinal fluid (CSF)"], "answer": ["a"]}
{"problem_id": "112F71", "problem_text_en": "Which monitoring is most important for potential future complications?", "choices_en": ["Electrocardiogram (ECG/EKG)", "Sustained brain waves", "Central venous pressure", "Invasive arterial pressure", "SpO$_2$ (pronounced \"s-p-o-two\") is the symbol for peripheral capillary oxygen saturation, a measure of the percentage of oxygen-saturated hemoglobin in the blood. It is usually measured by pulse oximetry, a non-invasive method for monitoring a person's oxygen saturation."], "answer": ["a"]}
{"problem_id": "112F72", "problem_text_en": "Read the following passage and answer questions 72-74. \n\nA 76-year-old man comes to the hospital with complaints of abdominal pain and diarrhea. He has a history of loose stools, sometimes watery, since his 50s. He developed diarrhea and abdominal pain early in the morning and went to a local clinic where he received intravenous fluid therapy. He did not improve and was referred to our hospital. He denies any bloody stool or vomiting. He was diagnosed with irritable bowel syndrome when he was 55 and received treatment for 6 months. He has been taking a statin and calcium channel blocker at a local clinic since he was 65 for hypertension and dyslipidemia. He has been prescribed donepezil hydrochloride since he was 75 for Alzheimer's-type dementia. His father had gastric cancer and his mother had a stroke. He worked for a trading company and was stationed in Southeast Asian countries from 48 to 60 years old. \n\nPresently, he is alert and conscious, with a height of 173 cm and a weight of 66 kg. His temperature is 37.1°C, his pulse rate is 88/min and regular, his blood pressure is 120/60 mmHg, his respiratory rate is 14/min, and his SpO2 is 98% on room air. There are no abnormalities in the conjunctiva or sclera. There is no distension of the jugular vein. There are no abnormalities in the heart sounds or breath sounds. The entire lower abdomen is tender, but there is no rebound tenderness. The liver and spleen are not palpable. Bowel sounds are hyperactive. \n\nUrine analysis shows proteinuria 1+, glucose (−), ketones 3+, occult blood (−), and no white blood cells in the sediment. Blood examination shows red blood cells 4.97 million/µL, hemoglobin 14.9 g/dL, hematocrit 44%, white blood cells 11,700 (neutrophils 77%, eosinophils 4%, monocytes 6%, lymphocytes 13%), and platelets 320,000/µL. Chemistry of blood shows total protein 6.0 g/dL, albumin 3.3 g/dL, total bilirubin 1.1 mg/dL, AST 8 U/L, ALT 10 U/L, LD 156 U/L (reference range 176-353), ALP 147 U/L (reference range 115-359), γ-GTP 25 U/L (reference range 8-50), blood urea nitrogen 14 mg/dL, creatinine 1.0 mg/dL, uric acid 5.9 mg/dL, blood glucose 101 mg/dL, HbA1c 5.4% (reference range 4.6-6.2), triglycerides 85 mg/dL, HDL cholesterol 54 mg/dL, LDL cholesterol 116 mg/dL, sodium 139 mEq/L, potassium 3.3 mEq/L, and chloride 103 mEq/L. A photo of microorganisms identified by stool examination is shown separately. What is the probable causative microorganism?", "choices_en": ["Amoebic dysentery", "Pathogenic E. coli", "Giardia lamblia", "Clostridium difficile (a type of bacteria)", "Campylobacter jejuni"], "answer": ["c"]}
{"problem_id": "112F73", "problem_text_en": "Which one should be additionally confirmed?", "choices_en": ["History of trauma", "Insect bite mark", "History of antibiotic use", "History of sexual contact with the same sex", "Presence or absence of pet ownership"], "answer": ["d"]}
{"problem_id": "112F74", "problem_text_en": "Progression after hospitalization: On the 20th day of hospitalization, the patient began to frequently complain about the loss of their wallet. The nurse explained that it was kept in the valuables box, but the patient stated that they had no memory of it. What other symptoms are likely to accompany this condition?", "choices_en": ["Expressive language", "Hoarding disorder", "Cover-up/excuse-making/facade", "Leaving-behavior or exit-behavior", "REM sleep behavior disorder"], "answer": ["c"]}
{"problem_id": "112F75", "problem_text_en": "Read the following passage and answer questions 75-77. A 49-year-old woman was brought in by ambulance due to consciousness disturbance. Medical history: for the past 2 months, she has experienced dizziness several times while shopping in the evening, and subsequently received intravenous drips at a local medical institution before returning home. No anomalies were found in the Holter ECG, and she had undergone brain wave and head CT, but has not received the results yet. Her husband found her unconscious at home and called for an ambulance, which took her to the emergency department of a general hospital. Past medical history (information from husband): nothing worth noting. Menstrual cycle is unclear. Data from specific health checkup (3 weeks ago): Hb 11.4 g/dL, white blood cell count 3,100, blood glucose 68 mg/dL, Na 132 mEq/L. Lifestyle: housewife. Living with husband only; their 2 college-age children live separately. Family history: nothing worth noting. Current symptoms: unresponsive with eyes closed, but reacts to painful stimuli. Height 156cm. Weight could not be measured, but according to her husband, she has lost weight. Pulse rate: 76/min, regular; blood pressure: 102/56 mmHg. No abnormalities found in chest or abdomen. Her arms and legs occasionally move, and no paralysis or relaxation is observed. Since her blood sugar level measured using glucometer was 35 mg/dL, 20mL of 20% glucose solution was administered intravenously, and three minutes later, she was able to sit up and respond to calls. She was admitted for observation and further examination. Which of the following information should be highly prioritized when collecting information from this patient? Select three. \n\n", "choices_en": ["Menstrual history", "History of overseas travel", "Medication history", "Accurate weight history", "History of pet ownership"], "answer": ["a", "c", "d"]}
{"problem_id": "112F76", "problem_text_en": "Additional information (obtained by interviewing the patient after regaining consciousness): After two deliveries, menstruation returned to normal, but has been slightly irregular recently. Fish oil supplements are taken, but there is no regular medication. The patient's family goes on overseas trips every other year, and the last one was a visit to the US West Coast a year ago. The patient has kept a dog indoors for over 10 years. The patient has lost 5 kg of weight in the last year and is currently weighing 48 kg. Progress afterward: After the glucose infusion, the disturbance of consciousness improved and there was no further deterioration, so observation was continued until the next morning while infusing maintenance fluid of 1,000 mL. On examination the following morning, the disturbance of consciousness had again worsened and the patient was unable to communicate. Vital signs were normal. Blood test results showed glucose 82 mg/dL, Na 112 mEq/L, K 3.9 mEq/L, and Cl 78 mEq/L. CRP was 0.3 mg/dL. Arterial blood gas analysis was normal. Emergency head CT scan showed no abnormalities. What is the most likely cause of this patient's disturbance of consciousness?", "choices_en": ["Anterior pituitary hypofunction", "Overconsumption of supplements", "Recurrent hypoglycemia", "Coma caused by hydrocephalus or mucinous cystadenoma", "Aseptic meningitis"], "answer": ["a"]}
{"problem_id": "112F77", "problem_text_en": "What should be done in conjunction with reviewing the fluid infusion?", "choices_en": ["Administer antiviral medication.", "Discontinue the use of supplements.", "Administer thyroid hormones.", "Infuse 20% glucose solution intravenously.", "Administering adrenal cortex steroids."], "answer": ["e"]}
{"problem_id": "112F78", "problem_text_en": "Read the following passage and answer questions 78 to 80:\nA 59-year-old man was admitted by ambulance for severe chest pain and shortness of breath. Medical history: he had been aware of choking sensation and shortness of breath in the anterior chest during jogging for about 5 minutes three days ago, but the symptoms disappeared after a rest of about 10 minutes. Today, at 6:30 a.m., he developed chest pain and shortness of breath, which persisted for more than an hour, so he called for an ambulance. Medical history: He has been taking antihypertensive drugs for hypertension for 5 years. Present condition: He is slightly confused but responds to calls. He is 176 cm in height and weighs 82 kg, with a body temperature of 36.6℃. Heart rate is 114/min and irregular. Blood pressure is 90/46 mmHg. Respiratory rate is 28/min. SpO2 is 89% under 10 L/min oxygen administration with a reservoir mask. He has cold sweat and feels cool in the distal limbs. There is no heart murmur, but a III sound is heard. Crackles are heard in both lung fields. The abdomen is flat, soft, and without palpable liver or spleen. There is no edema in the lower legs. Laboratory findings: Hematology: red blood cells 5.2 million, Hb 16.3 g/dL, Ht 51%, white blood cells 15,800, and platelets 190,000. Blood biochemistry: total protein 7.0 g/dL, AST 14 U/L, ALT 18 U/L, CK 420 U/L (reference range: 30-140), and creatinine 1.8 mg/dL. Echocardiography revealed an end-diastolic diameter of the left ventricle of 51 mm, wall movement was decreased circumferentially from the base, and the left ventricular ejection fraction was 14%. The electrocardiogram is shown below. After intubation in the emergency room, coronary angiography was planned. When moved to the catheter room, a large arterial intra-aortic balloon pump (IABP) was inserted first. Which of the following is an incorrect management of IABP in this patient?\n\n(Note: the question numbers may be different due to missing context in the translation.)", "choices_en": ["Antithrombotic therapy will be performed after the catheterization.", "An increase in coronary blood flow can be expected.", "Inflate the balloon during systole.", "After catheter placement, be aware of the onset of lower limb ischemia.", "Ensure that the tip of the balloon does not cross over the aortic arch."], "answer": ["c"]}
{"problem_id": "112F79", "problem_text_en": "Here is a separate image of the coronary angiography that was urgently performed. Which lesion is responsible for the coronary artery blockage?", "choices_en": ["Diagonal branch", "Right coronary artery", "Left anterior descending branch", "Left circumflex coronary artery", "Left main coronary artery"], "answer": ["e"]}
{"problem_id": "112F80", "problem_text_en": "After treatment, the patient was admitted to the ICU for total body management. A separate ECG taken on the second day after admission is shown below. Which of the following is not observed?", "choices_en": ["Q wave in lead I and aVL", "ST elevation in Lead II", "Q wave in V2 lead", "Inversion of T waves in V2 and V3 leads", "A decrease in R wave in left precordial leads"], "answer": ["b"]}
{"problem_id": "112F81", "problem_text_en": "Read the following text and answer questions 81-83.\n\nA 73-year-old woman presented with pain in her right buttock to knee. Present illness: She had been experiencing pain in her right buttock to knee when standing up or walking for long periods of time since around 60 years of age. Two years ago, she visited an orthopedic clinic near her home where she was diagnosed with deformation of the right hip joint by X-ray and instructed to walk while placing her right hand on her right knee. However, she did not continue to visit the clinic. Three months ago, when the pain worsened and walking became even more difficult, she came to our clinic after becoming unable to go out, although she could still walk in the house using walls for support. Past medical history: She has been treated with medication for hypertension at an internal medicine clinic near her home for 18 years. She has been prescribed drugs for constipation and sleep disorders at the same clinic. She has also received eye drops for mild cataracts at an ophthalmology clinic. For the last 2 months, she has been applying over-the-counter medicinal adhesive patches and taking painkillers for pain in her right buttock to knee. Life history: She lives with her husband, eldest son and his wife, and two grandchildren; her eldest son and his wife both work. Her grandchildren are in junior college and high school. Until 3 months ago, she was responsible for most of the housework. Family history: Nothing noteworthy. Present condition: She is conscious and alert. Her height is 156 cm, weight 53 kg. Her body temperature is 36.3°C. Her pulse rate is 64 bpm, regular. Her blood pressure is 130/72 mmHg. Her respiratory rate is 14 bpm. Her SpO2 is 98% on room air. There is no palpable neck lymph node. No abnormalities are noted in the chest and abdomen. She needs assistance to stand up due to pain in her right buttock to knee, and cannot walk without support. Examination findings (on outpatient consultation): Urinalysis: protein (−), glucose (−), ketone bodies (−), occult blood (−). Blood tests: Red blood cells 3.9 x 106/uL, hemoglobin 12.0 g/dL, hematocrit 38%, white blood cells 5,800/uL, platelets 240,000/uL. Blood biochemistry tests: total protein 6.8 g/dL, albumin 3.8 g/dL, total bilirubin 0.7 mg/dL, AST 15 U/L, ALT 17 U/L, LD 220 U/L (reference range 176-353), ALP 153 U/L (reference range 115-359), γ-GTP 28 U/L (reference range 8-50), amylase 76 U/L (reference range 37-160), CK 40 U/L (reference range 30-140), blood urea nitrogen 16 mg/dL, creatinine 0.8 mg/dL, blood glucose 84 mg/dL, Na 139 mEq/L, K 4.1 mEq/L, Cl 109 mEq/L. CRP 0.2 mg / dL. Which of the following physical examinations is not useful for differential diagnosis of the cause of pain from the right buttock to knee?", "choices_en": ["Percussion of costovertebral angle (CVA)", "Range of motion of the hip joint", "Palpation of the inguinal region", "Palpation of the thigh region", "Palpation of the knee joint"], "answer": ["a"]}
{"problem_id": "112F82", "problem_text_en": "Subsequent course: Following examination at the outpatient clinic, surgery to replace the right hip joint with an artificial joint was scheduled. A system review during hospitalization showed that the patient experienced mild dizziness during nocturnal trips to the bathroom. Neurological examination revealed no abnormalities that could cause dizziness, except for weakness in the right lower limb. Which of the following medications prescribed to the patient may contribute to dizziness? Select three.", "choices_en": ["Nonsteroidal anti-inflammatory drugs (NSAIDs)", "Antihypertensive drug", "Sleeping pills", "Intestinal regulator", "Eye drops"], "answer": ["a", "b", "c"]}
{"problem_id": "112F83", "problem_text_en": "Which of the following should be confirmed with the patient for planning postoperative rehabilitation? Select three.\n\n(Note: The options are not provided in the given text, so I cannot translate them. Please provide the options if you want me to translate them.)", "choices_en": ["Patient's desired lifestyle or Patient's envisioned lifestyle", "Bedding currently being used", "Vaccination history", "Structure of the entranceway", "Academic background/educational history"], "answer": ["a", "b", "d"]}
{"problem_id": "112F84", "problem_text_en": "Assuming the population and number of births of women aged 15-49 in a certain area are as shown in the table below:\n\nAge Group | Number of Births | Female Population (Male/Female)\n---|---|---\n15-19 | 2,100 each | 2,000 each\n20-39 | 5,200 each | 5,000 each\n40-49 | 1,100 each | 1,000 each\nTotal Female Population (Ages 15-49)| | 3,500,000\n\nCalculate the total fertility rate (TFR), rounded to the nearest hundredth if necessary. Answer: 1.0-1.4.", "choices_en": [], "answer": ["1.2"]}
