{"problem_id": "112B1", "problem_text_en": "Which of the following statements about standard precautions is correct?", "choices_en": ["Isolate the patient.", "Thoroughly implement healthcare worker hand hygiene.", "Start after diagnosis of the infection.", "Treatment ends once the infection is cured.", "Implemented as a measure to specific infectious diseases."], "answer": ["b"]}
{"problem_id": "112B2", "problem_text_en": "Which of the following is incorrect for promoting patient safety within a medical institution?", "choices_en": ["To conduct training about medical safety.", "Conduct a review of a close-call incident.", "Understand that anyone can make mistakes.", "Comply with verbal confirmation and pointing when using medication.", "The purpose of conducting medical accident investigations is to pursue responsibility."], "answer": ["e"]}
{"problem_id": "112B3", "problem_text_en": "In triaging multiple casualties, which triage tag should be applied to a patient with a pulse rate of 108/min, regular rhythm, respiratory rate of 14/min, inability to walk, and ability to follow simple commands?", "choices_en": ["Black tag", "Red tag", "Yellow tag", "Green tag", "Untagged"], "answer": ["c"]}
{"problem_id": "112B4", "problem_text_en": "Which of the following is correct in the examination of the musculoskeletal system in adults?", "choices_en": ["If only muscle contraction is observed during manual muscle testing, it is evaluated as 1.", "The lower leg circumference is measured at a point 5 cm distal to the inferior edge of the patella.", "Lower limb length is measured from the pubic symphysis to the tip of the big toe.", "The range of motion of the knee joint is measured in six directions.", "Thigh circumference should be measured at maximal girth."], "answer": ["a"]}
{"problem_id": "112B5", "problem_text_en": "What is the most important thing to confirm before performing a contrast CT scan?", "choices_en": ["Smoking history", "Alcohol history", "Liver function", "Renal function", "Cognitive function"], "answer": ["d"]}
{"problem_id": "112B6", "problem_text_en": "Which of the following questions is not appropriate for understanding the interpretation model?", "choices_en": ["\"Could you describe your symptoms?\"", "\"What kind of treatment do you think will be necessary?\"", "\"How will your lifestyle change when you recover from your illness?\"", "\"What kind of difficulties do you have due to your illness?\"", "\"Do you have any idea of the possible causes?\""], "answer": ["a"]}
{"problem_id": "112B7", "problem_text_en": "Which of the following is most closely related to the development of cervical cancer?", "choices_en": ["Alcohol consumption", "Smoking", "Sleep", "Salt intake", "Physical activity"], "answer": ["b"]}
{"problem_id": "112B8", "problem_text_en": "Which of the following is correct regarding the pathophysiology of acute respiratory distress syndrome (ARDS)?", "choices_en": ["Reduction of dead space in the lungs", "Decrease in intrapulmonary shunt", "Increased pulmonary vascular permeability", "Increased pulmonary surfactant", "Increase in lung compliance"], "answer": ["c"]}
{"problem_id": "112B9", "problem_text_en": "Which of the following is most strongly associated with the onset of presbycusis (age-related hearing loss)?", "choices_en": ["Tympanic membrane", "Eustachian tube", "Auditory ossicles", "Labyrinthine artery", "Germ cells"], "answer": ["e"]}
{"problem_id": "112B10", "problem_text_en": "Which one is an interventional study?", "choices_en": ["Cross-sectional study", "Cohort study", "Case-control study", "Case series study", "Randomized controlled trial (RCT)"], "answer": ["e"]}
{"problem_id": "112B11", "problem_text_en": "Which combination of oxygen delivery methods, oxygen flow rates, and expected oxygen inhalation concentrations is correct?", "choices_en": ["Nasal cannula 2L/min - 20%", "Nasal cannula 4L/min --------- 50% (referring to the administration of oxygen therapy)", "Mask 6L/min --------- 80% (This appears to represent the flow rate and oxygen concentration of an oxygen mask.)", "Reservoir mask 7 L/min – 50% oxygen concentration", "Reservoir mask 10L/min ------ 90% or higher"], "answer": ["e"]}
{"problem_id": "112B12", "problem_text_en": "What are the characteristics of low back pain caused by aortic dissection?", "choices_en": ["Sudden onset", "Preceded by several days of high fever", "Reduction of pain with forward bending", "Relief of pain caused by compression", "Variation in pain intensity due to respiration"], "answer": ["a"]}
{"problem_id": "112B13", "problem_text_en": "Which symptom of acute sinusitis suggests the need for emergency surgery?", "choices_en": ["Nasal congestion", "Pain in the cheek", "Purulent nasal discharge", "Decreased vision", "Olfactory dysfunction (reduced sense of smell)"], "answer": ["d"]}
{"problem_id": "112B14", "problem_text_en": "Which examination is performed after pupil dilation?", "choices_en": ["Visual field test", "Function test", "Gonioscopy", "Binocular visual function test", "Fluorescein angiography"], "answer": ["e"]}
{"problem_id": "112B15", "problem_text_en": "Which of the following is less likely to be accompanied by coughing?", "choices_en": ["Bronchial asthma", "Bacterial pneumonia", "Hyperventilation syndrome", "Chronic bronchitis", "Idiopathic pulmonary fibrosis (IPF)"], "answer": ["c"]}
{"problem_id": "112B16", "problem_text_en": "Which of the following is not appropriate when practicing patient-centered medical care?", "choices_en": ["Confirmation of the patient's intention/wishes", "Consideration of the patient's emotions/feelings", "Resolution of conflicts with patients", "Prohibition of patient's questioning", "Patient partnership."], "answer": ["d"]}
{"problem_id": "112B17", "problem_text_en": "What is the positive likelihood ratio of a test with a sensitivity of 80% and specificity of 60%?", "choices_en": ["0.3", "0.5 (It is already in numeric form, and there is no context to provide any additional meaning or translation)", "There is not enough information to accurately translate \"1.3\" as it is a numerical value that does not provide context or units.", "2.0 (There is no context to determine the meaning of this choice in the question.)", "4.8"], "answer": ["d"]}
{"problem_id": "112B18", "problem_text_en": "Where should one apply for certification of requiring long-term care insurance?", "choices_en": ["Public health center", "Municipalities, cities and towns", "Regional medical center hospital", "Medical institution providing support for medical treatment at home (such as a home health care facility)", "Social welfare office"], "answer": ["b"]}
{"problem_id": "112B19", "problem_text_en": "A patient with systemic lupus erythematosus (SLE) complicated by nephrotic syndrome had been receiving treatment with adrenal cortical steroids. During the course of treatment, the patient developed diabetes and bacterial pneumonia, leading to septic shock and death. A portion of the death certificate format is shown separately. What should be described as the \"immediate cause of death\" in item (a) on the death certificate?", "choices_en": ["Diabetes", "Bacterial pneumonia", "Nephrotic syndrome", "Septic shock", "Systemic lupus erythematosus (SLE)"], "answer": ["d"]}
{"problem_id": "112B20", "problem_text_en": "Which of the following violates medical professional ethics?", "choices_en": ["Attend a lecture and receive an explanation of a new drug.", "Refer the patient to a surgeon with a good track record of surgical results.", "Increase the number of tests for the purpose of improving hospital management.", "Attend a medical device training seminar hosted by a medical device manufacturer.", "Propose participation in clinical trials to patients who match the indications of the investigational drugs."], "answer": ["c"]}
{"problem_id": "112B21", "problem_text_en": "Which of the following is the most common form of chronic kidney disease syndrome?", "choices_en": ["IgA nephropathy", "Membranous nephropathy", "Membranoproliferative glomerulonephritis", "Focal segmental glomerulosclerosis", "Thin basement membrane syndrome (benign familial hematuria)"], "answer": ["a"]}
{"problem_id": "112B22", "problem_text_en": "What changes when the pre-test probability (prior probability) changes?", "choices_en": ["Sensitivity", "Specificity", "Moderate (appropriate moderate)", "False negative rate", "ROC curve"], "answer": ["c"]}
{"problem_id": "112B23", "problem_text_en": "What is conducted by the Institutional Review Board (IRB), also known as the Ethics Committee in clinical trials?", "choices_en": ["Evaluation of research efficacy", "Fundraising for research", "Allocation of a control group in an intervention study", "Assessment of scientific validity of research", "Explanation to and obtaining consent from subjects"], "answer": ["d"]}
{"problem_id": "112B24", "problem_text_en": "Which of the following is a correct cause of genital bleeding during early pregnancy?", "choices_en": ["Uterine rupture", "Placenta previa", "Placenta accreta", "Subarachnoid hemorrhage", "Abruptio placentae (premature separation of the placenta)"], "answer": ["d"]}
{"problem_id": "112B25", "problem_text_en": "An 8-month-old infant was brought by the mother to a holiday clinic due to fever since this morning. Findings in this infant include: (1) opens eyes when touched, but (2) immediately falls asleep, (3) skin color is pink, (4) slightly decreased skin turgor, and (5) mild dryness of the lips. Which underlined finding suggests a serious illness in this child?", "choices_en": ["① (This is not a translation, ① is a numerical symbol used to represent a choice in a list or a multiple-choice question.)", "Sorry, ② is a numerical symbol and cannot be translated without context. It is likely indicating a choice or option within a specific question or list.", "I'm sorry, I cannot translate \"③\" without any context. It is simply a number without any meaning or reference.", "It is not possible to translate \"④\" as it is a symbol used in multiple-choice exams in Japan to indicate one of the answer choices. It does not have a specific meaning or translation.", "Sorry, I cannot translate \"⑤\" without further context. It appears to be a number or symbol used in a specific context. Please provide more information so I can assist you better."], "answer": ["b"]}
{"problem_id": "112B26", "problem_text_en": "An 86-year-old man was hospitalized for a week due to aspiration pneumonia, but his condition has been stable. He has been receiving medication for hypertension, but has no other underlying conditions. His cognitive function is intact. He is independent in activities of daily living, but his walking is unstable due to muscle weakness, making him require supervision outdoors. During his hospitalization, his diet was provided as minced food with thickener, and he was given dysphagia training. He has a care level of Support 2. He lives with his 82-year-old wife, and his son and daughter-in-law live in a neighboring city, visiting and checking on him 2-3 times a week. What is necessary for him to be discharged to his home?", "choices_en": ["Construction of a gastric fistula", "Cooking instruction for family members", "Instruction on excretion assistance for family members", "Arrangement of home bathing care services", "Peripheral venous nutrition therapy by home visit medical care"], "answer": ["b"]}
{"problem_id": "112B27", "problem_text_en": "A 28-year-old woman had been treated three times for herpes labialis over the past year. She presented with dyspnea while walking and was diagnosed with pneumocystis pneumonia. During treatment for pneumonia, underlying diseases were examined, and she was diagnosed with HIV infection. She reported having sexual partners who were only male, and specifically three. She has been smoking 10 cigarettes per day since the age of 22 and drinking 350 mL of beer per day. Her blood test results were as follows: red blood cells 4.68 million, Hb 14.7 g/dL, white blood cells 7,600 (neutrophils 60%, eosinophils 3%, basophils 1%, monocytes 8%, lymphocytes 28%), CD4-positive cell count of 180/mm3 (reference range 800 to 1,200), and platelets 150,000. Blood biochemistry findings were total bilirubin 0.7 mg/dL, AST 68 U/L, ALT 128 U/L, LD 305 U/L (reference range 176 to 353), blood urea nitrogen 15 mg/dL, and creatinine 1.0 mg/dL. Immunoserological findings were HBs antigen positive, HBs antibody negative, HBV-DNA positive, and HCV antibody negative. What is the most important factor in selecting antiretroviral therapy for this patient?", "choices_en": ["History of alcohol consumption", "Smoking history", "Complications of hepatitis B", "History of oral herpes", "Number of sexual partners"], "answer": ["c"]}
{"problem_id": "112B28", "problem_text_en": "A 68-year-old man complains of diplopia. He suddenly began to see oncoming cars as double while driving yesterday evening, and the symptoms did not improve by this morning, so he came to the hospital. He has been receiving treatment for diabetes for 7 years. His eye position is orthotropic in the left eye and esotropic in the right eye. The diplopia is apparent in primary position, increases in right gaze, and disappears in left gaze. What is the most likely condition?", "choices_en": ["Left medial longitudinal fasciculus (MLF) syndrome", "Right external ophthalmoplegia", "Left oculomotor nerve paralysis", "Right abducens nerve paralysis", "Left Horner's syndrome"], "answer": ["b"]}
{"problem_id": "112B29", "problem_text_en": "A 1-year-10-month-old boy was brought to the hospital by his mother with a chief complaint of cough and wheezing. Yesterday, while walking, he suddenly choked on a peanut-containing snack and started coughing. Today, he continued to cough and developed wheezing, so he was taken to the hospital. His body temperature was 36.7°C, pulse rate was 108/min and regular, respiratory rate was 30/min, and SpO2 was 98% on room air. Chest X-rays during inspiration and expiration are shown separately. What is the appropriate initial management for this patient?", "choices_en": ["Oxygen administration", "Thoracotomy", "Intravenous administration of antibacterial agents", "Performing the Heimlich maneuver", "Removal by bronchoscopy"], "answer": ["e"]}
{"problem_id": "112B30", "problem_text_en": "A 31-year-old primigravida at 32 weeks and 1 day of gestation presented to a perinatal medical center complaining of vaginal bleeding. She had a small amount of similar bleeding about 10 days ago, which resolved after 3 days of bed rest. On the day of admission, while she was preparing dinner at home, she suddenly noticed vaginal bleeding and came to the hospital in a state of panic. She delivered her first child at 38 weeks of gestation through a normal vaginal delivery. On physical examination, her temperature was 36.5°C, pulse rate was 88 beats/min and regular, and blood pressure was 102/62 mmHg. Approximately 50 mL of blood was found on a napkin at admission. On vaginal speculum examination, approximately 250 mL of blood and blood clots were observed in the vagina, and active bleeding from the cervical os was observed. Fetal estimated weight on abdominal ultrasound examination was 1,850 g, and amniotic fluid index was normal. An intrapartum fetal heart rate monitor revealed no uterine contractions and no abnormal fetal heart rate patterns. A transvaginal ultrasound image is shown separately. What is the appropriate management in this case?", "choices_en": ["Perform a cesarean section.", "Perform cervical cerclage.", "Instruct to return for examination the next day and let them go home.", "Start intravenous infusion of β$_2$ agonist.", "Begin oxytocin intravenous drip."], "answer": ["a or d"]}
{"problem_id": "112B31", "problem_text_en": "An 83-year-old woman underwent surgery for a right femoral neck fracture. On the night of the surgery, she was conscious, but on the following night, she showed inconsistent behavior, such as wanting to go home to prepare a meal for her deceased husband. She has never been diagnosed with dementia. Which of the following is true about this condition?", "choices_en": ["The life prognosis does not worsen.", "Antipsychotic drugs are contraindicated.", "It is the first symptom of dementia.", "Fluctuation in level of consciousness in a short period of time.", "Benzodiazepine drugs are indicated."], "answer": ["d"]}
{"problem_id": "112B32", "problem_text_en": "A 40-year-old foreign woman who does not speak Japanese visited the emergency department. A foreign doctor working at the hospital conducted a medical interview and physical examination in English, and presented a portion of the medical record. \n\nPresenting complaint: Severe lower abdominal pain. \n\nHistory of presenting complaint: Sudden onset of right lower abdominal pain 6 hours ago. Pain has been gradually worsening. Slight nausea but no vomiting or diarrhea. Last menstruation was 9 weeks ago. She noticed vaginal spotting 3 days ago. \n\nPast medical and social history: Appendectomy at 18. Married. \n\nExamination: Temperature 36.3℃. Right lower abdominal tenderness without rebound tenderness. Bowel sounds are reduced. \n\nWhat is the most likely condition with vaginal spotting (a small amount of genital bleeding)?", "choices_en": ["クローン病 (Kurōn-byō)", "子宮外妊娠", "骨盤内炎症性疾患", "Premenstrual syndrome (PMS)", "Ureterolithiasis (a medical condition where stones form in the ureter)"], "answer": ["b"]}
{"problem_id": "112B33", "problem_text_en": "A 59-year-old man is admitted for renal partial nephrectomy due to left renal cell carcinoma. Two hours after surgery, bloody drainage is seen from the drain and there is a decrease in the level of consciousness. His Japan Coma Scale score is II-20. His pulse rate is 152/min and regular, blood pressure is 56/42 mmHg, respiratory rate is 16/min, and SpO2 cannot be measured. His abdomen is slightly distended. Blood test results show red blood cells of 2.18 million, Hb of 5.0 g/dL, Ht of 18%, white blood cells of 9,300, and platelets of 150,000. Which of the following actions is incorrect for the next step of treatment?", "choices_en": ["Oxygen therapy", "Red blood cell transfusion", "Platelet transfusion", "Extracellular fluid administration", "Norepinephrine administration"], "answer": ["c"]}
{"problem_id": "112B34", "problem_text_en": "A 35-year-old man presents with jaundice. He was aware of general malaise for one week, but he visited a hospital after his family noticed yellow discoloration in his eyes two days ago. He ate grilled venison a month ago, which was partially undercooked. He is alert and oriented. His height is 174 cm, and he weighs 70 kg. His body temperature is 36.5℃. His pulse rate is 76 beats/min, regular. His blood pressure is 128/76 mmHg. His respiratory rate is 18 breaths/min. There is no anemia of the conjunctiva. There is yellow discoloration of the sclera. His heart sounds and breath sounds are normal. His abdomen is flat, soft, and there is no tenderness. His liver is palpable 2 cm below the right costal margin. The spleen is not palpable. Laboratory findings show a red blood cell count of 4.51 million, hemoglobin concentration of 13.8 g/dL, hematocrit of 44%, and a white blood cell count of 4,600/mm3. The platelet count is 210,000/mm3. The prothrombin time-international normalized ratio (PT-INR) is 1.0 (reference range: 0.9-1.1). Blood chemistry findings show a total protein concentration of 7.8 g/dL, albumin concentration of 4.3 g/dL, total bilirubin concentration of 4.5 mg/dL, direct bilirubin concentration of 2.2 mg/dL, aspartate aminotransferase concentration of 406 U/L, alanine aminotransferase concentration of 498U/L, lactate dehydrogenase concentration of 426 U/L (reference range: 176-353), alkaline phosphatase concentration of 486 U/L (reference range: 115-359), and gamma-glutamyl transferase concentration of 134 U/L (reference range: 8-50). The results of immunological examination include a C-reactive protein concentration of 1.0 mg/dL, negative hepatitis B surface antigen and hepatitis C virus antibody. Ultrasound examination shows hepatomegaly and atrophy of the gallbladder, but no dilation of the bile duct. Which of the following is the appropriate management?", "choices_en": ["Instruct to rest.", "Performing plasmapheresis.", "Administer cyclosporine.", "Administer Interferon.", "Perform endoscopic biliary drainage."], "answer": ["a"]}
{"problem_id": "112B35", "problem_text_en": "Which of the following is not appropriate for the attending physician in explaining the treatment plan to a 65-year-old male executive who is hospitalized for interstitial pneumonia, after receiving a message from a nurse that the patient is complaining of coughing and unable to sleep, and that his attitude is intimidating?\n\nNote: The translation is not provided word-for-word as some parts needed to be rephrased for clarity and coherence in English.", "choices_en": ["Ask about hope for treatment.", "Research the latest findings on treatment.", "We will provide preferential treatment in medical examination because he is a company executive.", "Share information about nursing and treatment with each other.", "Explain politely regardless of the patient's attitude."], "answer": ["c"]}
{"problem_id": "112B36", "problem_text_en": "A 36-year-old woman presents with chief complaints of nausea and vomiting. She has been experiencing low-grade fever, nausea, and fatigue for one week. She vomited once this morning. There is no significant past medical history. Her menstrual cycles are irregular, ranging from 30 to 60 days. She does not remember her last menstrual period. A pregnancy test using an over-the-counter kit three weeks ago was negative. Her mother is undergoing treatment for diabetes. She is 159 cm tall and weighs 49 kg, and her body temperature is 37.0 degrees Celsius. Her pulse rate is 72 bpm and regular, and her blood pressure is 102/58 mmHg. Her skin is dry, and her abdomen is flat without tenderness on palpation. What should be done first?", "choices_en": ["Abdominal CT", "Pregnancy reaction (referring to early symptoms of pregnancy such as nausea and vomiting)", "Cerebrospinal fluid examination", "Upper gastrointestinal endoscopy", "Oral glucose tolerance test"], "answer": ["b"]}
{"problem_id": "112B37", "problem_text_en": "A 21-year-old male patient came to the hospital with a complaint of a laceration on his left index finger. He sustained the injury while working as a part-time employee at a restaurant. Which insurance would be applicable in this case?", "choices_en": ["Accident insurance", "Kyokai Kenpo (Japan Health Insurance Association)", "National Health Insurance", "Employee health insurance managed by labor unions", "Workers' accident compensation insurance"], "answer": ["e"]}
{"problem_id": "112B38", "problem_text_en": "A 50-year-old man presented to the hospital with a chief complaint of cough. He had been coughing for the past two months and was diagnosed with pneumonia at another hospital, but did not improve on antibiotics, so he sought medical attention. He has a 30-year history of smoking 40 cigarettes per day. He was alert and oriented. His height is 175 cm, weight is 78 kg, and his vital signs were as follows: temperature 36.5℃, pulse rate 88 beats per minute and regular, blood pressure 126/80 mmHg, respiratory rate 15 breaths per minute, and oxygen saturation 96% on room air. There were no abnormalities detected in heart sounds and breath sounds. Blood test showed a red blood cell count of 5.08 million/μL, hemoglobin of 14.8 g/dL, white blood cells of 5,600 /μL, and platelets of 250,000/μL. Biochemical findings showed a total bilirubin level of 0.6 mg/dL, AST of 10 U/L, ALT of 21 U/L, LD of 425 U/L (reference range 176-353), blood urea nitrogen of 14 mg/dL, creatinine of 1.2 mg/dL, CEA of 2.9 ng/mL (reference range less than 5.0), SCC of 1.2 ng/mL (reference range less than 1.5), ProGRP of 350 pg/mL (reference range less than 81). The chest X-ray (A) and chest CT scan (B) are shown separately. Lung cancer was diagnosed by bronchoscopic biopsy. What is the most likely histological type of lung cancer?", "choices_en": ["Large-cell neuroendocrine carcinoma", "Squamous cell carcinoma", "Small cell carcinoma", "Large cell carcinoma", "Adenocarcinoma"], "answer": ["c"]}
{"problem_id": "112B39", "problem_text_en": "A 2-year-old boy is brought in by ambulance due to fever and difficulty breathing. The parents noticed a fever of 38.8 ℃ and difficulty breathing this morning and requested an ambulance. On arrival at the hospital, his body temperature was 39.8 ℃. Heart rate was 120/min and regular, respiratory rate was 28/min, and SpO2 was 96% (with oxygen mask and 5L/min oxygen). Capillary refill time was normal at 1 second. Dyspnea worsened in the supine position and slightly improved in the seated position. The patient was observed to have effortful breathing with his chin lifted. He had difficulty swallowing and could not swallow saliva. No abnormalities were heard in the heart sounds. Wheezing and rib cage retractions were heard during inspiration. The abdomen was flat, soft, and neither liver nor spleen was palpable. What should be the highest priority?", "choices_en": ["Tracheal intubation using a laryngoscope", "Chest x-ray during expiration", "Visualization of the pharynx using a tongue depressor", "Epinephrine inhalation", "Arterial blood gas analysis"], "answer": ["a"]}
{"problem_id": "112B40", "problem_text_en": "Read the following passage and answer questions 40 and 41. \n\nA 22-year-old woman presents to the emergency department with complaints of abdominal pain, vomiting, and fever. She reports waking up at 6 a.m. with epigastric pain that has gradually shifted to the right lower quadrant, accompanied by nausea, vomiting, and fever. Her medical history is unremarkable, and she does not have a history of smoking or alcohol use. On physical examination, she appears uncomfortable but alert and oriented. Her height is 153 cm, and her weight is 48 kg. Her temperature is 37.6℃, blood pressure is 118/62 mmHg, pulse is 100 beats/minute, respiratory rate is 24 breaths/minute, and there is no jugular venous distention. Her heart and lung exams are normal. She has tenderness in the right lower quadrant of the abdomen, which is otherwise flat. There is no edema in the lower extremities. Laboratory studies show a hemoglobin of 11.9 g/dL, a hematocrit of 36%, and a white blood cell count of 9,800/mm3. The CRP level is 5.2 mg/dL. Abdominal ultrasound and CT imaging show an enlarged appendix, but surgery is not immediately necessary, so the patient is admitted and started on empirical antibiotics. \n\nWhich of the following incidents requires an incident report to be filed? \n\n① The pharmacist was unsure of the appropriate solvent to be used for dissolving the antibiotic, so they had to be contacted for clarification. \n\n② Two unsuccessful attempts were made to insert a peripheral venous catheter, and the third attempt was successful. \n\n③ Prior to starting the administration of the antibiotics, the name of a different patient was found written on the IV bag. \n\n④ After initiating the administration of the correct antibiotic at 11 a.m., the patient began to complain of pruritis and then systemic erythema occurred 30 minutes later. \n\n⑤ The antibiotic was discontinued, and the erythema resolved by 2 p.m. \n\nThe underlined options that requires an incident report to be filed are ③ and ④.", "choices_en": ["① (pronounced as \"ichi\" in Japanese) means \"one\" or \"first\" in English.", "Sorry, it is not possible to translate the choice ② alone without any context or options.", "Sorry, it is not possible to translate the choice ③ without any context or further information. ③ refers to a number or option in a list or a menu, but it does not provide any specific information that can be translated.", "Without more context, it is impossible to provide an accurate translation for this choice. The number ④ by itself does not have a specific meaning. Please provide additional information or context.", "This cannot be translated without further context. It appears to be a numerical reference to an option in a list or a question number."], "answer": ["c"]}
{"problem_id": "112B41", "problem_text_en": "Subsequent clinical course: abdominal pain persisted and around 5 pm, the patient's body temperature rose further and they complained of chills. The body temperature was 39.3°C. The pulse rate was 124 beats per minute and regular, and blood pressure was 80 mmHg (by palpation). What is the immediate treatment that should be given at this point?", "choices_en": ["Rapid intravenous injection of beta-blocking agents.", "Intravenous administration of antihistamine medication", "Rapid infusion of physiological saline solution", "Pentazocine injection", "Intravenous administration of adrenal cortex steroids"], "answer": ["c"]}
{"problem_id": "112B42", "problem_text_en": "Read the passage and answer questions 42 and 43. A 76-year-old woman presented to the hospital with dyspnea. Present illness: The patient began to experience dyspnea one year ago and noticed that she became short of breath when walking for approximately 10 minutes, three months ago. Three days prior to the current visit, she contracted a cold, which worsened her dyspnea to the extent that she was unable to move around, and as a result, she visited the respiratory department at a general hospital accompanied by her daughter. Past medical history: She had previously visited multiple medical institutions for diabetes, hypertension, chronic heart failure (NYHA II), degenerative knee joint disease, osteoporosis, and insomnia. For the past 6 months, she had been neglecting visits to these medical institutions. Personal history: She lived with her daughter with whom she is alone during daytime because her daughter is at work. She is capable of eating, defecating, and changing clothes by herself, but housework and going outside are difficult for her, so her daughter assists her with bathing. She had smoked 15 cigarettes per day for 45 years but never drank alcohol. Present condition: She was conscious and alert. Her height is 158 cm, and her weight is 42 kg. Her body temperature was 36.6°C. Her pulse was 104/min, regular. Blood pressure was 120/76 mmHg. Respiratory rate was 28/min. SpO2 was 93% (room air). Her skin was unremarkable. There were no abnormalities present in either the eyelids or eyeball conjunctiva. No goiter or lymphadenopathy was palpable in the neck, and no jugular vein distension was observed. The accessory respiratory muscles were conspicuous. No abnormalities were noted in the heart sounds. Wheezing was heard in both sides of the chest, but no crackles were audible. Her abdomen was flat and soft. No edema was noted in the limbs. Her Revised Hasegawa Dementia Scale score was 27/30. Testing results: Chest X-ray showed over-expanded lungs, but no infiltrate or pulmonary congestion was observed. The cardiothoracic ratio was 53%. Chest CT revealed low attenuation areas in all lung fields. She was treated with oral corticosteroids and beta-agonist inhalation for 4 days as outpatient care, and her acute respiratory symptoms improved, bringing her SpO2 up to 96% (room air). However, the nurse overheard the patient saying, \"I have no intention of quitting smoking. Do I have to keep coming to the hospital?\" What is the most appropriate response to the patient at this point?\n\n42. 禁煙するように指導する\nAnswer: 42. Instruct the patient to quit smoking.\n\n43. 今回治療について話し合う\nAnswer: 43. Discuss treatment options with her at this time.", "choices_en": ["Obligation to attend smoking cessation outpatient clinic.", "Refer to a regular physician and recommend regular check-ups.", "Inquire in detail about the situation with non-cohabiting relatives.", "Recommend to continue visiting all medical departments that the patient has visited.", "Explain not to easily visit a tertiary hospital even in case of symptoms recurrence."], "answer": ["b"]}
{"problem_id": "112B43", "problem_text_en": "Which of the following is of lower importance in supporting the treatment of this patient?", "choices_en": ["Home visiting nurse", "Adult guardian", "Certified Care Worker", "Care manager (a profession in Japan that provides support and guidance to elderly or disabled individuals and their families in accessing healthcare and social services)", "Neighborhood volunteer"], "answer": ["b"]}
{"problem_id": "112B44", "problem_text_en": "Read the following passage and answer questions 44 and 45. \n\nA 74-year-old woman visited the hospital due to sustained anterior chest pain. Present illness: The patient suddenly felt pain spreading to the throat and cold sweat throughout the anterior chest while preparing breakfast at 7:45 am today. There was no loss of consciousness or variation in pain with respiration, and no tenderness over the chest. She lay on the sofa due to persistent symptoms and was brought to the hospital in a private car by her family at 8:15 am. A nurse who heard her symptoms judged that her condition was severe and immediately transferred her to the emergency room. Past history: Nothing notable. Lifestyle: Nothing notable. Family history: Father died of cerebral hemorrhage at the age of 80. Mother died of gastric cancer at the age of 84. Current status: Conscious and alert. Height 158 cm, weight 56 kg. Body temperature 36.5℃. Pulse rate of 92 beats per minute and regular. Blood pressure of 120/80 mmHg. Respiratory rate of 18 breaths per minute. Oxygen saturation (SpO2) of 99% (room air). No abnormal heart or lung sounds were detected. The abdomen was flat, soft, and non-tender, and the liver and spleen were not palpable. A separately shown electrocardiogram that was immediately conducted is attached. What is the most likely condition? \n\n(Note: Question 44 is not provided in the given text and hence cannot be answered.) \n\n45. The electrocardiogram does not show evidence of: \n- ST segment elevation\n- ST segment depression \n- T wave inversion \n- Sinus tachycardia \n\n(Note: The provided text does not contain the electrocardiogram and hence the answer cannot be determined.)", "choices_en": ["Pleurisy", "Acute coronary syndrome", "Atrial fibrillation", "Pulmonary embolism", "Complete atrioventricular block."], "answer": ["b"]}
{"problem_id": "112B45", "problem_text_en": "Findings at the time of examination (blood collection at 8:25 am): Blood test results: RBC 4.16 million, Hb 12.6 g/dL, Ht 36%, WBC 9,800, platelets 200,000, D-dimer 0.7 μg/mL (reference range 1.0 or less). Blood biochemistry results: AST 26 U/L, ALT 30 U/L, LD 254 U/L (reference range 176-353), CK 118 U/L (reference range 30-140), blood urea nitrogen 16 mg/dL, creatinine 1.6 mg/dL, blood glucose 98 mg/dL, negative for cardiac troponin T. Chest X-ray shows no abnormalities. While preparing for emergency measures, the patient suddenly lost consciousness with a groan. Breathing has stopped and there is no pulse. Begin chest compressions and ventilation using the bag valve mask. The patient's monitor shows a separate electrocardiogram. What is the immediate action that should be taken for this patient?", "choices_en": ["Intravenous Nitroglycerin", "Intravenous adrenaline injection", "Amiodarone intravenous injection", "Atropine intravenous injection", "Electric shock"], "answer": ["e"]}
{"problem_id": "112B46", "problem_text_en": "Read the following passage and answer questions 46 and 47. \n\nA 66-year-old man was brought in by ambulance due to fever, headache, and vomiting. Medical history: He had a fever of 38 ℃ for two days, and yesterday his headache began over his entire head and gradually worsened. He did not improve after taking over-the-counter painkillers. He began vomiting repeatedly, so his wife requested an ambulance. He has been receiving treatment for hypertension since he was 58 years old. Lifestyle: He lives with his wife and has been working in an office job for many years. He has smoked 20 cigarettes a day for 35 years and has been drinking 350 mL of beer daily for 30 years. Family history: His father had hypertension and his mother died of colon cancer. Present illness: The level of consciousness is JCS I-1. Height is 173 cm, weight is 52 kg. Body temperature is 38.7 ℃. Heart rate is 90/min and regular. Blood pressure is 110/66 mmHg. Respiratory rate is 22/min. SpO2 is 98% (room air). There is no abnormality in the conjunctiva and eyeball conjunctiva. Pupils are equal and reactive to light bilaterally. There is no abnormality in the oral mucosa. No abnormalities are noted in heart sounds and respiratory sounds. The abdomen is flat, soft, and there is no palpable liver or spleen. What finding should be confirmed first for diagnosis? \n\n(Question 46 and 47 are not provided. Please provide the questions.)", "choices_en": ["Nystagmus", "Muscle rigidity (often associated with neurological or muscular disorders)", "Nuchal rigidity", "Barre's sign", "Babinski sign"], "answer": ["c"]}
{"problem_id": "112B47", "problem_text_en": "Which of the following is appropriate when collecting a blood culture specimen for diagnosis?", "choices_en": ["Take two sets (of samples).", "Collect after administering an antimicrobial agent.", "After collection, store the specimen container in a refrigerator.", "After disinfecting the fingers, collect the sample with bare hands.", "Arterial sampling is given priority."], "answer": ["a"]}
{"problem_id": "112B48", "problem_text_en": "Read the following passage and answer questions 48 and 49.\n\nA 20-year-old woman presents with a chief complaint of weight loss. She has no significant past medical history, and her recent health checkup two months ago showed a weight of 47 kg, which has now decreased to 40 kg. She reports no change in her diet and denies any overeating or vomiting. She complains of fatigue, feeling hot, and difficulty sleeping at night. Her past surgical history is significant for appendectomy at 12 years of age. She has no blood transfusion history. She is a university student and denies smoking and alcohol intake. Her father has hypertension. On examination, she is alert and oriented. Her height is 153 cm, weight is 40 kg, and temperature is 37.5°C. The pulse rate is 104/min and irregular. The blood pressure is 142/52 mmHg, respiratory rate is 16/min. She has a goiter and fine tremors of the fingers. The tendon reflexes are generally exaggerated. Laboratory findings show a red blood cell count of 4.62 million/μL, Hb of 13.2 g/dL, Hct of 40%, WBC count of 4,600/μL, and platelet count of 280,000/μL. Serum chemistry reveals AST of 35 U/L, ALT of 40 U/L, blood glucose of 85 mg/dL, HbA1c of 5.2% (reference range 4.6%–6.2%), Na of 142 mEq/L, K of 3.8 mEq/L, and Cl of 104 mEq/L. What is the most likely condition in this patient?\n\nNote: Question 49 is not provided. Please provide question 49.", "choices_en": ["Cough", "Abnormal menstruation", "Polyuria", "Dry skin", "Constipation"], "answer": ["b"]}
{"problem_id": "112B49", "problem_text_en": "Which blood test item is the most useful for diagnosis?", "choices_en": ["Insulin", "Albumin", "Cortisol", "Catecholamines", "Thyroid-stimulating hormone (TSH)"], "answer": ["e"]}
