{"problem_id": "112E1", "problem_text_en": "Which of the following conditions is known to have a lower risk of occurrence with sufficient intake of dietary fiber?", "choices_en": ["Secondary hypertension", "Type 2 diabetes", "Hyperuricemia", "Chronic pancreatitis.", "Osteoporosis"], "answer": ["b"]}
{"problem_id": "112E2", "problem_text_en": "Which of the following statements is correct regarding incident reports?", "choices_en": ["Submit it even if it does not harm the patient.", "Report format is established for each prefecture.", "It is to explain to your superior about medical accidents.", "The objective is to clarify the responsibility for a medical accident.", "The lower the number of incident reports submitted, the higher the quality of medical care."], "answer": ["a"]}
{"problem_id": "112E3", "problem_text_en": "What is the daily energy requirement (in kcal) for a 1 year and 0 month old male infant weighing 9kg with normal growth and development?", "choices_en": ["600", "Nine hundred", "1,200", "One thousand five hundred.", "One thousand eight hundred"], "answer": ["b"]}
{"problem_id": "112E4", "problem_text_en": "Which of the following statements about medical records is incorrect?", "choices_en": ["Write the name of the injury or illness.", "Identify the record keeper.", "If modifying, leave a record.", "It should be kept for 5 years from the completion date of the medical treatment.", "Days with no changes during hospitalization can be omitted from documentation."], "answer": ["e"]}
{"problem_id": "112E5", "problem_text_en": "Which combination of body examination and corresponding finger position is appropriate?", "choices_en": ["Palpation of splenomegaly --------- Dorsum of hand", "Percussion of the abdomen --------- Tip of the index finger", "Tenderness of the maxillary sinus --------- palmar proximal area", "Palpation of vocal cord vibration --------- Tip of the index finger", "Palpation of supraclavicular lymph nodes - Use the pads of the fingers from the index finger to the ring finger"], "answer": ["e"]}
{"problem_id": "112E6", "problem_text_en": "Which of the following is not suitable for intramuscular injection?", "choices_en": ["Deltoid muscle", "Gluteus maximus muscle", "Gluteus medius muscle", "Biceps brachii", "Quadriceps femoris (vastus lateralis)"], "answer": ["d"]}
{"problem_id": "112E7", "problem_text_en": "Which author wrote \"On death and dying\", which describes the psychological stages of denial, anger, bargaining, depression, and acceptance in dying individuals and has influenced end-of-life care?", "choices_en": ["William Osler", "Helen Adams Keller", "Albert Schweitzer", "Florence Nightingale", "Elisabeth Kübler-Ross"], "answer": ["e"]}
{"problem_id": "112E8", "problem_text_en": "Which of the following patient complaints is most suggestive of depression?", "choices_en": ["\"I get angry easily.\"", "\"I feel too lethargic to do anything.\" (literal translation: \"Everything feels burdensome and unbearable.\")", "\"I feel uneasy for some reason.\"", "\"I tend to doze off during the daytime more often\"", "\"I feel like someone is watching me when I go outside\""], "answer": ["b"]}
{"problem_id": "112E9", "problem_text_en": "Which combination of abnormal respiration and disease is incorrect?", "choices_en": ["Orthopnea - Pulmonary edema", "Prolonged exhalation --------- Bronchial asthma", "Pursed-lip breathing --------- COPD", "Kussmaul respiration ------- Hyperventilation syndrome", "Cheyne-Stokes respiration ------- cerebral infarction (stroke)"], "answer": ["d"]}
{"problem_id": "112E10", "problem_text_en": "Which of the following is true for the review of systems during a medical interview?", "choices_en": ["Conduct medical history taking chronologically.", "Ask the patient to systematically describe their medical history in their own words.", "Systematically summarize the evidence and explain it to the patient.", "State a summary of the medical history heard at the end of the medical interview.", "Obtain medical history by organ system, including symptoms unrelated to the chief complaint."], "answer": ["e"]}
{"problem_id": "112E11", "problem_text_en": "What is the auscultatory finding that becomes more distinct when the trunk is leaned forward from a seated position?", "choices_en": ["Third heart sound (S3)", "Splitting of the second heart sound", "Carotid bruit", "Early systolic murmur at the base of the heart", "Apical systolic murmur"], "answer": ["d"]}
{"problem_id": "112E12", "problem_text_en": "Which neurological finding commonly observed in alcohol dependence is related to cerebellar dysfunction?", "choices_en": ["External ophthalmoplegia", "Impaired memory", "Steppage gait", "Positive Romberg sign.", "Glove and stocking type sensory impairment"], "answer": ["c"]}
{"problem_id": "112E13", "problem_text_en": "Which of the following is the most useful for the diagnosis of rheumatoid arthritis?", "choices_en": ["Fever", "Sensation of coldness (such as feeling of coldness on skin)", "Skin rash", "Numbness", "Joint swelling"], "answer": ["e"]}
{"problem_id": "112E14", "problem_text_en": "Which of the following is not an appropriate measure for preventing overwork in industrial health?", "choices_en": ["Reduction of overtime hours", "Promotion of acquisition of annual paid leave", "Thorough achievement of job responsibilities and goals", "Post-measures based on health check-up results.", "Interview-based guidance by a physician for employees working long hours"], "answer": ["c"]}
{"problem_id": "112E15", "problem_text_en": "Which of the following disease and symptom combinations is incorrect?", "choices_en": ["Neurosis --------- physical distress", "Depression - Delusion of persecution", "Obsessive-Compulsive disorder ---------- as an experience", "Schizophrenia - Delusion perception", "Post-traumatic stress disorder (PTSD) - hyperarousal"], "answer": ["c"]}
{"problem_id": "112E16", "problem_text_en": "What is the percentage of medical expenses (out-of-pocket expenses) to be borne by individuals aged 75 years or older who do not have an income equivalent to that of an active worker?", "choices_en": ["None", "10 percent.", "20%", "30%", "50%"], "answer": ["b"]}
{"problem_id": "112E17", "problem_text_en": "What causes post-renal anuria?", "choices_en": ["Thermal burn.", "Shock", "Retoperitoneal fibrosis", "Acute tubular necrosis", "Nephrotic syndrome"], "answer": ["c"]}
{"problem_id": "112E18", "problem_text_en": "Which of the following is appropriate for chest compressions in adult cardiopulmonary resuscitation (CPR)?", "choices_en": ["Press the upper half of the sternum.", "Push at a rate of 100-120 per minute.", "Pressing with a force that causes the chest wall to sink about 3cm.", "Chest compressions and rescue breaths should be performed at a ratio of 30:1.", "Perform it in position of elevating the patient's lower limbs."], "answer": ["b"]}
{"problem_id": "112E19", "problem_text_en": "Which of the following is less likely to cause heartburn?", "choices_en": ["Overeating", "Exercise/movement", "Obesity", "High-fat diet", "Forward flexed posture"], "answer": ["b"]}
{"problem_id": "112E20", "problem_text_en": "Which of the following is considered the preparatory phase for behavior change in patients with diabetes?", "choices_en": ["I have been exercising after meals for seven months.", "Eating dessert after dinner.", "Sometimes when watching TV, I end up snacking.", "\"I am thinking of stopping snacking from next month because my diabetes has worsened.\"", "I think it's good to do stretching exercises after snacks."], "answer": ["d"]}
{"problem_id": "112E21", "problem_text_en": "Which of the following is not considered a \"panic value\" in clinical tests?", "choices_en": ["750/μL white blood cells.", "Arterial blood pH 7.18", "Serum potassium 7.0mEq/L", "Serum Ca 14.2mg/dL.", "Serum total cholesterol level of 320mg/dL"], "answer": ["e"]}
{"problem_id": "112E22", "problem_text_en": "What is the longest mandatory retention period for medical records?", "choices_en": ["X-ray photograph", "Nursing records", "Surgical records", "Prescription", "Medical record or medical chart."], "answer": ["e"]}
{"problem_id": "112E23", "problem_text_en": "What is the most important cause to consider for deep vein thrombosis during pregnancy?", "choices_en": ["Morning sickness (in pregnancy)", "Overdue pregnancy/Past Due Date pregnancy", "Gestational diabetes", "Oligohydramnios", "Blood type incompatible pregnancy"], "answer": ["a"]}
{"problem_id": "112E24", "problem_text_en": "Which of the following statements is correct regarding clinical practice guidelines?", "choices_en": ["It is created by collecting new case reports.", "The more concomitant diseases a patient has, the easier it is to apply the recommendation.", "If treatment is performed differently from the recommendation, it may pose a danger to the patient.", "The same recommendation can be applied to all patients with the disease.", "Used as one of the materials for decision-making between patients and medical professionals."], "answer": ["e"]}
{"problem_id": "112E25", "problem_text_en": "Which of the following increases with age in adults?", "choices_en": ["Renal concentrating ability", "Intracellular fluid volume", "Peripheral vascular resistance", "Glomerular filtration rate (GFR)", "Daily creatinine production amount"], "answer": ["c"]}
{"problem_id": "112E26", "problem_text_en": "When examining the oral cavity of an adult using a tongue depressor and a penlight, what can be visualized?", "choices_en": ["Submandibular gland", "Frenulum of tongue", "Thyroid gland", "Pharyngeal tonsil", "Piriform recess of the hypopharynx"], "answer": ["b"]}
{"problem_id": "112E27", "problem_text_en": "A 56-year-old man presents with a complaint of blurred vision in his right eye for the past week. He had previously been diagnosed with high blood glucose at a workplace health checkup about 15 years ago but had not received any medical treatment. When he visited a clinic last month, his HbA1c was 11.5% (reference range: 4.6-6.2%). His visual acuity was 0.3 in the right eye (0.6 × -0.75D) and 0.7 in the left eye (1.2 × -1.0D). His intraocular pressure was 20 mm Hg in the right eye and 14 mm Hg in the left eye. The fundus photograph (A) and fluorescein fundus photograph (B) of the right eye are shown separately. Which of the following is the appropriate management for this patient?", "choices_en": ["Antibiotic eye drops", "Vitreous surgery", "Retinal photocoagulation", "Eyedrops for antiglaucoma medication", "Oral administration of adrenal cortex steroids"], "answer": ["c"]}
{"problem_id": "112E28", "problem_text_en": "A 43-year-old man presents with a complaint of foot pain. Two days ago, the first metatarsophalangeal joint of his left foot suddenly became painful. He has no pain in any other locations. He has experienced similar pain in the same area before. He has been diagnosed with hyperuricemia on health checkups every year for the past 3 years. His uric acid level was 9.0 mg/dL on a checkup 1 month ago. He is conscious, with a clear mind. His temperature is 37.0°C. His pulse is 80 beats per minute and regular, and his blood pressure is 132/88 mmHg. He has tenderness and warmth in the first metatarsophalangeal joint of his left foot. A photo of the same area is shown separately. What is the first line of treatment that should be administered?", "choices_en": ["Cast immobilization", "Administration of antibiotics", "Administration of immunosuppressive drugs", "Administration of uric acid synthesis inhibitors", "Administration of nonsteroidal anti-inflammatory drugs (NSAIDs)"], "answer": ["e"]}
{"problem_id": "112E29", "problem_text_en": "A 35-year-old man presented with dizziness as his main complaint. He left his job one year ago due to work-related trouble and has since become prone to seclusion at home, with an irregular eating pattern that includes a preference for sweet buns and rice balls. Over the past week, he has developed noticeable dizziness when walking and complains of numbness in his limbs. Worried family members accompanied him to the hospital for an examination. He is conscious, and his pulse is 72 bpm and regular, with a blood pressure of 124/68 mmHg. Tendon reflexes are diminished in the upper limbs and absent in the patellar and Achilles tendons. The Babinski sign is negative. Distal limb muscle weakness is dominant. The patient has hypersensitivity to pain and decreased sensitivity to vibration in both lower limbs. What is the supplement that should be given to this patient?", "choices_en": ["Zinc", "Folic acid", "Niacin", "Vitamin B$_1$", "Vitamin B$_{12}$"], "answer": ["d"]}
{"problem_id": "112E30", "problem_text_en": "A 23-year-old woman with complaints of dysuria and lower abdominal pain presented to the clinic. She started experiencing dysuria three days after sexual intercourse. Four days after sexual intercourse, she developed yellowish discharge and lower abdominal pain, leading her to seek medical attention. She is 160cm tall and weighs 52kg. Her body temperature is 37.6℃. Her pulse rate is 88 bpm, regular. Her blood pressure is 104/72mmHg. Her respiratory rate is 20/minute. Her abdomen is flat, and rebound tenderness is observed in the lower abdomen. On pelvic examination, the uterus is of normal size and tender. The adnexa cannot be palpated due to pain. Pus-like secretion is observed on the external cervical os on vaginal speculum examination. Which of the following tests is not appropriate for this patient?", "choices_en": ["Urinary sediment", "Bacterial culture of vaginal discharge", "Transvaginal ultrasonography", "Hysterosalpingography", "Pathogen nucleic acid amplification test of vaginal discharge"], "answer": ["d"]}
{"problem_id": "112E31", "problem_text_en": "While aboard an airplane en route to attend a medical conference in North America, a doctor was called upon to provide assistance. After assessing the situation, the doctor determined that it would be best to provide the airport staff at the destination with the relevant information. The flight attendants requested that the doctor provide notes, which were duly provided. The notes indicated that a 78-year-old woman had developed left lower leg swelling towards the end of the long flight. The patient did not complain of any discomfort at rest; however, she did exhibit pitting edema of the left lower leg, although no changes in color or temperature were observed. The patient also experienced calf pain on dorsiflexion of her left foot. Given that the patient was experiencing shortness of breath, a pulmonary embolism was considered as a possible cause, and transfer to an appropriate hospital was recommended.", "choices_en": ["急性腎障害", "深部静脈血栓症", "Femoral neck fracture", "Heart failure", "末梢動脈疾患"], "answer": ["b"]}
{"problem_id": "112E32", "problem_text_en": "An 88-year-old man presents with fatigue as his main complaint. He had symptoms of an upper respiratory infection one week ago. His fatigue has become worse over the past three days, and he could not eat yesterday. He found it difficult to get to the bathroom and was wearing adult diapers. He has been previously advised of the possibility of diabetes during a health check and is currently not taking any medication. His consciousness is clear, and his body temperature is 35.7°C. His pulse is regular at 112 beats/minute, and his blood pressure is 156/92 mmHg. There are abrasions on his lower limbs. Which item used for this patient would not be treated as infectious waste from the standpoint of standard precautions?", "choices_en": ["Bag containing a removed lingual tonsil", "Brush used for oral care", "Diaper soiled with feces", "Gauze applied to a wound on the lower limb", "Tissue paper stained with sputum"], "answer": ["a"]}
{"problem_id": "112E33", "problem_text_en": "An 85-year-old woman has been diagnosed with cholangiocarcinoma at the hepatic hilum, and has been told that she has only a few months to live. Upon her request, she is receiving home medical care and her pain is adequately controlled. One day, the visiting physician was told by the patient that she wanted to be hospitalized because she was causing trouble for her family. Which of the following is not an appropriate response from the visiting physician?", "choices_en": ["\"There is no option for hospitalization\"", "\"You don't want to come to my home, do you?\"", "\"Would you like to hear your family's thoughts as well?\"", "\"Let's discuss it together with the visiting nurse.\"", "\"Please let me know if there is anything you are having trouble with.\""], "answer": ["a"]}
{"problem_id": "112E34", "problem_text_en": "A 64-year-old woman is brought in by ambulance due to swelling and pain in her left lower leg. She has had swelling in her left foot for three days, and today she is unable to move due to swelling throughout her lower leg, which prompted her to call for an ambulance. She has no recent history of trauma. She has been warned of the possibility of diabetes during a health checkup but has not received treatment. She is slightly confused. She is 154cm tall and weighs 72kg. Her body temperature is 38.4°C. Her heart rate is 112 beats per minute and regular. Her blood pressure is 98/64 mmHg. Her respiratory rate is 20 breaths per minute. Her SpO2 is 96% (room air). Her abdomen is flat and soft. There is redness, warmth, and induration in her left lower leg. Urinalysis shows 1+ protein, 3+ glucose, 2+ ketones, 1+ occult blood, and no leukocytes in the sediment. Blood tests show a red blood cell count of 4.68 million, hemoglobin level of 13.9 g/dL, hematocrit level of 42%, and white blood cell count of 16,300 (30% segmented neutrophils, 50% banded neutrophils, 1% eosinophils, 1% basophils, 6% monocytes, and 12% lymphocytes), and a platelet count of 410,000. Blood chemistry shows a total protein level of 6.2 g/dL, an albumin level of 2.6 g/dL, a total bilirubin level of 0.9 mg/dL, a direct bilirubin level of 0.2 mg/dL, AST level of 28 U/L, ALT level of 16 U/L, LD level of 177 U/L (reference range 176 to 353), ALP level of 285 U/L (reference range 115 to 359), γ-GTP level of 132 U/L (reference range 8 to 50), amylase level of 50 U/L (reference range 37 to 160), CK level of 242 U/L (reference range 30 to 140), a blood urea nitrogen level of 48 mg/dL, a creatinine level of 1.6 mg/dL, a uric acid level of 7.9 mg/dL, a blood glucose level of 398 mg/dL, and an HbA1c level of 8.8% (reference range 4.6 to 6.2), with a sodium level of 141 mEq/L, a potassium level of 5.4 mEq/L, and a chloride level of 97 mEq/L. CRP level was 18mg/dL. Images of the lower leg (A) and left lower leg CT (B) are presented separately. What is the immediate treatment that needs to be administered?", "choices_en": ["Local excision", "Diuretic therapy", "Topical administration of antibacterial agents", "Intravenous adrenaline injection.", "Steroid pulse therapy"], "answer": ["a"]}
{"problem_id": "112E35", "problem_text_en": "A 30-year-old primigravida presented with complaint of leaking amniotic fluid at 33 weeks and 0 days of gestation. She had an uneventful antenatal period so far. Fetal heart rate was 80 bpm, regular. Blood pressure was 110/70 mmHg. Examination revealed clear amniotic fluid in vagina, vertex presentation, and irregular uterine contractions. Which of the following is least useful in determining the continuation of the pregnancy?", "choices_en": ["Body temperature", "Internal examination", "Urinalysis", "Abdominal palpation", "Blood test"], "answer": ["c"]}
{"problem_id": "112E36", "problem_text_en": "A 62-year-old woman presents with a chief complaint of headache. The headache started suddenly on awakening four days ago. She had been resting at home but the headache persisted, so she visited a clinic near her home three days ago and was prescribed a pain reliever. However, the headache did not improve, so she came to the hospital. The patient is alert and oriented. She is 157 cm tall and weighs 54 kg. Her body temperature is 36.6℃, pulse rate is 88 beats per minute and regular, blood pressure is 118/82 mmHg, and respiratory rate is 16 breaths per minute. Neck stiffness is observed. Blood tests show red blood cells at 3.62 x 10^6/μL, Hb at 11.2 g/dL, Ht at 44%, white blood cells at 9,800/μL (neutrophils 12%, band cells 46%, eosinophils 1%, basophils 1%, monocytes 2%, lymphocytes 38%), and platelets at 210,000/μL. Blood chemistry results show total protein at 7.5 g/dL, albumin at 4.8 g/dL, blood urea nitrogen at 9 mg/dL, creatinine at 0.6 mg/dL, and CRP at 3.4 mg/dL. A head CT scan is also shown. What test should be performed next?", "choices_en": ["Brain waves", "Cerebral angiography examination", "Cerebrospinal fluid culture test", "Diffusion-weighted imaging of head MRI", "Influenza virus rapid antigen test"], "answer": ["b"]}
{"problem_id": "112E37", "problem_text_en": "A 78-year-old man is hospitalized due to a cerebral infarction. His symptoms are stable and he is conscious. He has motor paralysis in the left upper and lower limbs and rehabilitation is recommended. As he lives alone, he wishes to recover in another prefecture where his son and daughter-in-law reside. Which profession is most suitable for coordinating the cooperation between medical facilities for his future medical care?", "choices_en": ["Nurse", "Public health nurse", "Pharmacist", "Occupational therapist", "Medical social worker"], "answer": ["e"]}
{"problem_id": "112E38", "problem_text_en": "A 56-year-old man diagnosed with acute myocardial infarction is hospitalized after undergoing percutaneous coronary intervention. The hospital reception received a call from the patient's supervisor at work asking for information about the diagnosis and condition of the patient because they were concerned about the impact on work. What is the appropriate response in this situation?\n\n", "choices_en": ["Convey the diagnosis and condition.", "Only communicate the diagnosis name without conveying the symptoms.", "Tell them that you cannot disclose the diagnosis name and condition.", "Obtain consent from the patient's family and disclose the diagnosis and condition.", "If it is proven that they are an acquaintance of the patient, the diagnosis and symptoms can be disclosed."], "answer": ["c"]}
{"problem_id": "112E39", "problem_text_en": "A 30-year-old man visited the hospital with a chief complaint of cola-colored urine after waking up in the morning. He had a history of recurrent tonsillitis since childhood. He had a sore throat and fever 7 days ago, but recovered quickly. Urinalysis results showed dark red urine, 2+ protein, 3+ occult blood. A separate microscopic image of the urine sediment is also shown. What is the most likely location of the disorder?", "choices_en": ["Glomerulus", "Renal tubule", "Renal pelvis", "Ureter", "Bladder"], "answer": ["a"]}
{"problem_id": "112E40", "problem_text_en": "A 52-year-old man was transported by ambulance due to sudden cardiac arrest. He collapsed while running in a marathon competition and immediately became unresponsive and stopped breathing. A first aid worker at the scene began chest compressions and administered one shock with an automated external defibrillator (AED) according to voice instructions. The patient had a consciousness level of JCS III-300 and palpable carotid pulses at the time of emergency medical service (EMS) arrival. Upon arrival at the emergency medical center, the patient had a Glasgow Coma Scale (GCS) of 6, a heart rate of 96 beats per minute in sinus rhythm, a blood pressure of 108/72 mmHg, a respiratory rate of 24 breaths per minute, and an SpO2 of 100% with a reservoir mask and 10 liters per minute of oxygen supplement. What treatment should be administered for brain protection?", "choices_en": ["Artificial respiration", "Therapeutic hypothermia", "Intravenous anesthesia administration", "Administration of high osmotic diuretics", "Adrenal cortex steroid administration"], "answer": ["b"]}
{"problem_id": "112E41", "problem_text_en": "A 3-year-old boy is brought to the clinic by his parents with complaints of fever and leg pain. A month ago, he experienced pain in his left leg after twisting it. Subsequently, he also complained of pain in his right leg. Two weeks ago, he developed a fever in the range of 38°C and his leg pain increased. He was prescribed antibiotics by his usual doctor, but the fever is continuing. He is 103 cm tall, weighs 17 kg, and has a body temperature of 37.5°C. His pulse is 128 beats per minute and regular, his blood pressure is 106/70 mmHg, and there are no petechiae on his skin. The conjunctiva of the eye shows no abnormality, and there is no redness in the throat. There are no abnormal findings in the heart or breath sounds. The abdomen is flat and soft, and the liver and spleen cannot be palpated. There is no swelling or limitation of movement in the joints of the lower limbs. Blood examination: red blood cells 4.02 million, Hb 11.1 g/dL, Ht 33%, reticulocytes 1.8%, white blood cells 3,400 (neutrophils 3%, segmented neutrophils 8%, eosinophils 1%, monocytes 4%, lymphocytes 84%), and platelets 60,000. Biochemical examination showed total protein 7.5 g/dL, albumin 4.4 g/dL, total bilirubin 0.3 mg/dL, direct bilirubin 0.1 mg/dL, AST 27 U/L, ALT 19 U/L, LD 741 U/L (reference range 335-666), ALP 456 U/L (reference range 307-942), CK 60 U/L (reference range 59-332), urea nitrogen 10 mg/dL, creatinine 0.3 mg/dL, uric acid 5.5 mg/dL, Na 140 mEq/L, K 4.0 mEq/L, Cl 101 mEq/L, Ca 11.0 mg/dL, and P 6.0 mg/dL. The CRP level is 1.2 mg/dL. There are no abnormal findings on the X-ray of both lower limbs. A blood smear stained with May-Giemsa is shown separately. What is the most likely disease?", "choices_en": ["Osteomyelitis", "Osteosarcoma", "Acute leukemia.", "Aplastic anemia", "Hemophagocytic syndrome"], "answer": ["c"]}
{"problem_id": "112E42", "problem_text_en": "Read the following passage and answer questions 42 and 43. \n\nA 68-year-old woman was brought to the hospital by ambulance due to a loss of consciousness and right upper and lower limb paralysis. Medical history: She had been receiving oral medication for hypertension and atrial fibrillation using antihypertensive and anticoagulant drugs for 3 years. In the evening, she felt weakened in her right hand and had difficulty moving her right leg while shopping with her husband. She collapsed in front of her house and lost consciousness, so her husband called for an ambulance. Medical history: She was hospitalized for acute glomerulonephritis at the age of 7. Lifestyle: She has never smoked and drinks alcohol occasionally. Family history: Her father had a history of hypertension and was receiving treatment. Current condition: The patient's consciousness level was GCS 9 (E3V2M4). She was 158 cm tall, weighed 54 kg, had a body temperature of 35.8°C, a heart rate of 68 bpm with irregularity, a blood pressure of 192/88 mmHg, a respiratory rate of 10 breaths per minute, and an SpO2 of 97% (with 4 L/min of oxygen administered through nasal cannula). Jugular vein distension was not observed. On auscultation, a grade II/VI systolic murmur was heard at the apex. No abnormal breath sounds were detected. Flaccid paralysis was found in the right upper and lower limbs. Test findings: Blood test results indicated a red blood cell count of 3.98 million/µL, Hb of 10.2 g/dL, Ht of 34%, WBC of 8,800/µL, platelet count of 220,000/µL, and a PT-INR of 2.1 (reference range: 0.9-1.1). In a blood biochemical analysis, total protein was 6.8 g/dL, AST was 18 U/L, ALT was 12 U/L, blood urea nitrogen was 22 mg/dL, creatinine was 1.2 mg/dL, Na was 138 mEq/L, K was 4.8 mEq/L, and Cl was 109 mEq/L. CT revealed a widespread high-density area in the left hemisphere. After CT imaging, she returned to the treatment room, but her respiratory condition deteriorated. She had severe tongue base retraction, and manual airway management was performed, but no improvement in SpO2 was observed. What is the appropriate airway management to initiate for this patient first?", "choices_en": ["Oral endotracheal intubation", "Nasotracheal intubation", "Incision of the cricothyroid membrane", "Nasotracheal intubation", "Insertion of a laryngeal mask"], "answer": ["a"]}
{"problem_id": "112E43", "problem_text_en": "Subsequent course: The patient made a smooth recovery with drug therapy and rehabilitation. To search the literature for whether anticoagulant therapy should be resumed for this patient, the patient's problem was formulated in PICO as follows. \nPatient: A female patient with hypertension and atrial fibrillation who developed a cerebral hemorrhage.\nIntervention: Resuming anticoagulant therapy.\nComparison: Anticoagulant therapy discontinuation.\nOutcome: Which of the following is not a suitable item for (a)?", "choices_en": ["Increased bleeding", "Improvement of atrial fibrillation", "Prolongation of life prognosis", "Decrease in hospitalization opportunities", "Reduction in stroke incidence rate"], "answer": ["b"]}
{"problem_id": "112E44", "problem_text_en": "Read the following passage and answer questions 44 and 45. \nA 86-year-old man complained of right chest pain and loss of appetite. He had been an outpatient for COPD for 10 years. He had been aware of low fever, systemic fatigue, and loss of appetite for two weeks. Yesterday, right chest pain appeared, and his fever rose to 39.0℃ with worsening of right chest pain at night, so he visited the emergency department. He had a medical history of COPD and hypertension for which he was undergoing outpatient treatment. He lived with his wife and eldest son and family. He smoked 20 cigarettes a day for 50 years until he was 70 years old and drank two or three 350mL beers a day for 50 years. There is no significant family history. His current vital signs were as follows: consciousness was clear, height was 160cm, weight was 52 kg, body temperature was 38.8℃, pulse was 100 beats/min and regular, blood pressure was 120/68 mm Hg, respiratory rate was 24 breaths/min, and SpO2 was 86% (room air). There were no abnormalities in the conjunctiva and eyeball conjunctiva. There were no abnormalities in the oral cavity and pharynx. The jugular vein was not dilated. The thyroid gland and cervical lymph nodes were not palpable. Although there were no abnormalities in heart sounds, there was decreased breath sounds in the right chest. Dullness was noted in the right lung upon percussion. The abdomen was flat and soft, with no palpable liver or spleen. Muscle strength was preserved in all limbs, and there was no abnormality in tendon reflexes. Laboratory findings showed RBC count of 3.55 million, Hb 12.1g/dL, Ht 36%, WBC count 16,500 (neutrophil count 25%, lymphocyte count 7%, monocyte count 2%, eosinophil count 1%, basophil count 65%), and platelet count 400,000. Biochemistry tests showed total protein 5.9g/dL, albumin 2.2g/dL, AST 29U/L, ALT 18U/L, LD 173U/L(norm 176-353), ALP 223U/L(norm 115-359), γ-GTP 44U/L(norm 8-50), CK 260U/L(norm 30-140), blood urea nitrogen 35mg/dL, creatinine 1.6mg/dL, blood glucose 161mg/dL, HbA1c 5.7%, Na 131mEq/L, K 4.3mEq/L, Cl 97mEq/L, and Ca 8.4mg/dL. CRP was 31 mg/dL. No abnormality was found in electrocardiogram. A bed positional chest X-ray (A) and chest CT (B, C) are shown separately. What is the most likely cause of the image findings?", "choices_en": ["Hypoalbuminemia", "Pleural dissemination of lung cancer", "Phrenic nerve palsy", "Bacterial infection", "Renal failure"], "answer": ["d"]}
{"problem_id": "112E45", "problem_text_en": "What test should be done next?", "choices_en": ["Thoracentesis", "FDG-PET (Fluorodeoxyglucose-positron emission tomography)", "Echocardiogram", "Bronchoscopy exam", "Chest contrast-enhanced MRI"], "answer": ["a"]}
{"problem_id": "112E46", "problem_text_en": "Read the following passage and answer questions 46 and 47. \n\nA 67-year-old man visited the hospital because he has been urinating very little since yesterday noon. His medical history reveals that he has had frequent urination day and night for the past three months and has experienced a decrease in urine volume and residual urine after urination for the past two months. He visited the hospital because he hadn't urinated since yesterday noon and his lower abdomen was becoming distended. He has been taking over-the-counter medication since two nights ago due to poor health. He has not visited any other medical institution. He has no significant medical history. His father has diabetes. In terms of lifestyle, he has been smoking 20 cigarettes a day for 40 years and drinks occasionally. At present, he is conscious and alert with a body temperature of 35.7°C. His pulse is 104/minute and regular, and his blood pressure is 158/82mmHg. Nothing unusual is observed in the head and neck or chest. His abdomen is slightly hard and distended in the lower part with mild tenderness. A prostate that is the size of a hen's egg and elastic-soft is palpated via digital rectal examination, without tenderness. Laboratory findings show that his urine has a protein level of 1+, a glucose level of 2+, a occult blood level of 1+, and 1-5 red blood cells and 5-10 white blood cells per high-power field. His blood test results are as follows: red blood cells 4.78 million/μL, hemoglobin 14.1 g/dL, hematocrit 46%, white blood cells 7,800/μL, and platelets 350,000/μL. His blood biochemical test results are as follows: blood urea nitrogen 21mg/dL, creatinine 1.3mg/dL, Na 141mEq/L, K 4.5mEq/L, and Cl 103mEq/L. CRP was 0.5mg/dL. Which of the following questions is appropriate when considering the possibility of symptoms caused by over-the-counter medication?", "choices_en": ["\"Did you take stomach medicine?\"", "\"Did you take cold medicine?\"", "\"Have you taken sleeping pills?\"", "\"Did you take a painkiller?\"", "\"Did you take vitamin medicine?\""], "answer": ["b"]}
{"problem_id": "112E47", "problem_text_en": "Which part is involved in the pathology of this patient?", "choices_en": ["Renal artery", "Kidney", "Ureter", "Urinary bladder", "Prostate"], "answer": ["e"]}
{"problem_id": "112E48", "problem_text_en": "Read the following passage and answer questions 48 and 49.\nA 74-year-old man was hospitalized for surgery for gastric cancer, which was pointed out during an investigation of the general fatigue and decreased appetite he had been experiencing for 2 months. He had visited a clinic referred by his regular doctor 3 weeks earlier because of abdominal distension he had been experiencing for the last month and a half, and an upper gastrointestinal endoscopy had revealed a tumorous lesion and pyloric obstruction. He was diagnosed with gastric cancer and hospitalized for surgery. He has been coughing continuedly since vomiting last night. His medical history includes a diagnosis of impaired glucose tolerance during a workplace health examination at the age of 60, and he is currently receiving oral hypoglycemic drugs (sulfonylurea). His lifestyle includes smoking 15 cigarettes per day for 50 years and consuming alcohol about twice a week. His father died of lung cancer at the age of 70. On examination, he is 170 cm tall and weighs 83 kg, with a body temperature of 37.8°C, a heart rate of 80 bpm (regular), a blood pressure of 140/76 mmHg, and a respiratory rate of 20 breaths per minute. His SpO2 on room air is 96%. His conjunctivae show mild anemia but no yellowing of the ocular conjunctiva. No abnormal heart sounds are heard. Rhonchi are heard over the right posterior chest. The upper abdomen is distended but soft without any palpable fluctuation. No tenderness or muscle defense is found. Motor paralysis is not observed in his limbs. Laboratory data shows: red blood cell count of 3.34 million/μL, hemoglobin level of 9.2 g/dL, hematocrit value of 29%, white blood cell count of 10,500/μL (10% segmented neutrophils, 64% banded neutrophils, 2% eosinophils, 1% basophils, 3% monocytes, and 20% lymphocytes), and platelet count of 260,000/μL. Blood chemistry analysis results show: total protein level of 6.2 g/dL, albumin level of 2.9 g/dL, total bilirubin level of 0.9 mg/dL, AST level of 28 U/L, ALT level of 25 U/L, LDH level of 145 U/L (normal range: 176 to 353), ALP level of 206 U/L (normal range: 115 to 359), blood urea nitrogen (BUN) level of 24 mg/dL, creatinine level of 0.9 mg/dL, blood glucose level of 128 mg/dL, glycated hemoglobin (HbA1c) level of 7.9% (reference range: 4.6 to 6.2), total cholesterol level of 156 mg/dL, triglyceride level of 196 mg/dL, sodium level of 133 mEq/L, potassium level of 4.2 mEq/L, chloride level of 96 mEq/L, and C-reactive protein (CRP) level of 3.4 mg/dL. Chest X-ray reveals an infiltrative shadow in the lower right lung field. Surgery has been postponed until the patient's condition stabilizes. Which of the following should be done before the surgery to safely perform surgery in this patient?\n", "choices_en": ["Blood transfusion", "Construction of a gastric fistula", "Administration of oral rehydration solution", "Intravenous administration of antibiotics", "Increase of sulfonylurea drugs"], "answer": ["d"]}
{"problem_id": "112E49", "problem_text_en": "Which of the following is correct when participating as an assistant in a laparoscopic distal gastrectomy on the 10th day of hospitalization as the patient's condition is stable?", "choices_en": ["For disinfecting fingers, sterilized water is necessary.", "Sterilized gloves should be worn after disinfecting hands.", "Wear a sterilized hat (cap).", "Rubbing and washing fingers under running water for 10 minutes or more.", "In laparoscopic surgery, you do not wear a sterile gown."], "answer": ["b"]}
{"problem_id": "112E50", "problem_text_en": "Read the following passage and answer questions 50 and 51.\n\nA 56-year-old man was brought into the emergency room by ambulance due to chest pain. Present illness: He experienced chest pain upon waking up. After 10 minutes had passed and the pain had not improved, he requested an ambulance. When the ambulance arrived, he had profuse cold sweat and complained of nausea during transport. Although he usually does strenuous work in the construction industry, he has never experienced chest pain like this before. Past medical history: He was identified to have hypertension and hyperglycemia during a workplace health check but did not seek medical care. He has no current medications and no history of allergies. Personal history: He lives with his wife and son. He has smoked 20 cigarettes a day for 36 years and drinks around 2 go (360 mL) of shochu on weekends. Family history: His elder brother died of acute myocardial infarction at the age of 48. Current status: The patient is alert and his facial expression is anguish-like. He is 165 cm tall and weighs 84 kg. His body temperature is 36.2°C. His blood pressure is 160/96 mmHg, and his pulse rate is 120 beats per minute and regular. His respiratory rate is 20 breaths per minute. His SpO2 is 97% (with 3 liters/minute oxygen via nasal cannula). There is no abnormality in the conjunctiva or eyeball. His jugular veins cannot be assessed due to obesity. No heart murmur is heard. Coarse crackles are heard in the lower lung fields bilaterally. His abdomen is flat and soft, and his liver and spleen cannot be palpated. No edema is observed in his lower extremities. Laboratory findings: Urinalysis: Protein 1+, Glucose 2+. Blood test: Red blood cell count 4.63 million/µL, hemoglobin 13.2 g/dL, hematocrit 40%, white blood cell count 12,000/µL, and platelet count 280,000/µL. Blood biochemistry: Total protein 6.0 g/dL, albumin 3.2 g/dL, blood urea nitrogen 30 mg/dL, creatinine 1.5 mg/dL, blood glucose 230 mg/dL, Na 130 mEq/L, K 4.4 mEq/L, and Cl 97 mEq/L. His rapid cardiac troponin T test is positive. 12-lead electrocardiography shows atrial fibrillation and wide-ranging ST elevation in the anterior chest. What information is useful for the diagnosis of this patient's chest pain?\n\n50. この患者の既往歴について、どのような情報が得られるか。\n\nWhat information is provided about the patient's medical history?\n\n51. この患者の胸痛について、診断に有用な情報はどれか。\n\nWhat information is useful for the diagnosis of this patient's chest pain?", "choices_en": ["Pain near the left breast", "Pain exacerbated by drinking water", "Pain radiating to the lower jaw", "Pain that worsens during inspiration (breathing in)", "Pain when clothing touches the skin"], "answer": ["c"]}
{"problem_id": "112E51", "problem_text_en": "What are the most likely physical findings observed when the blood pressure drops to 70/40 mmHg in the emergency room?", "choices_en": ["Tetany", "Swelling of the lips", "Skin flushing", "Purpura of the lower limbs", "Peripheral coldness of limbs"], "answer": ["e"]}
