{"problem_id": "112A1", "problem_text_en": "What disease causes hyperammonemia?", "choices_en": ["Gaucher disease.", "Von Gierke disease.", "Hurler syndrome", "Maple syrup urine disease", "Ornithine transcarbamylase deficiency"], "answer": ["e"]}
{"problem_id": "112A2", "problem_text_en": "Which of the following does not cause secondary anhidrosis?", "choices_en": ["Diabetes", "Fabry disease", "Sjögren's syndrome.", "Hypothyroidism", "Allergic contact dermatitis"], "answer": ["e"]}
{"problem_id": "112A3", "problem_text_en": "Which of the following does not cause hyperuricemia?", "choices_en": ["Thiazide diuretic", "Lesch-Nyhan syndrome", "Tumor lysis syndrome", "Fanconi syndrome", "Chronic kidney failure"], "answer": ["d"]}
{"problem_id": "112A4", "problem_text_en": "Which of the following is correct when diagnosed with enterohemorrhagic Escherichia coli infection?", "choices_en": ["Subject to hospitalization recommendation.", "Report must be made within one week.", "The recipient of the notification is the mayor of the city or town.", "Medical expenses will be fully covered by public funds.", "For children, it will result in suspension from attendance."], "answer": ["e"]}
{"problem_id": "112A5", "problem_text_en": "Which of the following statements is true about Mallory-Weiss syndrome?", "choices_en": ["It will heal naturally.", "Laceration runs horizontally.", "The lesion affects the entire layer of the wall.", "It occurs most frequently on the greater curvature of the stomach.", "Lesions are also present in the duodenum."], "answer": ["a"]}
{"problem_id": "112A6", "problem_text_en": "Which of the following is correct about sleep?", "choices_en": ["Experiencing dreams occurs during the shallow non-REM sleep stage.", "Deep non-REM sleep decreases towards the morning.", "REM sleep is characterized by slow eye movements.", "Infants have less REM sleep than adults.", "Total sleep time remains constant after adolescence."], "answer": ["b"]}
{"problem_id": "112A7", "problem_text_en": "Which of the following statements is true about amniotic fluid embolism?", "choices_en": ["Common before amniotic fluid rupture.", "The prognosis of the mother is good.", "The mother's lower abdomen becomes flat and hard.", "Accompanied by disseminated intravascular coagulation (DIC).", "More likely to be complicated with pregnancy-induced hypertension."], "answer": ["d"]}
{"problem_id": "112A8", "problem_text_en": "What is the first treatment option for prostate cancer with asymptomatic bone metastases?", "choices_en": ["Administration of PDE5 (phosphodiesterase 5) inhibitors.", "Chemotherapy for cancer", "Hormone therapy", "Transurethral laser resection of the prostate", "Robot-assisted laparoscopic radical prostatectomy"], "answer": ["c"]}
{"problem_id": "112A9", "problem_text_en": "Which of the following statements is correct regarding mucinous encephalopathy?", "choices_en": ["More common in males.", "Common in the summer.", "Also known as Hashimoto's encephalopathy.", "Administration of thyroid hormone is not necessary in treatment.", "Other factors are layered on top of the underlying thyroid disease."], "answer": ["e"]}
{"problem_id": "112A10", "problem_text_en": "What is the refractive power of the eye of an adult with a far point of 50 cm and a near point of 25 cm?", "choices_en": ["1.0 diopter (measurement of lens power or refractive error)", "2.0 diopters (measurement unit for optical power or the ability of the lens to refract light, commonly used in eyeglasses prescriptions)", "4.0 diopters", "6.0 diopters", "8.0 diopters"], "answer": ["b"]}
{"problem_id": "112A11", "problem_text_en": "Which of the following statements is correct about immune thrombocytopenic purpura (ITP)?", "choices_en": ["It is a congenital disease.", "Decrease in bone marrow megakaryocytes.", "Prone to subcutaneous bleeding.", "Prone to intra-articular bleeding.", "Prone to intramuscular bleeding."], "answer": ["c"]}
{"problem_id": "112A12", "problem_text_en": "In a patient with acute myocardial infarction on the third day of onset, systolic murmur suddenly appeared. What are the possible causes? Select two.", "choices_en": ["Aortic valve stenosis and regurgitation", "Left ventricular free wall rupture", "Dissecting aortic aneurysm", "Ventricular septal defect", "Nipple muscle rupture"], "answer": ["d", "e"]}
{"problem_id": "112A13", "problem_text_en": "Which two of the following statements are correct regarding femoral hernia?\n\n（１）女性に多い。\n（２）鼡径部から突出する。\n（３）トレーニング中のスモウズビー・リフトで発症することが多い。\n（４）血行障害が合併することがある。\n（５）内固定器を用いる手術が適している。\n\n1. It is more common in women.\n2. It protrudes from the femoral region.\n3. It often occurs during the Snatch Lift during training.\n4. It may be accompanied by circulatory disorders.\n5. Surgery using internal fixators is suitable.", "choices_en": ["More common in males.", "Bilateral dominance.", "Prone to intussusception.", "Common in elderly people.", "Touching the outside of the femoral artery."], "answer": ["c", "d"]}
{"problem_id": "112A14", "problem_text_en": "The photos of medical instruments (①-⑤) are shown separately. Which instruments are used for endoscopic examination from the nasal cavity to the upper pharynx and larynx, after nasal manipulation has been performed on an adult? Select two.", "choices_en": ["① (pronounced as \"ichi\" in Japanese) means \"1\" in English.", "Sorry, but ② is not a word or phrase that can be translated without more context. It is just a numeral used in a multiple-choice question to identify one of the answer options.", "Sorry, without additional context, it is difficult to determine the correct translation of choice ③. Please provide more information so that I can assist you better.", "Sorry, it's not possible to translate the choice \"④\" without any context. It is a numerical symbol used in Japanese language to denote a particular option or selection in a list or menu.", "Unfortunately, without context or additional information, I cannot provide an accurate translation for this choice as it is simply a numerical symbol. Please provide more context or information if possible."], "answer": ["b", "c"]}
{"problem_id": "112A15", "problem_text_en": "Which of the following can be diagnosed on early pregnancy ultrasound examination? Select three.\n\n(Note: Since the original sentence is incomplete without the options, a complete translation of the options is needed to translate the sentence accurately.)", "choices_en": ["Missed abortion", "Ectopic pregnancy", "Fetal growth restriction", "Trisomy 21 in fetus (Down syndrome)", "Dichorionic diamniotic twins"], "answer": ["a", "b", "e"]}
{"problem_id": "112A16", "problem_text_en": "A 50-year-old woman came to the hospital complaining of subcutaneous bleeding throughout her body and nosebleeds. A bruise appeared on her right shoulder without apparent cause. Later, bruises appeared on her thighs and shins, and she came to the hospital this morning because her nosebleeds wouldn't stop. She had surgery and received chemotherapy for breast cancer 5 years ago. Blood test results showed: Hemoglobin 8.8 g/dL, Hematocrit 25%, White blood cells 700, Platelets 51,000, PT-INR 1.2 (reference range 0.9 to 1.1), APTT 30.6 seconds (reference range 32.2), Plasma fibrinogen 74 mg/dL (reference range 200 to 400), Serum FDP 110 μg/mL (reference range 10 or less), and D-dimer 9.6 μg/mL (reference range 1.0 or less). A bone marrow blood smear with May-Giemsa staining is shown separately. What is the appropriate medication for treating this patient?", "choices_en": ["Anti-estrogenic drug(s)", "All-trans retinoic acid", "Tranexamic acid", "Docetaxel", "Heparin"], "answer": ["b"]}
{"problem_id": "112A17", "problem_text_en": "A 62-year-old man received treatment with ampicillin and was unable to wean from mechanical ventilation after surgery for esophageal cancer. On the morning of the third postoperative day, he showed a fever of 39.1℃ and increased sputum, and a new infiltrative shadow was seen in the lower right lung field on chest X-ray. Blood and sputum cultures were performed and the antibiotic was changed, but a fever over 39℃ persisted on the fourth postoperative day. The culture results are still unknown. Which of the following is not an appropriate response at this point?\n\n", "choices_en": ["Elevate the upper body by 30 degrees.", "Confirm the characteristics of drainage fluid.", "Check the cuff pressure of the tracheal tube.", "Change the antimicrobial agent again.", "Confirm the status of the wound."], "answer": ["d"]}
{"problem_id": "112A18", "problem_text_en": "A 54-year-old woman presents with persistent lower back pain, chest deformity, and abnormal test results. She has had lower back pain for 2 years and was prescribed non-steroidal anti-inflammatory drugs by an orthopedist near her home, but the pain persisted. Her chest became deformed and her height decreased by 12 cm about 6 months ago. Recently, her lower back pain worsened, and she developed tooth pain and a numb sensation throughout her body. Blood tests and X-rays were performed, and she was referred to a specialist due to multiple abnormalities, including significant bone deformities with fracture lines. She is 138 cm tall and weighs 40 kg, with a body temperature of 36.5°C, pulse rate of 84 beats per minute, and blood pressure of 150/96 mmHg. There are no abnormalities in her eye conjunctiva or eyeballs. Her oral cavity is moist and has multiple teeth. There is no swelling in her superficial lymph nodes. Her chest has significant deformities and indentations. There are no abnormalities in her heart sounds or breathing sounds. Her abdomen is flat, soft, and the liver and spleen cannot be palpated. No abnormalities are found in her cranial nerves. The muscle strength of her upper limbs is normal, but that of her trunk and lower limbs is decreased due to pain. The tendon reflex in her lower limbs is decreased. Blood tests show red blood cells of 4.12 million/uL, Hb of 13.5 g/dL, white blood cells of 5,800/uL, and platelets of 220,000/uL. The blood biochemical test shows a total protein of 7.4 g/dL, albumin of 4.5 g/dL, total bilirubin of 0.7 mg/dL, AST of 21 U/L, ALT of 15 U/L, ALP of 1,725 U/L (reference range of 115-359), γ-GTP of 10 U/L (reference range of 8-50), blood urea nitrogen of 14 mg/dL, creatinine of 0.6 mg/dL, Na of 144 mEq/L, K of 4.7 mEq/L, Cl of 109 mEq/L, Ca of 8.7 mg/dL, P of 0.9 mg/dL, and CRP of 0.1 mg/dL. What is the most likely diagnosis?", "choices_en": ["Tumor-induced osteomalacia", "Renal osteodystrophy", "Postmenopausal osteoporosis", "Pseudohypoparathyroidism", "Primary hyperparathyroidism"], "answer": ["a"]}
{"problem_id": "112A19", "problem_text_en": "A 69-year-old man presents with difficulty walking. He reports gradually worsening instability while walking over the past month. His medical history includes total gastrectomy for gastric cancer 9 years ago. He is alert and oriented. His height is 155 cm, weight is 44 kg, and vital signs are: temperature, 36.1 °C (97.0 °F); pulse rate, 60 beats/minute and regular; blood pressure, 106/58 mmHg; respiratory rate, 18/minute. Cardiovascular and respiratory examination is unremarkable. Abdomen is flat, soft and non-tender, with no palpable liver or spleen. Laboratory findings demonstrate hemoglobin of 9.4 g/dL, hematocrit of 28%, leukocyte count of 4,400/μL, and platelet count of 87,000/μL. Blood chemistry tests reveal total protein of 7.2 g/dL, albumin of 4.4 g/dL, total bilirubin of 1.5 mg/dL, AST of 25 U/L, ALT of 20 U/L, and LD of 332 U/L (range, 176-353 U/L). C-reactive protein (CRP) is 0.1 mg/dL. MRI of the cervical spine shows findings consistent with spinal cord compression (T2-weighted image). What is the most likely symptom that this patient is experiencing?", "choices_en": ["Feeling dizzy in the dark.", "Difficulty standing on one leg.", "Unable to hold back urine (urgent urination)", "The bathwater temperature is difficult to determine.", "Difficulties taking the first step when starting to walk."], "answer": ["a"]}
{"problem_id": "112A20", "problem_text_en": "A 22-year-old male construction worker developed headache and nausea while working on road construction on a hot day and was brought to the hospital in a company vehicle. He had a history of hospitalization for spontaneous pneumothorax at the age of 17, and there was nothing noteworthy in his family history. His consciousness level was JCS I-1. He was 172 cm tall, weighed 57 kg, and had a body temperature of 38.9℃. His pulse rate was 124 beats/minute and regular, blood pressure was 96/48 mmHg, and respiratory rate was 12 breaths/minute. He was not sweating but had a sense of heat from the trunk to the periphery. His pupils were 4 mm bilaterally and the light reflex was normal. He had little venous pressure while lying down. There were no abnormalities in his heart sounds or respiratory sounds, and no edema in his lower legs. His symptoms improved after receiving IV fluids. What is the appropriate guidance for him to return to work in the same position?\n\n", "choices_en": ["Reduce intake of salt.", "Start with a short task.", "Avoid spending time in air-conditioned rooms.", "We recommend wearing work clothes that suppress air permeability.", "Take in a large amount of water at infrequent intervals."], "answer": ["b"]}
{"problem_id": "112A21", "problem_text_en": "A 78-year-old man is admitted 4 days after undergoing right upper lobe resection and lymph node dissection for lung cancer. Postoperative recovery has been favorable, but the chest drain is kept in place due to slight air leak and slight bloody discharge. The patient has exhibited signs of delirium since yesterday. He went to bed around 9 PM today, but was found awake 2 hours later with the chest tube removed. There was no change in breath sounds, and chest X-ray taken immediately showed no changes compared to the image taken during the day. His SpO2 was 99% (with 2 L/min oxygen via nasal cannula) and did not decrease compared to before the removal of the chest tube. What is the appropriate course of action to be taken?", "choices_en": ["Perform a right thoracentesis.", "Suture the drainage insertion site.", "Start artificial respiration management under tracheal intubation.", "Re-insert a dislodged chest tube through the insertion site.", "Replace the nasal cannula with a mask and administer oxygen at 8 L/min."], "answer": ["b"]}
{"problem_id": "112A22", "problem_text_en": "A 75-year-old male patient comes to the clinic complaining of a skin rash on his head. The rash appeared on the same site where he had a bruise three months ago, gradually expanding and becoming so sensitive that slight pressure leads to bleeding. A photograph of the head is shown separately. Which statement is true about this condition?", "choices_en": ["Easily metastasizes to the lungs.", "Biopsy is contraindicated.", "It is related to HIV infection.", "Common in Kyushu and Okinawa region.", "Laser therapy is remarkably effective."], "answer": ["a"]}
{"problem_id": "112A23", "problem_text_en": "A 71-year-old woman presented with a complaint of fever and bilateral leg edema. She has been receiving treatment for type 2 diabetes near her home since the age of 65, and there has been no diagnosis of retinopathy. She started to notice a fever in the 37-degree range and bilateral leg edema about a month ago. She was referred for examination after being told of blood and protein in her urine by her regular physician. Her body temperature is 37.6°C, pulse rate is 92/minute and regular, blood pressure is 146/88 mmHg, respiratory rate is 16/minute, and SpO2 is 98%. There are no abnormalities in heart sounds or breath sounds. Bilateral leg edema and livedo racemosa are observed. Reduced thermal sensation is observed in the left lower leg. Urinalysis shows protein 3+, occult blood 3+, and red blood cells and white blood cells in the sediment (50-100/HPF and 10-20/HPF, respectively), as well as red blood cell casts. Blood test results show red blood cells 3.24 million/µL, Hb 10.0 g/dL, Ht 31%, white blood cells 10,300/µL, with segmented neutrophils 20%, banded neutrophils 52%, eosinophils 1%, basophils 1%, monocytes 3%, and lymphocytes 22%, and platelets 220,000/µL. Biochemical test results show total protein 6.0 g/dL, albumin 2.3 g/dL, blood urea nitrogen 40 mg/dL, creatinine 2.5 mg/dL, blood glucose 98 mg/dL, HbA1c 5.8% (reference range 4.6-6.2%), Na 138 mEq/L, K 5.0 mEq/L, and Cl 100 mEq/L. Immunoserological test results show CRP 6.5 mg/dL, RF negative, ANA negative, MPO-ANCA 84 U/mL (reference range less than 3.5), and PR3-ANCA less than 3.5 U/mL (reference range less than 3.5). There is no abnormality on chest X-ray. A PAS-stained section of the kidney biopsy specimen is shown separately. What treatment should be started for this patient first?", "choices_en": ["Hemodialysis", "Plasma exchange", "Administration of Vitamin B12 preparations", "Methotrexate administration", "Adrenocortical steroid administration"], "answer": ["e"]}
{"problem_id": "112A24", "problem_text_en": "A 69-year-old man presented with general fatigue and loss of appetite. He underwent total gastrectomy for advanced gastric cancer two years ago and did not seek medical attention thereafter. However, he began to feel fatigue three months ago, and recently his loss of appetite has worsened to the point where he eats less than one-third of his usual intake, causing him to become anxious and seek medical attention. He is 170 cm tall and weighs 45 kg. His body temperature is 36.2℃, pulse rate is 80 bpm and regular, blood pressure is 130/70 mmHg, and respiratory rate is 14 breaths/min. Chest X-ray reveals multiple lung metastases. Abdominal CT and ultrasonography reveal multiple liver metastases and mild ascites. The patient has no nausea, vomiting, dyspnea, or pain, and he and his family hope for home medical care. What is the appropriate treatment approach going forward?", "choices_en": ["Surgical resection", "Chemotherapy for cancer", "Home oxygen therapy", "Home parenteral nutrition", "Hospice admission"], "answer": ["d"]}
{"problem_id": "112A25", "problem_text_en": "A 25-year-old man presents with difficulty walking. Since the age of 13, he has noticed difficulty releasing objects when carrying heavy bags or squeezing towels tightly, but he has had no problems with his motor skills. At the age of 20, he began to experience difficulty opening bottle caps. He came for examination because he was told by others that he had an abnormal gait six months ago. There is a family history of similar symptoms in his paternal cousins. He is fully conscious. His height is 172 cm, weight is 62 kg, temperature is 36.2°C, pulse rate is 92/min and regular, blood pressure is 112/72 mmHg, and respiratory rate is 24/min. His cardiac sounds and breath sounds are normal. His abdomen is flat and soft without palpable liver or spleen. Mild atrophy is noted in the bilateral temporalis and sternocleidomastoid muscles. There is muscle wasting in the distal muscles of both legs, and manual muscle testing reveals a strength of 3. His tendon reflexes are reduced, and pathological reflexes are not observed. Blood findings: RBC 4.93 million, Hb 14.2 g/dL, Hct 44%, WBC 5,900, and platelets 160,000. Blood chemistry results: total protein 6.8 g/dL, albumin 4.1 g/dL, AST 40 U/L, ALT 49 U/L, LD 282 U/L (reference range 176-353), CK 528 U/L (reference range 30-140), glucose 103 mg/dL, HbA1c 6.2% (reference range 4.6-6.2), Na 142 mEq/L, K 4.0 mEq/L, and Cl 103 mEq/L. CRP is 0.2 mg/dL. The before and after photos of the patient's thumb ball being hit with a hammer are also shown. This limb position persisted for several seconds after hitting. What is this sign called?", "choices_en": ["Ape hand (a hand deformity often seen in patients with a lesion in the median nerve)", "Tetanus", "Dystonia", "Myotonia", "Cataplexy"], "answer": ["d"]}
{"problem_id": "112A26", "problem_text_en": "A 67-year-old woman presents with a chief complaint of insomnia. She has been experiencing an uncomfortable sensation of insects crawling on both legs at night for the past month. This discomfort is exacerbated by keeping still, but is relieved by moving her legs. Her primary care physician advised her to monitor her symptoms, but her condition did not improve. She is strongly compelled to move her legs and is unable to sleep, which led her to seek medical attention. Her four limb muscle tone is normal and no muscle weakness is detected. Her tendon reflexes are normal and Babinski's sign is negative. She has no sensory disorders or cerebellar ataxia. There is no difficulty in walking or performing activities of daily living. Her blood biochemical examination, including serum ferritin, is normal. Which of the following is the appropriate medication for her condition?", "choices_en": ["Beta blockers", "Muscle relaxant", "Anticholinergic drugs", "Dopamine receptor agonist", "Acetylcholinesterase inhibitor"], "answer": ["d"]}
{"problem_id": "112A27", "problem_text_en": "A 30-year-old woman presents with lower abdominal pain. She woke up 3 days ago with pain on the left side of her lower abdomen, which persisted at the same intensity, prompting her to come to the hospital today (17th day of menstrual cycle). The pain has decreased since this morning. She denies nausea and vomiting. She had gynecological screening 4 weeks ago and no abnormalities were detected in her uterus or ovaries. Her last menstrual period was 17 days ago and lasted for 5 days. Her menstrual cycle is regular with a 28-day cycle. She is 160 cm tall and weighs 52 kg. Her temperature is 36.5°C, pulse 72 beats per minute, regular. Blood pressure is 108/68 mmHg, respiratory rate is 18 breaths per minute. Her abdomen is flat, soft and there is no muscular defense noted. A pelvic examination reveals mild tenderness on the left ovary. No abnormalities are noted on the uterus or right ovary. Laboratory findings include: red blood cell count 3.8 million/µL, Hb 10.4 g/dL, Hct 31%, white blood cell count 5,800/µL, and platelet count 160,000/µL. The blood biochemistry tests reveal that the total protein is 7.3 g/dL, albumin is 4.3 g/dL, total bilirubin is 0.3 mg/dL, AST is 18 U/L, ALT is 16 U/L, LD is 195 U/L (normal range: 176-353), urea nitrogen is 18 mg/dL, and creatinine is 0.6 mg/dL. CRP is 0.3 mg/dL. The pregnancy test is negative. A transvaginal ultrasound image of the left ovary is shown separately. What is the appropriate management?", "choices_en": ["Observation; follow-up observation; watchful waiting.", "Administration of antibiotics", "Anticoagulant therapy", "Needle aspiration of a cyst", "Left salpingo-oophorectomy (i.e. surgical removal of the left fallopian tube and ovary)"], "answer": ["a"]}
{"problem_id": "112A28", "problem_text_en": "A 25-year-old woman comes to the hospital with chief complaint of dyspnea. She had a fever of about 38°C for 5 days, sore throat, upper abdominal pain, and decreased appetite, and was diagnosed with a cold-related gastroenteritis at a nearby clinic 3 days ago and was prescribed a cold medicine and an antidiarrheal agent, but her symptoms did not improve. Last night, she felt a discomfort in her anterior chest and today she developed dyspnea and thus decided to seek medical attention. There is no noteworthy past medical history. She has never been pregnant. Her last menstrual period was two weeks ago. Her consciousness is clear, but her facial expression looks painful. Her body temperature is 36.8°C. Her pulse rate is 92 bpm and regular. Her blood pressure is 72/48mmHg. Her respiratory rate is 36 /min. Her SpO2 is 82% (room air). Coldness is felt in the extremities. Cyanosis is observed at the lips. Distended neck veins are observed. The third and fourth heart sounds are heard on auscultation. Wheezes and coarse crackles are heard on auscultation on both sides of the chest. Her abdomen is flat, soft, and liver and spleen are not palpated. Blood test results show: red blood cells of 4.82 million, Hb of 14.1 g/dL, Ht of 41%, white blood cells of 14,200, and platelets of 170,000. Blood chemistry results show total protein of 6.4 g/dL, albumin of 3.8 g/dL, total bilirubin of 1.1 mg/dL, AST of 519 U/L, ALT of 366 U/L, LD of 983 U/L (reference range: 176-353), CK of 222 U/L (reference range: 30-140), blood urea nitrogen of 23 mg/dL, creatinine of 1.0 mg/dL, blood sugar of 199 mg/dL, Na of 128 mEq/L, K of 4.4 mEq/L, and Cl of 99 mEq/L. CRP is 2.1mg/dL. Troponin T is positive. Arterial blood gas analysis (room air) shows: pH of 7.32, PaCO2 of 20 Torr, and HCO3- of 10 mEq/L. Portable chest x-ray in a supine position (A), electrocardiogram (B), and echocardiogram (C) are shown separately. What is the most likely diagnosis?", "choices_en": ["Hypertrophic cardiomyopathy", "Acute myocardial infarction", "Brugada syndrome", "Infective endocarditis", "Viral myocarditis"], "answer": ["e"]}
{"problem_id": "112A29", "problem_text_en": "A 3-year-old girl was pointed out to have a strabismus during a 3-year-old health checkup and was brought to the hospital. Her visual acuity was 0.1 in the right eye (0.4×+1.0D) and 1.0 in the left eye (not correctable). Refractive tests using a cycloplegic eye drop revealed ＋4.5D in the right eye and ＋3.0D in the left eye. No abnormalities were found on neurological examination. A photo of the eye position is shown separately. What is the first action to take?", "choices_en": ["Observation of progress or observation without any particular intervention", "Glasses correction", "Strabismus surgery", "Healthy eye occlusion (for treatment)", "Atropine eye drops"], "answer": ["b"]}
{"problem_id": "112A30", "problem_text_en": "A 5-year-old boy is brought to the hospital by his parents with complaints of headache and vomiting. He has been gradually experiencing unsteady gait since a month ago. Headache and vomiting have been occurring for a week. The headache is severe upon awakening in the morning. The vomiting is projectile, but the child feels better immediately after and can eat and drink. He is alert and conscious with a body temperature of 36.2℃, pulse rate of 92 beats/min, regular blood pressure of 116/78 mmHg, and respiratory rate of 20 breaths/min. Considering a referral to a general hospital that can perform CT examinations, what must be done first in our hospital to determine the urgency of the situation?", "choices_en": ["Brain waves.", "Ophthalmoscopy", "Visual field test", "Cerebrospinal fluid examination", "Head X-ray imaging"], "answer": ["b"]}
{"problem_id": "112A31", "problem_text_en": "A 64-year-old woman complains of redness and double vision in her right eye and has been aware of these symptoms for two weeks. She is alert and oriented. Her body temperature is 36.4°C, pulse rate is 76 beats per minute and regular, blood pressure is 124/82 mmHg, and respiratory rate is 16 breaths per minute. Right lateral rectus palsy is observed. A vascular murmur is heard at the outer edge of the right eye socket. Photographs of both eyes (A), T1-weighted MRI images of the head (B), and lateral images of right internal carotid angiography (C) are shown separately. Which of the following is the most appropriate treatment?", "choices_en": ["Orbital tumor resection", "Cavernous sinus thrombosis surgery", "Surgical removal of cerebral arteriovenous malformation", "Carotid artery stenting procedure", "Clipping surgery for cerebral aneurysm in the neck region."], "answer": ["b"]}
{"problem_id": "112A32", "problem_text_en": "A 7-year-old girl presented with the complaint of constantly wet underwear despite being toilet trained at the age of 3. She claims she is not experiencing any leakage. On venous urography, complete duplication of the renal pelvis and ureter is observed bilaterally. On cystoscopy, two ureteral orifices are identified on the right and one on the left. What is the cause of the urinary incontinence?", "choices_en": ["Retrocaval ureter", "Posterior urethral valve", "Ectopic ureter", "Ureteral tumor", "Vesicoureteral reflux"], "answer": ["c"]}
{"problem_id": "112A33", "problem_text_en": "A 60-year-old female presented with blood in stool and abdominal pain. She had a history of constipation and the last bowel movement was 5 days ago. Two days ago, she developed abdominal pain and visited the hospital after passing fresh blood in the stool a few times. She is currently under treatment for hyperlipidemia and diabetes. Her body temperature is 36.7 °C, and her pulse rate is 92 bpm and regular. Her blood pressure is 126/84 mmHg, and her conjunctivae are not anemic. Her abdomen is flat, soft, and no liver/spleen enlargement is detected. Tenderness is observed in the lower abdomen. Blood test results show red blood cells of 4.3 million/µL, Hb of 13.1 g/dL, Ht of 39%, white blood cells of 8,700/µL, and platelets of 190,000/µL, and CRP of 1.2 mg/dL. Colonoscopy was performed, and a separate image of the sigmoid colon was shown. Which of the following is the appropriate response?", "choices_en": ["Fasting", "Rectal administration of adrenal cortex steroids", "Endoscopic hemostasis", "Superior mesenteric artery embolization (SMA embolization)", "Colectomy"], "answer": ["a"]}
{"problem_id": "112A34", "problem_text_en": "A 2-year-old boy was brought to the clinic by his mother after she noticed that his scrotum was of different sizes during a bath. The child does not experience any pain. Separate photos of the external appearance of the genitals and of the right scrotum illuminated with a penlight are provided. Which of the following is the correct explanation to be given to the mother?", "choices_en": ["\"The difference between the left and right scrotum tends to naturally disappear\"", "\"Let's insert a needle into the scrotum to confirm its contents.\"", "\"We suspect a tumor, so we will investigate it more thoroughly.\"", "\"There is an intestine protruding into the scrotal sac.\"", "\"Emergency surgery is necessary.\""], "answer": ["a"]}
{"problem_id": "112A35", "problem_text_en": "A 68-year-old man presented with swelling in the right cheek. He was diagnosed with right maxillary cancer a year and a half ago and underwent partial maxillectomy and radiation therapy, and the tumor disappeared. Two weeks ago, he noticed swelling and mild pain and discomfort in his right cheek. He has no history of sinusitis. He has been smoking 20 cigarettes a day for 48 years and drinks occasionally. He is 165 cm tall and weighs 48 kg. His body temperature is 36.8°C. Urine test result showed no abnormalities. Blood test results: RBC 4.3 million, WBC 7,800, Platelets 150,000. CRP 0.5mg/dL. The photos of the face (A) and horizontal (B) and coronal (C) MRI images of the head are separately shown. What is the most likely condition?", "choices_en": ["Erysipelas", "Recurrence of maxillary cancer", "Acute sinusitis", "Radiation dermatitis", "Postoperative maxillary cyst"], "answer": ["b"]}
{"problem_id": "112A36", "problem_text_en": "A 10-year-old girl is brought to the clinic by her father with a complaint of bloody stools. She had eaten yakiniku (grilled meat) with her family six days ago. Three days ago, she developed watery diarrhea, and yesterday, she began to have bloody stools and severe abdominal pain, prompting her to seek medical attention. She is 135 cm tall, weighs 32 kg, and has a body temperature of 37.2 °C. Her pulse is 84/min and regular, and her blood pressure is 120/70 mmHg. Laboratory findings include red blood cells of 2.5 million, Hb of 8.2 g/dL, Ht of 25%, WBC of 9,000 (neutrophils 10%, band forms 70%, lymphocytes 20%), and platelets of 80,000. A peripheral blood smear stained with May-Giemsa is shown separately. Which complication is the patient at risk for?", "choices_en": ["Acute kidney injury", "Acute liver failure", "Ulcerative colitis", "Autoimmune hemolytic anemia", "Disseminated intravascular coagulation (DIC)"], "answer": ["a"]}
{"problem_id": "112A37", "problem_text_en": "A 49-year-old man presents with high fever. He has been experiencing fever, cough and purulent sputum for the past 3 days. He has no relevant medical history. On examination, he is conscious and his temperature is 39.5°C. His pulse is 116 bpm and blood pressure is 128/82 mmHg. His respiratory rate is 24 bpm. Coarse crackles are heard on auscultation over the right lung. Laboratory findings show white blood cell count of 19,200 (polymorphonuclear neutrophils 84%, lymphocytes 10%, monocytes 2%, and immature neutrophils 4%). Blood biochemistry shows AST of 48 U/L, ALT of 42 U/L and CRP of 19.8 mg/dL. Kidney function is normal. Chest X-ray shows an infiltrative shadow in the right lower lung field. Acute pneumonia is diagnosed, and the patient is hospitalized and started on intravenous administration of sulbactam/ampicillin combination. If the same dose is given once a day, what is the most appropriate method of administration for this patient?", "choices_en": ["Single oral administration", "Single intramuscular injection", "One-time intravenous drip injection", "Two intravenous drip injections", "Three times intravenous drip"], "answer": ["e"]}
{"problem_id": "112A38", "problem_text_en": "A 46-year-old male presents with a complaint of a pruritic rash all over his body. Three months ago, he noticed an itchy rash on his thighs, groin, and hands. He was prescribed antihistamines and corticosteroid creams at a nearby clinic, but they did not alleviate his symptoms and his rash gradually spread, prompting him to seek medical attention. He is a caregiver at a nursing home for the elderly. Upon examination, multiple papules with scales were found throughout his body, including his groin area. Photos of his groin and dorsum of the hand (A, B) and a dermoscopy image of his palm (C) are shown separately. What is the appropriate response?", "choices_en": ["Report to the public health center.", "Boiling and disinfecting clothing.", "Start treatment while managing individual rooms.", "Work should be prohibited until the rash is completely healed.", "Conduct interviews and examinations on staff and residents of the workplace facility."], "answer": ["e"]}
{"problem_id": "112A39", "problem_text_en": "A 56-year-old man is hospitalized for evaluation of a tumorous lesion in the liver. Upon follow-up observation of hepatitis C, a tumorous lesion was found on abdominal ultrasound, leading to hospitalization. After admission, abdominal contrast-enhanced CT was performed, and the serum creatinine level, which was 1.1 mg/dL at admission, increased to 3.0 mg/dL on the second day after the contrast study. The patient did not receive any new medications after admission and was able to consume the full amount of meals daily, with stable body weight. Body temperature, pulse, blood pressure, and respiratory rate were all within the normal range, and the number of urinations did not change at 5-6 times per day. On the second day after the contrast study, laboratory findings were as follows: urine test: protein (-), glucose (-), occult blood (-), red blood cells 1-4 / 1 field, white blood cells 1-4 / 1 field. Blood tests: red blood cells 3,020,000, Hb 10.4 g/dL, Ht 31%, white blood cells 4,600, platelets 160,000. Blood chemistry: total bilirubin 1.4 mg/dL, direct bilirubin 0.8 mg/dL, AST 45 U/L, ALT 62 U/L, LD 360 U/L (reference range 176-353), ALP 380 U/L (reference range 115-359), gamma-GTP 110 U/L (reference range 8-50), blood urea nitrogen 43 mg/dL, creatinine 3.0 mg/L, uric acid 8.8 mg/dL, Na 136 mEq/L, K 5.2 mEq/L, Cl 100 mEq/L, Ca 8.2 mg/dL, P 6.2 mg/dL. CRP 0.3mg/dL. Abdominal ultrasound did not reveal hydronephrosis in both kidneys. Which of the following is the appropriate response?", "choices_en": ["Emergency hemodialysis", "Longitudinal renal function assessment", "Indwelling urinary catheterization", "Repeat abdomen contrast CT scan.", "Preparation for arteriovenous shunt surgery"], "answer": ["b"]}
{"problem_id": "112A40", "problem_text_en": "A 67-year-old man presents with weakness in the right upper and lower extremities. He sought medical attention because his symptoms, such as not being able to open the car door with his right hand and dragging his right foot while walking, have gradually progressed over the past two weeks. His level of consciousness is JCS I-3, and his body temperature is 36.2℃. His pulse is 72 beats per minute and regular, and his blood pressure is 142/80 mmHg. He has a right-sided hemiplegia. Head MRI images (A) and H-E stained tissue samples obtained from a lesion in the left frontal lobe by stereotactic brain biopsy (B), and immunohistochemical staining of the tissue sample with anti-CD20 antibody (C) are shown separately. FDG-PET shows no abnormal accumulation other than in the brain. Which of the following is an appropriate treatment?", "choices_en": ["Administration of antibiotics", "Craniotomy for tumor resection", "Administration of Acyclovir", "Targeted radiation therapy", "High-dose methotrexate therapy"], "answer": ["e"]}
{"problem_id": "112A41", "problem_text_en": "A 55-year-old woman presented to the hospital with a chief complaint of dyspnea. She had noticed a lump in her left neck for one year, and two months ago, dyspnea gradually appeared. Because the dyspnea worsened, she visited a nearby clinic, where chest X-rays identified pleural effusion and lymphadenopathy in the left inguinal area. She was referred and admitted to the hospital, where she underwent thoracentesis after it was determined that the dyspnea was caused by pleural effusion. Her dyspnea temporarily improved, but one hour after the puncture, she exhibited severe dyspnea and foamy sputum, resulting in an SpO2 of 92% (with 2 L/minute of oxygen administered via a nasal cannula). Two hours after the puncture, her symptoms worsened, and her SpO2 reached 85% (with 8 L/minute of oxygen administered via a mask), and she underwent tracheal intubation. Chest X-rays taken upon arrival and one hour after thoracentesis (A) and chest CT (B) images are separately shown. What is the most effective respiratory management for this patient?", "choices_en": ["Independent lung ventilation", "Continuous positive pressure ventilation (CPPV)", "Noninvasive positive pressure ventilation (NPPV)", "12 L/min oxygen administration with a T-piece", "Oxygen administration at a rate of 10L/min using a reservoir mask."], "answer": ["b"]}
{"problem_id": "112A42", "problem_text_en": "A 27-year-old woman came to the hospital complaining of sudden palpitations and shortness of breath. About a month ago, she suddenly began to feel palpitations and cold sweats while taking the train to work. Gradually, her breathing became rough, and she was seized by a fear that she might suffocate and die. When she got off the train at an intermediate station, the symptoms improved in about 10 minutes. Since then, she has experienced similar symptoms once each on the train and at home. Investigations, including an electrocardiogram, revealed no abnormalities. She continues to be worried that \"symptoms will occur again no matter where she is.\" What are the sustained symptoms called?", "choices_en": ["Paranoia", "Self-generated thinking", "Claustrophobia", "Delusional mood", "Anticipatory anxiety"], "answer": ["e"]}
{"problem_id": "112A43", "problem_text_en": "A 38-year-old woman presents with primary infertility. She has been married for four years and hopes to have children but has not been able to get pregnant. She underwent a hysterosalpingogram six months ago, which was unremarkable. She has had dysmenorrhea for the past five years and has been taking over-the-counter pain medication during her menstrual cycle for the past year. Her menstrual cycle is irregular, ranging from 38 to 90 days in length and lasting for five days. She does not have menorrhagia. She is 164 cm tall and weighs 54 kg. Her temperature is 36.8°C, her pulse rate is 68 beats/min, regular, and her blood pressure is 110/56 mmHg. Her abdomen is flat and soft. On pelvic examination, the uterus is anteverted and retroflexed, normal-sized, but with poor mobility. A tender mass is palpable in the Douglas pouch. An ovarian cyst is palpable on the right side. Transvaginal ultrasonography shows a homogeneous echogenicity in the right ovarian cyst. No abnormalities are found in the left ovary. An image of the right ovary on transvaginal ultrasound is shown separately. Which of the following is the most appropriate treatment?", "choices_en": ["Progesterone therapy", "Clomiphene therapy", "GnRH agonist therapy", "Laparoscopic right oophorectomy", "Estrogen-progestin therapy"], "answer": ["b"]}
{"problem_id": "112A44", "problem_text_en": "A 54-year-old man complained of headache and decreased vision. Two years ago, he developed Raynaud's phenomenon during winter and presented with ulcers on his fingertips, leading to a diagnosis of systemic sclerosis by a dermatologist. However, due to his busy work schedule, he had not been able to visit the hospital for the past six months until he developed a sudden onset of headache and vision loss. His pulse is 92 bpm and regular, and his blood pressure is 218/120 mmHg. There is skin hardening on all limbs. Urinalysis shows 1+ protein and 1+ occult blood. Hematologic findings show 2.5 million red blood cells, 7.5 g/dL hemoglobin, 24% hematocrit, 3.0% reticulocytes, 8,200 white blood cells, and 50,000 platelets. Biochemical findings show 6.9 g/dL total protein, 2.0 mg/dL total bilirubin, 28 U/L AST, 35 U/L ALT, 610 U/L LD (normal range: 176-353), 52 mg/dL blood urea nitrogen, and 4.5 mg/dL creatinine. Optic disc edema is detected during fundus examination. Fragmented red blood cells are observed in a peripheral blood smear. What are the findings observed in this patient?", "choices_en": ["Serum complement deficiency", "Elevated serum ASO (antistreptolysin O) level", "Elevation of serum M protein", "Decreased plasma renin activity", "Serum haptoglobin reduction"], "answer": ["e"]}
{"problem_id": "112A45", "problem_text_en": "A 79-year-old man presented to the hospital after an abnormal shadow was detected on his chest X-ray. A chest and abdominal contrast-enhanced 3D CT scan was performed for further examination. What is the most important complication to be aware of during the surgery for the disease?", "choices_en": ["Meningitis", "Spinal cord infarction", "Normal pressure hydrocephalus", "Thoracic outlet syndrome", "Acute subdural hematoma"], "answer": ["b"]}
{"problem_id": "112A46", "problem_text_en": "A 60-year-old woman presents with joint pain. Two weeks ago, she had a fever in the high 38-degree Celsius range, which was treated with antipyretics prescribed by a medical facility near her home, leading to recovery within a few days. One week ago, she developed polyarthritis centered on her fingers and wrists, which persisted, leading to her seeking medical attention. Three weeks ago, she reports that her 5-year-old grandchild, with whom she lives, had a fever and facial erythema. Her vital signs are as follows: body temperature 36.5°C; pulse rate 76 beats per minute, regular; blood pressure 128/76 mmHg. There are no signs of abnormal heart or respiratory sounds. She experiences tenderness in both wrists. Urinalysis shows no protein or occult blood. Laboratory findings show: red blood cells 3.2 million/µL, hemoglobin 9.8 g/dL, hematocrit 31%, white blood cells 2,900/µL (segmented neutrophils 10%, band neutrophils 57%, eosinophils 2%, basophils 1%, monocytes 3%, lymphocytes 27%), and platelets 120,000/µL. Blood biochemistry findings are: aspartate aminotransferase (AST) 68 U/L, alanine aminotransferase (ALT) 72 U/L, and gamma-glutamyl transferase (γ-GTP) 98 U/L (normal 8-50). Immunological findings are: C-reactive protein (CRP) 0.5 mg/dL, rheumatoid factor (RF) negative, anti-nuclear antibody (ANA) titer 40-fold (normal≤20), CH50 25 U/mL (normal 30-40), C3 45mg/dL (normal 52-112), and C4 12 mg/dL (normal 16-51). Which of the following is the most important additional information to collect to establish a diagnosis?", "choices_en": ["Employment history", "Presence or absence of hearing impairment", "Grandchild's clinical course", "Types of antipyretics", "Presence of genital ulcers"], "answer": ["c"]}
{"problem_id": "112A47", "problem_text_en": "A 25-year-old man was brought in by ambulance due to intense headache. He has been aware of short-lived palpitations 2-3 times a day for the past 3 years. Six months ago, he was pointed out to have high blood pressure during a check-up, and since then the palpitations have become frequent, accompanied by headache, precordial pain, and pallor in the fingers. He requested an ambulance this morning due to severe headache. He has no notable medical history. He has no smoking history and drinks occasionally. His family history includes a history of medullary thyroid cancer in his mother. His height is 174 cm, weight is 52 kg, body temperature is 37.5℃. His heart rate is 120/min, regular. His blood pressure is 240/124 mmHg. Cold limbs are observed. No neck stiffness or jolt accentuation is observed. Abdominal ultrasonography revealed a 12 cm tumor shadow in the left abdomen. No abnormalities were observed in echocardiography and head CT. Calcium antagonist intravenous infusion was administered, suspecting hypertensive emergency. However, severe hypertension with systolic blood pressure over 200 mmHg and tachycardia persisted along with the headache. What is the appropriate response at this time?", "choices_en": ["Observation (to monitor the patient's condition without any active intervention)", "Alpha blocker administration", "Administration of beta blockers", "Administration of angiotensin II receptor antagonists", "Administration of non-steroidal anti-inflammatory drugs (NSAIDs)"], "answer": ["b"]}
{"problem_id": "112A48", "problem_text_en": "A 70-year-old male visited the hospital because his health exam showed abnormal test results. He had a history of cerebral infarction one year ago. No abnormalities were detected in heart sounds and breath sounds. There was no palpable liver or spleen. Blood test results showed RBC count of 4.68 million/µL, Hb of 13.9 g/dL, Hct of 42%, and WBC count of 12,300/µL (neutrophils 75%, eosinophils 1%, basophils 1%, monocytes 6%, lymphocytes 17%). Platelet count was 2.53 million/µL. Chromosome analysis showed a normal karyotype. Peripheral blood smear with May-Giemsa staining (A) and bone marrow biopsy with H-E staining (B) are shown separately. What is the most likely diagnosis?", "choices_en": ["Myelofibrosis", "Chronic myeloid leukemia", "Myelodysplastic syndrome", "Polycythemia vera", "Essential thrombocythemia"], "answer": ["e"]}
{"problem_id": "112A49", "problem_text_en": "A 45-year-old man presents with difficulty walking as his chief complaint. Two weeks ago, he experienced pain in the back of his right foot upon waking up, and after that, he had difficulty with dorsiflexion of the right ankle. Five days ago, he started experiencing tingling and pain in his left index and middle fingers, and yesterday, the dorsiflexion of the left ankle also became difficult, leading him to seek medical attention and admission to the hospital. The patient is conscious and alert. He is 180 cm tall and weighs 72 kg. His body temperature is 37.8°C. His pulse rate is 92 beats per minute and regular; his blood pressure is 150/72 mmHg, and his respiratory rate is 14 breaths per minute. His abdomen is flat and soft, with no palpable liver or spleen. No abnormalities are present in his cranial nerves. His proximal muscles are normal, but there is a decrease in muscle strength in both distal muscles, with a difference between the left and right sides. Tendon reflexes in all limbs are generally decreased, and the Babinski sign is negative. There is a decreased sense of pain in the left median nerve area and right superficial peroneal nerve area. No abnormality was observed in the cerebellar system, and no meningeal irritation was present. Urinalysis showed protein 1+, occult blood 1+, and 10-20 red blood cells per high-power field in the sediment. Blood analysis showed 3.52 million red blood cells, hemoglobin 11.8 g/dL, hematocrit 32%, 12,500 white blood cells (10% neutrophils, 63% band cells, 1% eosinophils, 1% basophils, 2% monocytes, and 23% lymphocytes), and 180 thousand platelets. Biochemical analysis showed total protein 6.6 g/dL, albumin 4.2 g/dL, blood urea nitrogen 28 mg/dL, creatinine 1.7 mg/dL, glucose 96 mg/dL, HbA1c 5.2% (reference range 4.6-6.2), sodium 136 mEq/L, potassium 4.2 mEq/L, and chloride 99 mEq/L. Immunological examination showed a CRP of 6.2 mg/dL, negative anti-nuclear antibodies, MPO-ANCA of 62 U/mL (reference value: <3.5), and PR3-ANCA of less than 3.5 U/mL (reference value: <3.5). No abnormalities were observed on chest X-ray. On the night of the day after admission, the patient had bloody stool, and a colonoscopy was performed, revealing an ulcer in the ascending colon, and a biopsy was taken. The H-E stain sample from the biopsy is shown separately. What is the most likely condition?", "choices_en": ["Multiple sclerosis", "Sarcoidosis", "Microscopic polyangiitis", "Guillain-Barré syndrome", "Systemic Lupus Erythematosus (SLE)"], "answer": ["c"]}
{"problem_id": "112A50", "problem_text_en": "A 55-year-old woman is referred to a hospital with a complaint of jaundice. She was diagnosed with ulcerative colitis on colonoscopy one year ago when she presented with blood in the stool and abdominal pain. Initially, she was treated with corticosteroids, but due to their inadequate effect, treatment with an anti-TNF-α antibody was initiated six months ago. At the previous hospital visit one month ago, she had no blood in the stool, no abdominal pain, normal liver function tests, and no jaundice. However, jaundice appeared one week ago. She drinks alcohol only occasionally. No new medications were begun in the past 6 months, except for the anti-TNF-α antibody. Her mother and brother are carriers of hepatitis B virus. She is alert and oriented, with a height of 152 cm, weight of 45 kg, temperature of 36.3°C, pulse of 64/min, regular. Blood pressure is 116/60 mmHg, and there is no anemia in the conjunctiva of the eyelid. The conjunctiva of the eyeball exhibits slight yellowing. The abdomen is flat and soft, and the liver and spleen cannot be palpated. There is no tenderness, and there is no edema in the legs. Laboratory findings show red blood cell count of 3.25 million/μL, hemoglobin of 11.6 g/dL, hematocrit of 31%, and white blood cell count of 4,300/μL, and platelet count of 170,000/μL, PT-INR is 1.2 (normal range: 0.9 to 1.1). Serum total protein is 6.3 g/dL and albumin is 3.8 g/dL. Bilirubin levels are total 4.7 mg/dL, direct 3.5 mg/dL. AST is 1,236 U/L, ALT is 1,202 U/L, ALP is 352 U/L (normal range: 115 to 359), and γ-GTP is 75 U/L (normal range: 8 to 50). She was negative for HBs antigen and HCV antibody at the time of colonoscopy one year ago. What is the most important blood test to confirm the diagnosis?", "choices_en": ["IgM type hemagglutination antibody", "HBs antigen", "HCV antibody", "IgA type HEV antibody", "Antinuclear antibody"], "answer": ["b"]}
{"problem_id": "112A51", "problem_text_en": "A 16-year-old boy was brought in by ambulance due to difficulty breathing. He ate bread for lunch today and during a long-distance run in his physical education class, he developed itching all over his body, hives, and difficulty breathing, so the school nurse requested an ambulance. He plays soccer in his school club activities, but has never experienced similar symptoms during practice or in games. Also, he has frequently eaten bread for lunch in the past, but has never had similar symptoms. He is alert and oriented. Heart rate is 102/min and regular. Blood pressure is 92/62 mmHg. Respiratory rate is 24/min. SpO2 is 99% on a mask with supplemental oxygen at 5 L/min. There is swelling seen in the anterior chest, and wheezing is heard on auscultation. After appropriate treatment, his symptoms improved. What is the appropriate lifestyle guidance for this patient in the future?", "choices_en": ["Prohibition of soccer", "Prohibition of long-distance running", "Prohibition of bread intake", "Prohibition of extracurricular activities involving overnight stays", "Prohibition of exercise for 2 hours after consuming wheat products"], "answer": ["e"]}
{"problem_id": "112A52", "problem_text_en": "A 41-year-old man presented to the hospital after being splashed in the face with a chemical containing quicklime during his work. His corrected visual acuity was normal in both eyes. He received continuous irrigation with saline for 10 minutes and the pH of his tears was measured as 9 using pH testing paper. A separate anterior segment photograph is displayed. What is the next appropriate action to take?", "choices_en": ["Antibiotic eye drops", "Adrenal cortex steroid eye drops", "Diluted povidone-iodine eye drops", "Continue eye irrigation with saline solution.", "Switch to eyewash with boric acid solution"], "answer": ["d"]}
{"problem_id": "112A53", "problem_text_en": "A 23-year-old primiparous woman was admitted to the hospital at 38 weeks and 2 days of gestation due to the onset of labor pains. The pregnancy had been progressing smoothly until then. She had noticed 10-minute intervals of regular abdominal pain at 12:00 pm and came to the hospital. At the time of admission, a pelvic examination was performed, revealing a cervical dilation of 3 cm, an SP±0cm level of the fetal head, and the presence of the amniotic membrane. After observation, her water broke at 3:00 pm and another pelvic examination showed a cervical dilation of 5 cm, an SP+2 cm level of the fetal head, and the touch of the Koizumi gate in the 2 o'clock direction. The fetal heart rate and contraction pattern at this point are shown separately. Which of the following is an appropriate response at this point in time?", "choices_en": ["Caesarean section", "Vacuum-assisted delivery", "Administration of β2 agonist", "Administration of oxytocin", "Continued monitoring of fetal heart rate and contractions using a tocodynamometer"], "answer": ["e"]}
{"problem_id": "112A54", "problem_text_en": "A 32-year-old man presents to the hospital with a chief complaint of a mass in his left thigh. He noticed a 6 cm mass in his left thigh 3 months ago and waited until it grew to 10 cm in diameter before seeking medical attention. He has no previous history of any medical conditions. He is alert and oriented with a body temperature of 36.3°C. His height is 172 cm and weight is 78 kg. His pulse is regular at 72 beats per minute, and his blood pressure is 126/78 mmHg. There are no abnormalities in his chest or abdomen. On his left thigh, there is a firm and non-tender mass palpable on the proximal inner side, but without redness, swelling, or tenderness. The mobility between the skin and mass is good, but the mobility between the mass and deep tissues is poor. His blood test reveals no abnormalities in his biochemistry. Here are T1-weighted (A) and T2-weighted (B) MRI images of the mass in the proximal left thigh. What is the most likely diagnosis?", "choices_en": ["Abscess", "Sebaceous cyst", "Lipoma", "Malignant soft tissue tumor", "Ganglion (cyst)"], "answer": ["d"]}
{"problem_id": "112A55", "problem_text_en": "A 35-year-old man presented with upper abdominal pain which appeared after eating raw seafood such as horse mackerel and squid. He has been previously healthy. His consciousness is clear. He is 170 cm tall and weighs 66 kg. His body temperature is 36.1℃. His pulse is 64 beats/minute and regular, and his blood pressure is 118/78 mmHg. No abnormalities were noted in the palpebral conjunctiva and ocular conjunctiva. No abnormalities were found in the heart sounds and breath sounds. His abdomen is flat and tender in the epigastric region, but no rebound tenderness or muscle guarding is present. There are no abnormalities in bowel movements. An urgent upper gastrointestinal endoscopic image is shown separately. What is correct about this condition?", "choices_en": ["Common in the summer season.", "It often occurs in the intestines.", "Symptoms appear after 24 hours of consuming fish.", "Proton pump inhibitors are effective.", "Immediate-type allergic reaction is involved in the pathogenesis."], "answer": ["e"]}
{"problem_id": "112A56", "problem_text_en": "A 35-year-old man presents with low back pain. He has been aware of left scrotal swelling for about six months, but did not seek treatment until he developed low back pain a month ago. He has no notable medical history and his blood test results are within normal limits, except for an elevated LDH level of 1,672 U/L (reference range: 176–353), hCG level of 1,962 mIU/mL (reference range: ≤1.0), and AFP level of 915 ng/mL (reference range: ≤20). Images of the scrotum at the time of presentation (A), chest CT with lung conditions (B), and abdominal contrast-enhanced CT (C) are shown separately. What should be done first for this patient?", "choices_en": ["CT-guided lung biopsy", "CT-guided retroperitoneal lymph node biopsy.", "Left hydrocele excision surgery", "Left testicular biopsy", "Left high orchiectomy"], "answer": ["e"]}
{"problem_id": "112A57", "problem_text_en": "A 48-year-old man was transported by ambulance due to impaired consciousness. According to his family who accompanied him, he has been receiving oral therapy for type 2 diabetes from his regular physician for three years. He has no smoking history but drinks one or two cans of beer (500 mL) daily. Yesterday, he took his diabetes medication as usual and had three cans of beer and two cups of sake with dinner before going to bed. He didn't wake up in the morning, so his family went to check on him and found he had an abnormal response, and requested an ambulance. His consciousness level is JCS II-20. He is 170 cm tall, weighs 81 kg, has a body temperature of 35.7°C, a heart rate of 92 bpm, blood pressure of 156/98 mmHg, respiratory rate of 24 per minute, and SpO2 of 99% (room air). They also brought his medication notebook. What blood test item should be checked first, in addition to blood glucose?", "choices_en": ["Lactic acid", "Ketone bodies", "Insulin", "Alcohol", "Serum osmolality/serum osmotic pressure"], "answer": ["a"]}
{"problem_id": "112A58", "problem_text_en": "A 56-year-old man with a history of forgetfulness and irritability over the past four and two months, respectively, was brought to the clinic by his family members. He is conscious and alert with a height of 172 cm, weight of 56 kg, temperature of 36.2°C, and pulse rate of 68 beats/min. He scored 13 out of 30 on the Mini-Mental State Examination (MMSE) and made repeated requests to stop during the examination. He has Argyll Robertson pupils with bilateral 1 mm pupil diameter, absent light reflex, and preserved accommodation reflex, and no other abnormalities in cranial nerves. He has no muscle weakness, but hyperreflexia and positive Babinski sign in all limbs. No abnormalities are found in the sensory and cerebellar systems. Kerning's and Brudzinski's signs are negative. No abnormalities are found in the complete blood count or biochemistry. Cerebrospinal fluid examination reveals an initial pressure of 270 mmH2O (normal range 70-170), 58 cells/mm3 (mononuclear cells 100%), protein level of 210 mg/dL (normal range 15-45), and glucose level of 72 mg/dL (concomitant blood glucose 118 mg/dL). Which additional test should be performed on the cerebrospinal fluid?", "choices_en": ["Tau protein", "TPHA reaction", "Beta-D-glucan", "JC virus antibody", "Oligoclonal bands"], "answer": ["b"]}
{"problem_id": "112A59", "problem_text_en": "A 60-year-old man presents with palpitations. He had occasionally noticed irregularities in his heart rate but did not seek medical attention as the symptoms were not severe. Two days ago, he took a warm bath and felt palpitations that were different from before. They started suddenly and were irregular and rapid when he checked his pulse. He felt as though his heart was beating chaotically. He rested on a seat in the bathroom and after about 2 minutes, the symptoms improved. He did not experience dizziness, sweating, or darkness in front of his eyes. This was his first time experiencing such symptoms, and he did not have a repeat episode, but his family was concerned, so he sought medical attention. His medical history is unremarkable. His temperature is 36.6℃, heart rate is 68 beats per minute and regular, blood pressure is 142/88 mmHg, respiratory rate is 16 breaths per minute, and SpO2 is 98% on room air. There are no abnormal findings in his heart or lung sounds. What is the most likely cause of his palpitations during bathing?", "choices_en": ["Ventricular tachycardia", "Ventricular fibrillation", "Atrial premature contraction (APC)", "Paroxysmal atrial fibrillation", "Paroxysmal supraventricular tachycardia"], "answer": ["d"]}
{"problem_id": "112A60", "problem_text_en": "A 68-year-old male patient presented for investigation of increased white blood cell count. He has been susceptible to catching colds for the past four years. On palpation, a lymph node of 1.5 cm in diameter was felt in the right cervical area, and one of 2 cm was felt in the left elbow area. The spleen was palpated 4 cm below the left costal arch. Blood test results were as follows: Red blood cell count of 3.02 million, Hb 9.2 g/dL, Hct 30%, white blood cell count 30,500 (neutrophils 3%, band forms 3%, monocytes 6%, lymphocytes 88%), and platelet count 190,000. Blood biochemistry results showed IgG 320 mg/dL (normal range 960 to 1,960), IgA 34 mg/dL (normal range 110 to 410), and IgM 46 mg/dL (normal range 65 to 350). Peripheral white blood cells showed positive surface antigens for CD5, CD20, and CD23. No M protein was detected in serum protein electrophoresis. A peripheral blood smear stained with May-Giemsa showed bizarre lymphocytes. What is the most likely condition?", "choices_en": ["Macroglobulinemia", "Chronic lymphocytic leukemia", "Acute lymphocytic leukemia", "Adult T-cell leukemia", "Chronic myeloid leukemia"], "answer": ["b"]}
{"problem_id": "112A61", "problem_text_en": "An 83-year-old man has been regularly visiting the clinic for hypertension management. He was diagnosed with hypertension 10 years ago and is taking calcium channel blockers and angiotensin-converting enzyme (ACE) inhibitors. He has been assessed as requiring \"Support Level 2\" under the care insurance system and attends day services twice a week. His medication adherence is good, and he has no symptoms such as dizziness or lightheadedness. He is 162 cm tall and weighs 53 kg, with a pulse rate of 72 beats/min and is regular. Blood pressure measured in the examination room is 144/74 mmHg. No abnormal heart or breathing sounds are heard, and there is no edema in the lower limbs. Recent home blood pressure readings recorded by the patient are provided separately. What is an appropriate response for this patient? Select two.", "choices_en": ["Addition of diuretic medication", "Addition of beta blocker", "Continue the current medication regimen", "Reduction of calcium-channel blockers", "Increase in angiotensin-converting enzyme (ACE) inhibitor"], "answer": ["b", "e"]}
{"problem_id": "112A62", "problem_text_en": "A 52-year-old man presented to the hospital with lung tumors on both sides. He underwent surgery for sigmoid colon cancer at another hospital 2 years ago and was referred for examination after a chest CT performed 2 days ago revealed nodular shadows in the lung fields. He has a smoking history of 20 cigarettes per day for 23 years. He is conscious and alert. He has a height of 175 cm and a weight of 90 kg. His body temperature is 36.8℃. His pulse rate is 92/min and regular, his blood pressure is 132/82 mmHg, and his respiratory rate is 16/min. His SpO2 is 98% on room air. No abnormality is noted in heart sounds or breath sounds. Laboratory data reveals: red blood cell count 4.56 million, Hb 14.3 g/dL, Hct 44%, white blood cell count 6,500, and platelet count 180,000. Blood chemistry data reveals: total protein 7.0 g/dL, albumin 4.3 g/dL, total bilirubin 0.3 mg/dL, AST 19 U/L, ALT 40 U/L, LD 124 U/L (normal range 176-353), creatinine 0.7 mg/dL, Na 144 mEq/L, K 4.2 mEq/L, Cl 110 mEq/L, CEA 6.5 ng/mL (normal range ≤ 5.0). The CRP level is 0.1 mg/dL. Respiratory function test shows: VC 4.57 L, percent VC 120%, FEV1 3.81 L, and FEV1 percent 84%. Electrocardiogram reveals no abnormality. A separate chest CT scan showing the lung field condition is shown. No recurrence is observed in the sigmoid colon, and no abnormalities are noted in the whole body examination other than the lesion confirmed on chest CT. What is the most appropriate treatment?", "choices_en": ["Radiation chemotherapy", "Chemotherapy for cancer treatment", "Radiation therapy", "Surgical therapy/treatment", "Immune therapy"], "answer": ["d"]}
{"problem_id": "112A63", "problem_text_en": "A 57-year-old man is hospitalized for anorexia and liver dysfunction. He had been drinking 3 cups of Japanese sake every day since his twenties, but it did not interfere with his work. Three years ago, he began drinking more than 5 cups a day. He began feeling general malaise a week ago, reducing his work hours. Despite that, he continued drinking, but he became unable to eat due to severe anorexia three days ago, so he visited the hospital and was admitted. He has had insomnia since admission and has been restless, walking around, and becoming disturbed at night, claiming \"animals are crawling on the walls\". At that time, he had coarse tremors in his fingers and significant sweating, and he showed a state of not knowing that he was hospitalized. A head CT scan at admission showed no abnormalities. Which of the following is/are appropriate drugs to administer immediately? Select two.", "choices_en": ["Anti-alcohol medication", "Diazepam", "Vitamin B complex", "Imipramine", "Levodopa (L-dopa)"], "answer": ["b", "c"]}
{"problem_id": "112A64", "problem_text_en": "A 55-year-old man complains of chest pain. He had left lower toothache for a week, which gradually worsened. Three days ago, the pain spread to his neck, and two days ago, he developed chest pain and came to the hospital. He is alert and oriented. His temperature is 37.5°C, pulse rate is 96 beats per minute regular, blood pressure is 98/62 mmHg, and respiratory rate is 24 breaths per minute. Breath sounds are decreased over the right lung base. Laboratory data shows red blood cell count 4.82 million/μL, white blood cell count 14,500/μL (32% segmented neutrophils, 54% banded neutrophils, 5% monocytes, and 9% lymphocytes), and platelet count 110,000/μL. Blood chemistry shows aspartate aminotransferase 61 U/L, alanine aminotransferase 69 U/L, blood urea nitrogen 27 mg/dL, and creatinine 1.2 mg/dL. C-reactive protein is 36 mg/dL. CT of the neck (A), chest (B), and sagittal reconstruction (C) are provided separately. Which of the following treatments is appropriate? Select two.\n\n(Note: No CT images were provided in the text.)", "choices_en": ["Antibiotic administration", "Drainage", "Radiation therapy", "Chemotherapy for cancer", "Adrenal cortex steroid administration"], "answer": ["a", "b"]}
{"problem_id": "112A65", "problem_text_en": "A 68-year-old woman, with a history of four deliveries, complains of a feeling of lump in the external genitalia and difficulty in walking. She has been able to feel a hard mass about 3 cm in diameter at the vaginal entrance since 5 years ago and has been returning it with her finger. About a year ago, it became difficult to return the mass and started to interfere with walking. She is 150 cm tall and weighs 58 kg. Her body temperature is 36.5℃. Her pulse rate is 72 beats/min and regular. Her blood pressure is 134/88 mmHg. Her respiratory rate is 18 breaths/min. Her abdomen is slightly distended, soft, and does not palpate masses. Abdominal ultrasonography reveals no abnormalities in the uterine corpus, but the cervix is elongated to 6 cm. The uterine vaginal part descends and reaches outside the vagina upon straining. There are no abnormalities in her blood chemical examination. Which of the following is the appropriate response? Select two.", "choices_en": ["Surgery", "Radiation exposure/treatment", "Insertion of a pessary", "Administration of anticholinergic drugs", "Guidance on self-reduction method"], "answer": ["a", "c"]}
{"problem_id": "112A66", "problem_text_en": "A 70-year-old man presents with complaints of dyspnea on exertion. He has noticed gradually worsening shortness of breath on exertion for the past 3 years, leading him to seek medical attention. He has no symptoms at night during sleep. He underwent surgical repair for an atrial septal defect at the age of 43, and has no history of asthma. He has a 47-year history of smoking 20 cigarettes per day, but quit smoking 3 years ago. His temperature is 36.4°C. His pulse rate is 72 beats per minute and regular. His blood pressure is 134/70 mmHg. His respiratory rate is 20 breaths per minute. His SpO2 is 97% on room air. His 6-minute walk test showed a minimum SpO2 of 91%. Breath sounds are diminished on chest auscultation, and mild rhonchi are detected. A transthoracic echocardiogram shows preserved left ventricular ejection fraction and no evidence of pulmonary hypertension. Pulmonary function testing reveals a VC of 3.40L, %VC of 92%, FEV1 of 1.30L, and FEV1% of 38%. A chest radiograph (A) and a chest CT scan (B) are shown separately. Which of the following is appropriate initial therapy? Select two.", "choices_en": ["Administration of antibiotics", "Home oxygen therapy", "Administration of adrenal cortex steroid inhalant", "Administration of long-acting inhaled β2 agonist", "Administration of long-acting inhaled anticholinergic medication"], "answer": ["d", "e"]}
{"problem_id": "112A67", "problem_text_en": "A 56-year-old man was brought in by ambulance for chest and back pain. He suddenly complained of chest and back pain during office work today and lost consciousness, which lasted for a few seconds. As the pain persisted, his colleague called for an ambulance. He regained consciousness and his mental status is clear. His height is 163 cm, weight 56 kg, body temperature 36.2°C, heart rate 92 beats/min, regular, blood pressure (right upper limb) 194/104 mmHg, (left upper limb) 198/110 mmHg, respiratory rate 24/min, and SpO2 is 100% (with a mask and oxygen of 10 L/min). Heart and lung sounds are normal. Neurological examination shows no abnormalities. Blood test results show white blood cells 21,000/μL. Biochemical test results show AST 15 U/L, ALT 15 U/L, LD 261 U/L (normal range 176-353), blood urea nitrogen 18mg/dL, creatinine 0.6mg/dL, uric acid 6.4mg/dL, blood glucose 115mg/dL, Na 142mEq/L, K 3.8mEq/L, Cl 107mEq/L, and negative troponin T in the heart. No abnormalities were found on electrocardiogram. A chest computed tomography is shown separately. Which of the following treatments are appropriate? Select two.", "choices_en": ["Hematoma removal surgery", "Pericardial drainage", "Artificial blood vessel replacement surgery", "Intra-aortic balloon pumping (IABP)", "Hypotension by continuous intravenous infusion of calcium antagonist"], "answer": ["c", "e"]}
{"problem_id": "112A68", "problem_text_en": "A 35-year-old woman visited the hospital after being pointed out with abnormal liver function during a workplace health checkup. She has no symptoms. She received a similar remark last year but left it as it was. She drinks alcohol occasionally. She doesn't take any regular medication or natural supplements. She is 163 cm tall and weighs 56 kg. Her body temperature is 36.3°C. Her pulse rate is 56/min and regular. Her blood pressure is 116/62 mmHg. No abnormalities are observed in her conjunctiva or sclera. Her abdomen is flat, soft, and no liver or spleen enlargement is palpated. No tenderness is observed. No edema is observed in her lower extremities. Blood test showed: red blood cells 3.25 million, hemoglobin 12.0 g/dL, hematocrit 32%, white blood cells 5,300, platelets 270,000, PT-INR 1.0 (normal 0.9–1.1). Biochemical blood test showed: total protein 7.0 g/dL, albumin 4.3 g/dL, total bilirubin 0.7 mg/dL, AST 36 U/L, ALT 42 U/L, ALP 852 U/L (normal 115–359), γ-GTP 542 U/L (normal 8–50), fasting blood glucose 85 mg/dL, HbA1c 5.4% (normal 4.6–6.2), total cholesterol 254 mg/dL, and triglycerides 95 mg/dL. She is negative for HBs antigen and anti-HCV antibody. What is the most likely diagnosis? Select two.", "choices_en": ["Acute cholangitis", "Autoimmune hepatitis", "Primary sclerosing cholangitis", "Primary biliary cholangitis", "Non-alcoholic fatty liver disease (NAFLD)"], "answer": ["c", "d"]}
{"problem_id": "112A69", "problem_text_en": "A 4-year-old girl is brought to the clinic by her father with the complaint of rash on her palms. Her overall condition is good. There are other children at her daycare who have similar rashes. A photo of her hands at the time of the visit is shown separately. What are the two areas that need to be observed for a definitive diagnosis?\n\nNote: A photo is not shown here, but the areas to be observed would be mentioned in the context.", "choices_en": ["Pharynx", "Plantar", "Vulva", "Frontal region", "Anterior thorax"], "answer": ["a", "b"]}
{"problem_id": "112A70", "problem_text_en": "A 54-year-old woman came to the emergency room 7 hours after experiencing epigastric pain. She is conscious, with a body temperature of 38.5℃. Her pulse is 80/min and regular, blood pressure is 154/94 mmHg. Her abdomen is flat with tenderness in the right hypochondriac region. Her blood test results are as follows: RBC 4.33 million, Hb 14.0 g/dL, Hct 42%, WBC 12,400, and platelets 170,000. Her blood biochemistry results are: albumin 4.5 g/dL, AST 24 U/L, ALT 18 U/L, LD 161 U/L (reference range: 176-353), ALP 350 U/L (reference range: 115-359), γ-GTP 94 U/L (reference range: 8-50), urea nitrogen 21 mg/dL, creatinine 0.7 mg/dL, CRP 13 mg/dL. CT imaging of the abdomen is shown separately. Which of the following treatments are appropriate for this patient? Select two.", "choices_en": ["Colectomy", "Cholecystectomy", "Ileus tube placement", "Percutaneous transhepatic gallbladder drainage", "Endoscopic sphincterotomy"], "answer": ["b", "d"]}
{"problem_id": "112A71", "problem_text_en": "A 64-year-old woman came to the hospital after abnormalities were pointed out in a mammogram during breast cancer screening. A tumor of about 2 cm in long diameter was palpated in the left breast. The tumor had indistinct borders, was hard and had no tenderness. No secretion was observed from the nipple. Another mammogram was ordered. Which of the following tests should be performed next? Select two.", "choices_en": ["Angiography", "Ductal contrast imaging (mammography)", "Percutaneous needle biopsy", "Breast ultrasound examination", "Bone scintigraphy"], "answer": ["c", "d"]}
{"problem_id": "112A72", "problem_text_en": "An 82-year-old woman presents with muscle pain. Two weeks ago, she suddenly experienced muscle pain and stiffness in her neck, shoulders, lower back, buttocks, and thighs. She found it difficult to get up and her symptoms persisted, leading her to seek medical attention. She is alert and conscious. Her temperature is 37.8°C. Pulse rate is 84 beats per minute and regular. Blood pressure is 148/86 mmHg. Urinalysis: negative for protein and occult blood. Erythrocyte sedimentation rate is 110 mm/hour. Blood test results show: 3.12 million red blood cells, hemoglobin level of 9.8 g/dL, hematocrit of 30%, white blood cell count of 10,200, and platelet count of 430,000. Blood biochemistry shows: total protein of 5.9 g/dL, AST of 29 U/L, ALT of 28 U/L, LD of 321 U/L (reference range: 176-353 U/L), CK of 38 U/L (reference range: 30-140 U/L), blood urea nitrogen of 18 mg/dL, and creatinine level of 0.7 mg/dL. Immunology test results show: CRP of 15 mg/dL, negative for rheumatoid factor (RF) and anti-nuclear antibody. Which of the following symptoms suggest a complication that should be taken into account for this patient? Select two.", "choices_en": ["Double vision", "Night sweats", "Headache", "Lentigines", "Raynaud's phenomenon"], "answer": ["a", "c"]}
{"problem_id": "112A73", "problem_text_en": "A 53-year-old man presents with a 3-month history of persistent epigastric pain. He has a history of heavy alcohol consumption since the age of 25. Tenderness is detected on his upper abdomen. Blood chemistry results show: total bilirubin 1.0 mg/dL, AST 84 U/L, ALT 53 U/L, ALP 258 U/L (reference range 115-359), γ-GTP 110 U/L (reference range 8-50), amylase 215 U/L (reference range 37-160), fasting blood glucose 278 mg/dL, HbA1c 9.6% (reference range 4.6-6.2), and CA19-9 32 U/mL (reference range 37 or less). The images show abdominal CT (A) and MRCP (B). Which of the following instructions to the patient would be appropriate? Select two.", "choices_en": ["Abstinence from alcohol", "Fluid restriction", "Low-fat diet", "Low protein diet.", "High-energy diet"], "answer": ["a", "c"]}
{"problem_id": "112A74", "problem_text_en": "A 32-year-old woman with a complaint of dry cough visited the hospital. She has been aware of dry cough from February to May every year since five years ago, and visited this year as she experienced similar symptoms from February. She has a history of allergic rhinitis and no smoking history. Her body temperature is 36.8°C, pulse rate is 72/min and regular, blood pressure is 120/60 mmHg, respiratory rate is 16/min, and SpO2 is 99% (room air). No abnormalities are detected in lung sounds and chest X-rays. Which of the following tests should be performed next? Select two.", "choices_en": ["Chest CT (Computed Tomography)", "Bronchoscopy examination", "Arterial blood gas analysis", "Spirometry", "Calculation of eosinophil ratio in sputum"], "answer": ["d", "e"]}
{"problem_id": "112A75", "problem_text_en": "A 24-year-old woman presents with fever and swelling of the left lower leg. She developed a facial rash after going swimming and skiing one year ago, and has had persistent fever and facial rash for one month, and swelling of the left lower leg for one week. Her temperature is 37.5°C. Her pulse rate is 80 beats per minute and regular, her blood pressure is 124/76 mmHg, her respiratory rate is 12 per minute, and her oxygen saturation is 98% on room air. There is a rash on her cheeks and around her fingernails. There are no abnormal heart or lung sounds. She has tenderness in both wrist and elbow joints. There is swelling and tenderness in the left lower leg. Urinalysis shows proteinuria (±), 1+ occult blood, 5-10 red blood cells and 1-4 white blood cells per high-power field, and no cellular casts. Blood tests show hemoglobin 10.5 g/dL, leukocyte count 3,200/μL (20% segmented neutrophils, 45% band neutrophils, 2% eosinophils, 1% basophils, 3% monocytes, and 29% lymphocytes), platelet count 120,000/μL, and a D-dimer level of 6.5 μg/mL (normal < 1.0). What are the two tests that should be performed next?", "choices_en": ["Renal biopsy", "Muscle biopsy of the lower extremities", "Anti-Jo-1 antibody measurement", "Lower extremity venous ultrasound examination.", "Measurement of anticardiolipin antibodies"], "answer": ["d", "e"]}
