{"problem_id": "113D1", "problem_text_en": "What are the characteristics of simple febrile seizures?", "choices_en": ["Exhibit unilateral convulsions.", "The convulsion lasts for more than 20 minutes.", "It often develops between the ages of 1 and 3.", "Repeated seizures within 24 hours.", "Consciousness disorder lasting more than 24 hours after convulsions."], "answer": ["c"]}
{"problem_id": "113D2", "problem_text_en": "Which of the following statements about electroconvulsive therapy (ECT) is correct?", "choices_en": ["Those who are 65 years old and older are not eligible/applicable.", "Severe depression is an indication for treatment.", "Muscle rigidity is observed as a side effect.", "Presence of a neurosurgeon is a requirement.", "Can be performed without the patient's or their guardian's consent."], "answer": ["b"]}
{"problem_id": "113D3", "problem_text_en": "Which of the following is characterized by proliferation of melanocytes in the dermis?", "choices_en": ["Ota nevus", "Epidermal nevus", "Flat wart", "Urticaria pigmentosa", "Café au lait spot (a type of birthmark)"], "answer": ["a"]}
{"problem_id": "113D4", "problem_text_en": "Provide a separate visual acuity chart. What is the crucial component needed to determine the axis of astigmatism during a vision test?", "choices_en": ["① - This is a number in Japanese (pronounced \"ichiban\"), it means \"one\" or \"first\".", "This is not a translation but rather a numeral indicating the second option in a multiple-choice question.", "Sorry, I cannot translate this choice without any context. Please provide more information.", "It is not possible to translate \"④\" as it is a numerical indicator used in a multiple-choice question to represent one of the answer choices.", "Sorry, I cannot translate the option ⑤ alone as it does not have any context. Please provide me with more information about the question or the options."], "answer": ["e"]}
{"problem_id": "113D5", "problem_text_en": "Separately shown is a photograph of the eardrum of a patient who came to the hospital for surgery for chronic suppurative otitis media. Which of the following is not visible?", "choices_en": ["Malleus (hammer-shaped bone in the ear)", "Sacrum bone", "Tympanic membrane perforation", "Eustachian tube orifice", "Calcification of the tympanic membrane"], "answer": ["d"]}
{"problem_id": "113D6", "problem_text_en": "Which medication is most likely to worsen asthma in adults?", "choices_en": ["Diuretic", "Beta blocker medication", "Histamine H$_1$ receptor antagonist.", "Basic nonsteroidal anti-inflammatory drugs (NSAIDs)", "Angiotensin II receptor antagonists"], "answer": ["b"]}
{"problem_id": "113D7", "problem_text_en": "Which of the following is not related to the onset of chronic overload on the musculoskeletal system?", "choices_en": ["Lumbar spondylolisthesis", "Occupational low back pain", "Dissecting osteochondritis", "Avascular necrosis of the femoral head", "Osgood-Schlatter disease"], "answer": ["d"]}
{"problem_id": "113D8", "problem_text_en": "Which of the following is not a characteristic feature of hypertension in the elderly?", "choices_en": ["Postprandial hypotension", "Orthostatic hypotension", "Systolic hypertension", "Blood pressure lability increase", "Impaired blood flow reserve in major organs"], "answer": ["c"]}
{"problem_id": "113D9", "problem_text_en": "Which of the following is not a sign or symptom that may appear as a complication of acute aortic dissection?", "choices_en": ["Visual field impairment", "Positive Barré sign.", "Poor palpation of the posterior tibial artery", "Weakening of the first and second heart sounds", "Holosystolic murmur with maximal intensity at the cardiac apex"], "answer": ["e"]}
{"problem_id": "113D10", "problem_text_en": "Which of the following is not an indication for adult liver transplantation?", "choices_en": ["Wilson's disease", "Multiple hepatic cysts", "Primary sclerosing cholangitis", "Hepatic cirrhosis due to hepatitis C virus", "Irreversible alcohol-related liver cirrhosis"], "answer": ["e"]}
{"problem_id": "113D11", "problem_text_en": "What findings suggest the suspicion of optic neuritis with respect to differential diagnosis from multiple sclerosis?", "choices_en": ["Decreased visual acuity", "Positive serum antinuclear antibody", "Increased number of cells in cerebrospinal fluid", "Reduced peripheral nerve conduction velocity", "Periventricular brain lesions on head MRI"], "answer": ["c"]}
{"problem_id": "113D12", "problem_text_en": "Which of the following conditions is a cause of jaundice in newborns that requires phototherapy?", "choices_en": ["Neonatal hepatitis", "Biliary atresia", "Congenital biliary dilatation (CBD) or Choledochal cyst", "ABO blood type incompatibility", "Dubin-Johnson syndrome"], "answer": ["d"]}
{"problem_id": "113D13", "problem_text_en": "What comorbidities are contraindicated for laparoscopic cholecystectomy for gallbladder stones?", "choices_en": ["Gastric cancer", "Gallbladder cancer", "Gallstone", "Acute cholecystitis", "Gallbladder adenomyomatosis"], "answer": ["b"]}
{"problem_id": "113D14", "problem_text_en": "Which of the following diseases present with microcytic hypochromic anemia? Select two.", "choices_en": ["Thalassemia", "Hemolytic anemia", "Iron deficiency anemia", "Folate-deficiency anemia", "Myelodysplastic syndrome"], "answer": ["a", "c"]}
{"problem_id": "113D15", "problem_text_en": "A patient with lung cancer in the right lung apex has ptosis only on the right side. What are the other signs that are most likely to be seen? Select two.", "choices_en": ["Hoarseness", "Right miosis (pupillary constriction)", "Facial edema / Facial swelling", "Protrusion of the right eyeball", "Decrease in sweating on the right side of the face"], "answer": ["b", "e"]}
{"problem_id": "113D16", "problem_text_en": "A 20-year-old man is a student at a university where there is an influenza outbreak. He experienced chills, fever, and joint pain since around 7:30 am today. He had breakfast but reports no nausea or diarrhea. He was unsure if he should go to university, but decided to come to the hospital when it opened at 9 am. He is alert and conscious, with a body temperature of 40.1℃, pulse rate of 120 beats per minute and regular, blood pressure of 124/62 mmHg, respiratory rate of 16 breaths per minute, and oxygen saturation of 98% on room air. There are no abnormalities in heart and lung sounds or skin. Which of the following is an appropriate explanation?", "choices_en": ["\"Let's start an IV drip.\"", "\"Let's hospitalize and treat (the patient).\"", "\"Please rest at home\"", "\"Let's take a chest X-ray photo.\"", "\"Let's take penicillin antibiotics orally.\""], "answer": ["c"]}
{"problem_id": "113D17", "problem_text_en": "A 14-year-old girl is brought to the hospital by her grandmother with fever as the chief complaint. She has had a fever for the past four days, and two days ago, she noticed swelling in both eyelids and lumps in both sides of her neck. She came to the hospital today because her fever did not improve. She has a body temperature of 38.9℃, a pulse rate of 92/min and regular, a respiratory rate of 20/min, and a SpO2 of 98% (room air). No rash is observed on her limbs or trunk. Swelling is observed in both eyelids, but no anemia is observed in the eyelid conjunctiva, and no jaundice or congestion is observed in the eyeball conjunctiva. The palatine tonsils are red and covered with white plaque. Several lymph nodes with a diameter of 2 cm are palpable on both sides of her neck. No abnormalities are observed in the heart sounds and breathing sounds. The abdomen is flat, soft, and the liver is palpable 2 cm below the right costal arch, and the spleen is palpable 3 cm below the left costal arch. What is the useful blood test item for diagnosis?", "choices_en": ["Creatine kinase", "Albumin", "Amylase", "Creatinine", "Peripheral blood leukocyte fractionation"], "answer": ["e"]}
{"problem_id": "113D18", "problem_text_en": "A 73-year-old woman was discovered by her family in a state of consciousness disturbance after being stung on the face by a bee. She was transported by ambulance to the hospital. Her past medical history includes one prior bee sting. On arrival, her Japan Coma Scale was II-10. Her body temperature was 36.2°C. Her heart rate was 84 beats per minute and regular. Her blood pressure was 80/50 mmHg. Her respiratory rate was 20 breaths per minute. Her SpO2 was 99% with a 4-liter oxygen mask. She had hives all over her body and wheezes were heard on both sides of her chest. What is the immediate treatment that should be administered?", "choices_en": ["Inhalation of β2 stimulants", "Intramuscular injection of adrenaline", "Intramuscular injection of atropine sulfate", "Intravenous administration of norepinephrine", "Intravenous administration of corticosteroids"], "answer": ["b"]}
{"problem_id": "113D19", "problem_text_en": "A 65-year-old man consulted a doctor after an abnormal shadow was pointed out in his right middle lung field on a chest X-ray. He had been diagnosed with interstitial pneumonia five years ago. He had been hospitalized a year ago due to an acute exacerbation and had been receiving oral corticosteroid therapy in the outpatient department. His symptoms had been stable for the past year, so he discontinued the medication on his own and did not seek medical attention. He had smoked 20 cigarettes a day for 40 years. He had quit smoking five years ago but resumed smoking six months ago. A lung tumor shadow was detected in the right upper lobe on a chest CT examination, and he was diagnosed with squamous cell carcinoma of the lung by transbronchial lung biopsy. A whole-body examination revealed metastasis to the right hilum lymph nodes, but no other metastasis was detected. His body temperature was 36.6 °C. His pulse rate was 76/min and regular. His blood pressure was 132/76 mmHg. His respiratory rate was 12/min. His SpO2 was 95% (room air). Fine crackles were heard bilaterally in his chest. Respiratory function tests showed VC of 3.5L and FEV1 of 2.2L. There were no abnormalities in his electrocardiogram or echocardiogram. His chest X-ray (A) and chest CT (B) are shown separately. The doctor explained to the patient that surgery was also an option, and the patient expressed a desire for surgery. Which of the following is not appropriate for this patient during the perioperative period?", "choices_en": ["Perform early postoperative ambulation.", "Provide preoperative smoking cessation counseling.", "Perform oxygen therapy from before the surgery.", "There is a risk of postoperative exacerbation of interstitial pneumonia.", "There is a risk of requiring home oxygen therapy after surgery."], "answer": ["c"]}
{"problem_id": "113D20", "problem_text_en": "A 68-year-old man presents with a chief complaint of nodules on his dorsum manus. He noticed a 3 mm rash on the dorsum of his right hand three weeks ago. He visited a clinic because the rash had rapidly increased in size over the past two weeks. A 12 mm brownish tumor with a central plug was observed on the dorsum of his right hand. There was no fluctuation, and he felt elastic hardness when he palpated the tumor. Biopsy of the tumor revealed that the center was concave, filled with keratin, and exhibited proliferative neoplastic cells of spinous cells. The tumor shrank to less than 25% of its peak size one month after the biopsy. Photos of the dorsum of the right hand (A) and a histological H-E staining sample of the biopsy specimen (B) are shown separately. What is the most likely diagnosis?", "choices_en": ["Sebaceous cyst", "Basal cell carcinoma.", "Spiny cell carcinoma", "Glomus tumor", "Keratoacanthoma"], "answer": ["e"]}
{"problem_id": "113D21", "problem_text_en": "A 45-year-old man came to the hospital for examination of a pancreatic tumor. He has been undergoing oral treatment for type 2 diabetes at a clinic near his home for 15 years. Three months ago, his blood glucose control deteriorated rapidly, so he underwent an abdominal ultrasound examination, which revealed a pancreatic tumor and led to referral to the hospital. His eGFR is 48 mL/min/1.73m2. Which medication should be considered for discontinuation for several days before and after planning an abdominal contrast-enhanced CT scan?", "choices_en": ["DPP-4 inhibitors", "SGLT2 inhibitors", "Biguanide drug", "Sulfonylurea drugs", "Alpha-glucosidase inhibitor"], "answer": ["c"]}
{"problem_id": "113D22", "problem_text_en": "A 78-year-old woman accompanied by her husband visited the hospital due to his worries about her repeated strange movements. She had started to have noticeable forgetfulness four years ago, gradually causing her to have difficulty with shopping and cooking. Two years ago she was diagnosed with Alzheimer's type dementia and was receiving prescription of donepezil. About two months ago, she suddenly stopped her previous movements during meals or conversations, then puckered her lips and chewed for about a minute. During this time, there was no response even when her family spoke to her, and she appeared to stare into space. Even with a detailed interview to confirm if there is consciousness during strange movements, clear answers could not be obtained due to dementia. She is alert and conscious, with a body temperature of 36.2℃. Pulse rate is 56/minute, regular, and blood pressure is 126/80 mmHg. No abnormal findings indicating local nerve signs are observed in the neurological examination. Head MRI shows hippocampal atrophy but there are no new lesions compared to one year ago. What is the most likely condition?", "choices_en": ["Dissociative disorder", "Malignant syndrome", "Cataplexy", "Complex partial seizure", "Drug-induced delirium"], "answer": ["d"]}
{"problem_id": "113D23", "problem_text_en": "A 32-year-old woman presents with abdominal pain and nausea. She undergoes an annual medical examination, but no abnormalities have been reported so far. She had a fever of around 37°C and sore throat for five days, but she assumed it was a mild cold and did not seek medical attention. She began experiencing upper abdominal pain and nausea from last night and came for examination this morning. She is alert and conscious. She is 158 cm tall and weighs 46 kg. Her pulse rate is 96/min, regular. Blood pressure is 102/58 mmHg. There is no tenderness in the abdomen. Urinalysis shows (-) protein, 3+ glucose, and 3+ ketones. Blood test shows 5.1 million red blood cells, Hb 15.0 g/dL, Hct 45%, 11,500 white blood cells, and 270,000 platelets. Blood chemistry shows creatinine level of 1.2 mg/dL, amylase 270 U/L (normal range 37-160), fasting blood glucose level of 328 mg/dL, HbA1c level of 6.2% (normal range 4.6-6.2), triglyceride level of 388 mg/dL, LDL-cholesterol level of 58 mg/dL, HDL-cholesterol level of 28 mg/dL, and total serum ketone level of 1,885 μmol/L (normal range up to 130). CRP is 2.0 mg/dL. Arterial blood gas analysis shows a pH of 6.99, PaCO2 of 22.1 Torr, PaO2 of 83.5 Torr, and HCO3- of 5.2 mEq/L. No abnormalities are found on abdominal CT. Normal saline infusion is initiated. What should be the next step?", "choices_en": ["To observe the progress with only intravenous fluids.", "Administer sulfonylurea drugs.", "Administer a fibrate-type drug.", "Subcutaneous injection of long-acting insulin.", "Administer sustained intravenous injection of rapid-acting insulin."], "answer": ["e"]}
{"problem_id": "113D24", "problem_text_en": "A 16-year-old boy suffered a contusion to his right eye while practicing sumo and sought medical help. After being hospitalized and treated, his visual acuity in the right eye improved from 0.4 (uncorrectable) to 0.3 (1.2 × -2.0D). The fundus photographs (wide-angle images) before and after treatment are shown separately. What treatment was performed?", "choices_en": ["Anti-VEGF drug intravitreal injection", "Laser photocoagulation therapy", "Photodynamic therapy", "Intracapsular cataract extraction (ICCE)", "Vitreous body surgery"], "answer": ["d"]}
{"problem_id": "113D25", "problem_text_en": "A 62-year-old woman presented with chief complaints of respiratory distress and was transported by ambulance. She had been suffering from a cold for several days and had complained of shortness of breath upon exertion since yesterday. Her consciousness was clear. Her body temperature was 38.5°C. Her heart rate was 120 beats per minute and regular. Her blood pressure was 86/46 mmHg. Her respiratory rate was 28 breaths per minute. Her oxygen saturation was 88% (with oxygen mask, 10 L/min oxygen administration through a reservoir). No heart murmur was heard, but the heart sounds were tachycardic. Coarse crackles were heard throughout the chest. Chest X-ray revealed infiltrative shadows predominantly in the lower right lung field. Following tracheal intubation, she was placed in the intensive care unit and mechanical ventilation was initiated. Blood tests revealed a red blood cell count of 3.45 million, hemoglobin of 11.4 g/dL, hematocrit of 34%, white blood cell count of 12,800, and platelets of 230,000. Biochemical tests showed total protein of 5.9 g/dL, albumin of 2.8 g/dL, total bilirubin of 0.9 mg/dL, AST of 283 U/L, ALT of 190 U/L, LD of 392 U/L (reference range: 176-353), urea nitrogen of 13 mg/dL, creatinine of 0.3 mg/dL, and CK of 439 U/L (reference range: 30-140). Brain natriuretic peptide (BNP) was 1,728 pg/mL (reference range: 18.4 or less) and CRP was 2.0 mg/dL. Electrocardiogram showed negative T waves in the precordial leads. Echocardiography revealed diffuse hypokinesis of the left ventricular wall and an ejection fraction of 30%. Pulmonary artery catheterization was performed to assess the hemodynamics. Which of the following values is believed to be measured in this patient?\n\n- Cardiac index\n- Mean right atrial pressure\n- Mean pulmonary artery pressure\n- Pulmonary artery wedge pressure\n\n(L/min/m2)\n(mmHg)\n(mmHg)\n(mmHg)\n\na. 6.0   10   15   10\nb. 4.0   10   15   10\nc. 4.0    5    10    5\nd. 2.0    5    10    5\ne. 2.0   15   25   20", "choices_en": ["Sorry, it is not possible to translate a single letter or character standing alone without any context or additional information, as it could have different meanings depending on the context in which it appears. If you have any further details or surrounding text, feel free to provide it and I'll be happy to help you translate.", "It is not possible to translate \"ｂ\" as it is not clear what the context or question stem is. Please provide more information or context.", "I'm sorry, the given option \"ｃ\" cannot be translated without further context. Please provide more information.", "I'm sorry, but I would need more context to accurately translate this choice in a multiple-choice question.", "This choice cannot be translated without further context. It appears to be an individual or a single letter. Please provide more information for accurate translation."], "answer": ["e"]}
{"problem_id": "113D26", "problem_text_en": "A 13-year-old girl complained of gradually worsening left forearm pain and left finger numbness. She fell from a 1.5 m high vaulting box two days ago, landed on her left hand, and was admitted to the hospital by ambulance. She was diagnosed with an open fracture of the left forearm bone and underwent urgent open reduction with internal fixation for the fracture. She was discharged the day after surgery, but her forearm pain worsened and finger numbness appeared late at night, so she visited the emergency department at 11 PM. There is no significant medical, social, or family history. External view photo (A) and X-ray photos (B, C) of the affected limb at the time of visiting the emergency department are separately shown. What is a potential consequence of delayed treatment for this patient after the following morning?", "choices_en": ["Glove-like sensation loss", "Volkmann's contracture", "Heterotopic ossification", "Pseudarthrosis", "Osteonecrosis"], "answer": ["b"]}
{"problem_id": "113D27", "problem_text_en": "A 30-year-old woman comes to the clinic with complaints of headache, breast milk leakage, and menstrual irregularity. She has been experiencing menstrual irregularity for the past six months. Recently, she has noticed the secretion of milky-white breast milk and frequently experiences headaches and pain behind the eyes. She is 153 cm tall and weighs 43 kg. Her body temperature is 36.5℃. Her pulse rate is 72 beats/minute and regular, while her blood pressure is 110/60 mmHg. Which of the following is not useful for diagnosis?", "choices_en": ["Cerebrospinal fluid examination", "Pituitary gland contrast-enhanced MRI", "Measurement of TSH and FT4", "Confirmation of medication history", "Repeat measurement of serum prolactin level"], "answer": ["a"]}
{"problem_id": "113D28", "problem_text_en": "A 72-year-old woman visited the clinic because she had blood on her stool for the past two months and has been experiencing constipation. The abdomen is flat, soft, and no tumors can be palpated. Endoscopic image of the lower gastrointestinal tract (A) and CT colonography (B) are shown separately. No metastasis to other organs or lymph nodes was found on chest and abdominal contrast-enhanced CT. Which surgical procedure is appropriate?", "choices_en": ["Sigmoidectomy", "Left hemicolectomy", "Right hemicolectomy", "Total colectomy", "Rectal resection surgery"], "answer": ["a"]}
{"problem_id": "113D29", "problem_text_en": "A 22-year-old man presents with jaundice as the main complaint. He visited the hospital because his family pointed out his jaundice. He has no subjective symptoms. Laboratory findings are as follows: RBC 4.52 million, Hb 14.3 g/dL, WBC 5,400, platelets 180,000. Blood chemistry findings: total bilirubin 3.8 mg/dL, direct bilirubin 0.3 mg/dL, AST 18 U/L, ALT 19 U/L, LD 210 U/L (reference range 176-353), ALP 220 U/L (reference range 115-359), gamma-GTP 19 U/L (reference range 8-50), negative for HBs antigen and HCV antibody. The serum bilirubin level increased by more than twice during a low-calorie diet test. Which of the following is the appropriate response?", "choices_en": ["Liver biopsy", "Observation/monitoring of progress", "Direct Coombs test", "Checking information in the Maternal and Child Health Handbook", "Endoscopic retrograde cholangiopancreatography (ERCP)"], "answer": ["b"]}
{"problem_id": "113D30", "problem_text_en": "A 66-year-old woman visited the hospital with the chief complaint of left ear fullness. She noticed left ear fullness two weeks ago and visited the hospital. She has neither ear pain nor dizziness. There is no abnormality in the nasal and oral cavities. Multiple hard masses are palpable in the left upper cervical region. The attached photo shows the left tympanic membrane. What is the site that needs to be examined to confirm the presence of a lesion?", "choices_en": ["Parotid gland", "Nasopharynx", "Oropharynx", "Hypopharynx", "Larynx"], "answer": ["b"]}
{"problem_id": "113D31", "problem_text_en": "A 50-year-old woman presents with fever and dyspnea. Six months ago, she was diagnosed with pulmonary aspergillosis that formed a cavity in the lower left lung field, after presenting with hemoptysis. Although she was treated with antifungal medication, her hemoptysis did not improve. Two weeks ago, she underwent left lower lobectomy to treat the pulmonary aspergillosis and was discharged 1 week ago. Yesterday, she developed a fever and dyspnea; therefore, she visited the emergency department. At 20 years of age, she underwent treatment for pulmonary tuberculosis. The patient's temperature is 38.7°C, pulse rate is 120/min and regular, blood pressure is 102/60 mmHg, respiratory rate is 24 breaths per minute, and oxygen saturation is 94% on room air. Chest X-rays are shown below, with (A) from 6 months ago and (B) from the current presentation. What should be done?", "choices_en": ["Pericardiocentesis", "Management of positive pressure ventilation", "Thoracoscopic surgery", "Chest tube insertion/drainage.", "Adrenal cortex steroid administration"], "answer": ["d"]}
{"problem_id": "113D32", "problem_text_en": "A 65-year-old woman has had difficulty finding the right words and her speech has become slow over the past two years. She has had difficulty with fine movements of her right hand for the past year, making it difficult to use chopsticks or fasten buttons. Recently, her right hand has been moving uncontrollably, so she has come for medical attention. She is conscious, with a height of 153 cm, a weight of 43 kg, a body temperature of 36.1°C, a pulse rate of 72 beats per minute and a regular rhythm, and a blood pressure of 118/68 mmHg. Her Revised Hasegawa Dementia Scale score is 19 out of 30, and her Mini-Mental State Examination (MMSE) score is 22 out of 30. She speaks with effort and her pronunciation is not clear, but her language comprehension is preserved. Intermittent movements are observed in her right upper limb, as if groping her clothes. When instructed to stop, she uses her left hand to restrain her right hand. The muscle tone in her right upper limb is highly rigid, but muscle tension in her left upper and lower limbs is normal. There is no muscle atrophy or tremor. Her limb reflexes are normal, and Babinski reflex is not observed. She exhibits delayed stride initiation with her right lower limb when walking. The coronal T1-weighted MRI image of the head is shown separately below. What is the most likely condition?", "choices_en": ["Parkinson's disease", "Frontotemporal dementia", "Alzheimer's type dementia", "Idiopathic normal pressure hydrocephalus", "Cortico-basal ganglionic degeneration"], "answer": ["e"]}
{"problem_id": "113D33", "problem_text_en": "A 6-year-old boy was brought to the clinic by his worried father due to his restlessness. He was born at 38 weeks of gestation, weighing 3,422 g without any signs of asphyxia at birth. He has not been reported to have significant developmental delays during infancy. Currently, he is in the kindergarten senior class, but he occasionally gets distracted by things that interest him while moving in groups and jumps out of line. He is not good at waiting his turn, and sometimes he picks fights with classmates who cannot observe the order. He also cannot listen to his teacher's talk and may leave the room. When scolded, he can explode and hit people. However, when he is calm, he is good at conversation, and he can write his name in hiragana. He is friendly and likes to play in groups. There is no apparent abnormality in his physical examination, including a neurological examination. Which of the following is an appropriate explanation to the father?", "choices_en": ["\"Let's restrict actions to prevent danger\"", "\"Let's discipline more strictly at home\"", "\"Let's start with taking medicine to control the symptoms.\"", "\"There is no particular problem so there is no need for hospital visits.\"", "\"Let's consider not demanding perfection too much and not losing our confidence\""], "answer": ["e"]}
{"problem_id": "113D34", "problem_text_en": "A 63-year-old man is admitted by ambulance due to repeated brief loss of consciousness. The patient had experienced a sense of discomfort in the chest while watching TV last night, after which he suddenly lost consciousness for about 5 seconds. Since then, he has had similar brief syncopal episodes repeated every 30 minutes or so, and his family called an ambulance. The electrocardiogram monitor shows an abnormal waveform (A) that matches the time of the loss of consciousness, and his pulse could not be palpated at that time. The patient has a history of hypertension and depression for 10 years and is taking thiazide diuretics, calcium channel blockers, and tricyclic antidepressants. There is no notable family history. During non-syncope periods, the patient is clear-minded. His pulse rate is 60/min and regular. Blood pressure is 136/78 mmHg. Respiratory rate is 16/min. Oxygen saturation is 98% (room air). No abnormal findings were heard on heart sounds and breath sounds. The abdomen is flat, soft, and no liver or spleen is palpated. Laboratory findings: red blood cell count 4.58 million, hemoglobin 12.9 g/dL, hematocrit 45%, white blood cell count 7,600, platelets 160,000. Biochemical examination: total protein 7.2 g/dL, albumin 3.7 g/dL, AST 32 U/L, ALT 26 U/L, LD 240 U/L (standard range 176-353), CK 112 U/L (standard range 30-140), blood urea nitrogen 16 mg/dL, creatinine 0.9 mg/dL, blood glucose 98 mg/dL, Na 140 mEq/L, K 1.9 mEq/L, Cl 99 mEq/L, Ca 11.2 mg/dL. CRP 0.1 mg/dL. The 12-lead electrocardiogram during non-syncope periods is shown separately (B). Mild left ventricular wall thickening is observed on echocardiography, but wall motion is within the normal range. Which of the following is not an appropriate response at this point?", "choices_en": ["Correction of potassium level.", "Administration of loop diuretic", "Discontinuation of tricyclic antidepressants", "Administration of magnesium supplement", "Continued electrocardiogram monitoring"], "answer": ["b"]}
{"problem_id": "113D35", "problem_text_en": "A 68-year-old female presented with weight loss and generalized fatigue. She noticed that her sun exposure resulted in more prominent sunburns on her face, hands and legs compared to other people after working in the fields for the past 4 years. Since last year, she experienced decreased appetite, weight loss, and persistent fatigue leading to her decision to visit a clinic. During her check-up since the age of 50, pleural thickening and calcified lesions have been observed in her lungs. She is 164cm in height and weighs 49kg. Her body temperature is 35.7℃. Her pulse is regular at 64/min, and blood pressure is 98/54mmHg. There is pigmentation observed on her face, limbs, joint extension, and inside her mouth. Blood test results showed erythrocyte count of 3.5 million/μL, Hb of 10.8g/dL, Hct of 32%, and WBC of 4,200/μL. Blood biochemistry results showed a urea nitrogen level of 17mg/dL, creatinine level of 0.7mg/dL, glucose level of 70mg/dL, Na level of 127mEq/L, K level of 5.3mEq/L, and Cl level of 94mEq/L. Tuberculosis-specific whole blood interferon-gamma release assay (IGRA) was positive. What are the expected findings in this patient?", "choices_en": ["Eosinophil depletion", "Calcification of the adrenal gland", "Low blood ACTH level", "Decrease in plasma renin activity", "High levels of free cortisol in the urine"], "answer": ["b"]}
{"problem_id": "113D36", "problem_text_en": "A 55-year-old woman presented with right knee joint pain. She was diagnosed with rheumatoid arthritis 5 years ago, and her rheumatoid arthritis was well controlled by administering anti-IL-6 receptor antibodies recently. She visited the hospital because she had developed right knee joint pain a few days ago. Her body temperature was 37.0°C. Redness, swelling, and warmth were observed in her right knee, but there was no swelling or tenderness in other joints. Laboratory findings showed: RBC, 3.8 million cells/mm3; Hb, 10.1 g/dL; Ht, 31%; WBC, 9,800 cells/mm3 (segmented neutrophils, 70%; band neutrophils, 16%; monocytes, 4%; lymphocytes, 10%); and platelets, 230,000/mm3. CRP was 1.2 mg/dL. Which of the following is the appropriate initial management?", "choices_en": ["Joint aspiration", "Administration of antibiotics", "Measurement of anti-nuclear antibodies", "Joint MRI imaging", "Steroid pulse therapy."], "answer": ["a"]}
{"problem_id": "113D37", "problem_text_en": "A 14-year-old boy presents with chief complaint of pain in his scrotum. The pain started at midnight and got worse, with nausea and vomiting, leading him to seek medical attention at 5 a.m. His temperature is 37.1℃, pulse rate is 92/min, regular. Blood pressure is 120/58 mmHg. The abdomen is flat and soft with no palpable liver or spleen. The right scrotum is red, swollen, and tender on palpation. Urinalysis shows negative for protein, glucose, and occult blood, with 1-4/HPF of white blood cells and no red blood cells in the sediment. The blood test shows RBC count of 4.62 million, hemoglobin of 13.6 g/dL, hematocrit of 39%, WBC count of 7,100, and platelet count of 200,000. Blood chemistry shows total protein of 6.8 g/dL, albumin of 4.0 g/dL, AST of 27 U/L, ALT of 14 U/L, blood urea nitrogen of 9 mg/dL, and creatinine of 0.7 mg/dL. CRP is 0.3 mg/dL. An ultrasound image of the scrotal region is shown separately. What is the most appropriate treatment?", "choices_en": ["Cooling of the scrotal area.", "Emergency surgery", "Administration of antibiotics.", "Arterial embolization therapy", "Urinary catheterization"], "answer": ["b"]}
{"problem_id": "113D38", "problem_text_en": "A 67-year-old man presents with complaints of dysphagia and weight loss. He has been aware of dysphagia for the past month and visited a nearby medical institution where an abnormality was noted on upper gastrointestinal endoscopy. He has lost 3 kg in weight in the past month. There is no significant medical history. He has been smoking 20 cigarettes per day for 40 years and drinking 2 gō of shōchū per day for 42 years. His height is 171 cm, and his weight is 67 kg. His pulse is regular at 68 beats per minute, and his blood pressure is 124/62 mmHg. Blood tests show a red blood cell count of 3.18 million, an Hb level of 10.5 g/dL, an Ht level of 31%, a white blood cell count of 8,300, and a platelet count of 160,000. Upper gastrointestinal contrast image (A) and upper gastrointestinal endoscopic image (B) are shown separately. Which of the following is not helpful in determining the treatment plan?", "choices_en": ["FDG-PET (Fluorodeoxyglucose-positron emission tomography)", "Chest enhanced CT scan.", "Esophageal manometry", "Abdominal ultrasound examination", "Endoscopic ultrasonography"], "answer": ["c"]}
{"problem_id": "113D39", "problem_text_en": "A 65-year-old man who has been diagnosed with prostate cancer (T2N0M0) is scheduled to undergo robot-assisted laparoscopic radical prostatectomy. His PSA level is 8.4 ng/mL (normal range: ≤4.0). Which of the following explanations about his postoperative life is incorrect?", "choices_en": ["\"I can exercise.\"", "\"You can ejaculate\"", "\"You can take a bath\"", "\"Urinary incontinence occurs\"", "\"There are no dietary restrictions.\""], "answer": ["b"]}
{"problem_id": "113D40", "problem_text_en": "A 78-year-old female patient came to the hospital complaining of fever and neck pain. She had a fever of 39.0℃ and swelling and pain appeared in her right ankle joint four weeks ago. The symptoms in her right ankle joint improved within a few days, and the fever subsided. Five days ago, she had a fever again and neck pain appeared, which led her to visit the hospital. Her temperature is 38.4℃. Her pulse rate is 104 beats per minute, regular. Her blood pressure is 134/74 mmHg, and her respiratory rate is 18 breaths per minute. Her SpO2 is 97% (room air). She has limited range of motion in the neck due to pain. No swelling or tenderness is observed in her limb joints. No abnormalities are detected in heart sounds and breath sounds. Her abdomen is flat, soft, and there is no palpable liver or spleen, and no tenderness is observed. There is no abnormality in urinalysis. The erythrocyte sedimentation rate is 110 mm/hour. Blood test results include: red blood cells, 3.85 million; hemoglobin, 10.8 g/dL; hematocrit, 40%; white blood cells, 9,800 (neutrophils, 82%; monocytes, 6%; lymphocytes, 12%); and platelets, 520,000. Blood biochemical test results include: total protein, 6.3 g/dL; albumin, 3.0 g/dL; total bilirubin, 0.8 mg/dL; AST, 12 U/L; ALT, 14 U/L; LD, 264 U/L (reference range, 176-353); blood urea nitrogen, 19 mg/dL; creatinine, 0.5 mg/dL; and CRP, 18 mg/dL. No abnormalities were found in the cerebrospinal fluid test. The following is a separate sagittal and axial image of a neck CT scan. What is the most likely diagnosis in this case?", "choices_en": ["Behçet's disease", "Tuberculous spondylitis", "Rheumatoid arthritis", "Posterior longitudinal ligament ossification", "Crystal-induced arthritis"], "answer": ["e"]}
{"problem_id": "113D41", "problem_text_en": "A 52-year-old man presents with complaints of sore throat and difficulty breathing to the emergency department late at night. He has been unable to swallow due to severe pain for the past 4 hours and has experienced breathing difficulty for the past 2 hours. His body temperature is 38.5°C, pulse rate is 96/min regular, blood pressure is 150/90 mmHg, respiratory rate is 30/min, and SpO2 is 92% on room air. A laryngoscopic image is provided separately. What is the first step to take?", "choices_en": ["Airway management", "Nasogastric tube insertion", "Instructions for home rest", "Administration of anti-inflammatory analgesics.", "Endoscopic incision and drainage of pus"], "answer": ["a"]}
{"problem_id": "113D42", "problem_text_en": "A 56-year-old man was admitted by ambulance due to impaired consciousness. He developed headache, nausea, and vomiting at 7:30 a.m. Gradually, his level of consciousness became unclear, and his wife requested an ambulance 30 minutes later. He had been diagnosed with hypertension at age 40, but had not received regular medical treatment. He smokes 20 cigarettes per day and drinks 2 liters of beer per day. On admission, his level of consciousness was Japanese Coma Scale (JCS) I-3, body temperature was 37.9°C, heart rate was 96 beats per minute with regular rhythm, blood pressure was 226/136 mmHg, respiratory rate was 22 breaths per minute, and SpO2 was 96% under oxygen therapy at 3 L/minute via nasal cannula. Fundoscopy revealed a congested optic disc. There was no abnormality in heart sounds. Coarse crackles were heard bilaterally in the chest. The abdomen was flat, soft, and non-tender, and the liver and spleen were not palpable. Laboratory findings showed red blood cells of 4.12 million/μL, hemoglobin of 13.9 g/dL, white blood cells of 9,300/μL, and platelets of 210,000/μL. Blood biochemistry revealed total protein of 6.3 g/dL, albumin of 3.2 g/dL, total bilirubin of 0.9 mg/dL, AST of 25 U/L, ALT of 21 U/L, LDH of 232 U/L with reference range of 176 to 353 U/L, creatinine of 1.3 mg/dL, blood glucose of 94 mg/dL, sodium of 139 mEq/L, potassium of 3.8 mEq/L, chloride of 103 mEq/L, and CRP of 1.6 mg/dL. Although mild brain edema was suspected on head CT, intracranial hemorrhage was not detected. Which of the following is the appropriate strategy for blood pressure lowering?", "choices_en": ["Not performing blood pressure reduction.", "Administering nitrate medication sublingually.", "Administering nitrate drugs transdermally.", "Administering calcium channel blockers sublingually.", "Perform intravenous administration of a calcium channel blocker."], "answer": ["e"]}
{"problem_id": "113D43", "problem_text_en": "An 82-year-old man was brought to the emergency department complaining of frequent vomiting. He was diagnosed with cholecystolithiasis 10 years ago, but was under observation because he was asymptomatic. He vomited twice with food debris during lunch yesterday and did not eat dinner. He vomited three times at midnight, so the ambulance was called. His temperature was 36.8°C. The heart rate was 100/min and regular, the blood pressure was 100/58 mmHg, and the respiratory rate was 20/min. The abdomen was bloated, and tenderness was observed from the epigastrium to the umbilicus, but no muscular defense was observed. Metallic sounds were heard on auscultation. Laboratory test results showed red blood cells at 3.95 million/μL, Hb of 12.4 g/dL, Hct of 37%, WBC of 12,600/μL, and platelets of 180,000/μL. His biochemistry results showed total protein of 6.6 g/dL, albumin of 3.3 g/dL, total bilirubin of 1.4 mg/dL, AST of 18 U/L, ALT of 8 U/L, blood urea nitrogen of 38 mg/dL, and creatinine of 1.8 mg/dL. Abdominal plain CT (A) 2 years ago and the current abdominal plain CT (B) are shown separately. What is the appropriate treatment?", "choices_en": ["Administration of laxatives", "Ileus release surgery", "Laparoscopic cholecystectomy", "Percutaneous transhepatic gallbladder drainage", "Endoscopic biliary drainage."], "answer": ["b"]}
{"problem_id": "113D44", "problem_text_en": "A 47-year-old woman presented with complaints of irregular genital bleeding and lower back pain for the past month. Her menstrual cycle is 32 days. On pelvic examination, a hard mass continuous with the right pelvic wall was palpated from the cervix. Blood tests showed a red blood cell count of 3.85 million, Hb of 11.0 g/dL, Ht of 33%, and a white blood cell count of 9,500 with 450,000 platelets. Blood biochemistry tests showed a total protein of 6.8g/dL, albumin of 3.5g/dL, AST of 30U/L, ALT of 22U/L, blood urea nitrogen of 28 mg/dL, and creatinine of 0.7 mg/dL. A cauliflower-like and easily bleeding tumor with a diameter of 4 cm was found in the uterine cervix on colposcopy. A biopsy revealed squamous cell carcinoma. There were no distant metastases. What is the appropriate treatment?", "choices_en": ["Surgery", "Radiation therapy", "Chemotherapy for cancer", "Administration of molecular targeted drugs", "Chemoradiotherapy"], "answer": ["e"]}
{"problem_id": "113D45", "problem_text_en": "An 11-month-old infant was brought in by an ambulance due to accidental ingestion. The father reported that the infant ingested a lithium battery which was unpackaged at 5:30 pm, and he immediately called an ambulance. The infant was in good spirits and had a good complexion when brought in. No signs of labored breathing were observed, and there was no abnormality in breathing sounds. A chest-abdominal X-ray was taken at 6:30 pm, which is shown separately. An urgent endoscopic removal surgery was planned. What is the main reason for performing an emergency endoscopic removal?", "choices_en": ["Prevention of arrhythmia", "Prevention of respiratory disorders", "Avoiding esophageal perforation", "Prevention of gastroesophageal reflux", "Early resumption of oral intake"], "answer": ["c"]}
{"problem_id": "113D46", "problem_text_en": "A 63-year-old man presents with chief complaint of lower leg swelling. He was diagnosed with diabetes mellitus 12 years ago and has been prescribed oral anti-diabetic medication at his local clinic. Two years ago, he was found to have urinary protein. He came to the hospital because he was concerned about the onset of swelling in his face and lower legs in the evenings over the past month. His height is 170 cm, weight is 78 kg. His pulse is 68 bpm and regular, and his blood pressure is 168/92 mmHg. Mild pitting edema is observed in the face and the front of the tibia on both sides. Urinalysis: protein 3+, glucose (-), occult blood (-). Blood analysis: red blood cells 4.25 million/μL, Hb 13.0 g/dL, Ht 39%, white blood cells 6,700/μL, platelets 240,000/μL. Blood chemistry analysis: albumin 3.8 g/dL, blood urea nitrogen 28 mg/dL, creatinine 1.6 mg/dL, eGFR 40 mL/min/1.73m2. Blood glucose level is 114 mg/dL, HbA1c 6.8% (reference range: 4.6-6.2%). In a 24-hour urine test, urine volume was 1,600 mL/day, protein was 2.4 g/day, creatinine was 1.24 g/day, Na was 5.6 g/day, and Cl was 8.9 g/day. Which of the following is correct in this patient?", "choices_en": ["The amount of salt intake is appropriate.", "It is chronic kidney disease in stage 5.", "Presenting with nephrotic syndrome.", "Corticosteroids are effective.", "Progressive renal function decline is expected in the future."], "answer": ["e"]}
{"problem_id": "113D47", "problem_text_en": "A 24-year-old woman presents with lower abdominal pain on the first day of menstruation. She has been experiencing menstrual pain for the last five years. The severity and duration of pain vary with each menstrual cycle. This morning, she started her period and experienced severe lower abdominal pain while commuting to work, so she got off the train and came to the hospital. Her menstrual cycle is regular with a 28-day interval. She reports no diarrhea or vomiting and is alert and oriented. Her height is 160 cm, weight is 52 kg, and temperature is 36.6℃. Her pulse is regular at 72 bpm, blood pressure is 118/72 mmHg, and respiratory rate is 20 breaths per minute. Her abdomen is flat and soft without palpable liver or spleen. There is no cervical or adnexal tenderness. On internal examination, the uterus is not enlarged and no mass or tenderness is noted in the cul-de-sac. Laboratory findings are as follows: red blood cells 3.62 million/μL, hemoglobin 11.2 g/dL, hematocrit 37%, white blood cells 5,600/μL, and platelets 210,000/μL. C-reactive protein is 0.1 mg/dL. The pregnancy test is negative. Ultrasonography reveals no abnormalities in the ovaries or fluid in the cul-de-sac. What is the most likely condition?", "choices_en": ["Salpingitis", "Luteal phase bleeding", "Endometriosis", "Ovarian Torsion", "Functional menstrual disorder"], "answer": ["e"]}
{"problem_id": "113D48", "problem_text_en": "A 43-year-old man was referred to a hospital after being pointed out to have leukocytosis during a medical check-up. He has no particular symptoms. His temperature is 36.5℃, his pulse is regular at 84/min, and his blood pressure is 136/76 mmHg. No superficial lymph nodes can be palpated. The spleen is palpable 3 cm below the left costal arch. Laboratory findings show: red blood cells 4.3 million/μL, Hb 12.8 g/dL, Hct 42%, white blood cells 35,000/μL (myeloblasts 2%, promyelocytes 2%, myelocytes 5%, metamyelocytes 7%, band neutrophils 4%, segmented neutrophils 60%, eosinophils 8%, basophils 7%, lymphocytes 5%), and platelets 350,000/μL. Serum vitamin B12 is 8,600 pg/mL (reference range: 250-950). A bone marrow smear May-Giemsa stain specimen (A), bone marrow chromosome analysis (B), and FISH analysis of the peripheral blood neutrophil bcr/abl gene (C) are shown separately. What is the treatment drug?", "choices_en": ["Sulfurous acid", "Imatinib", "Gefitinib", "Bortezomib", "All-trans retinoic acid"], "answer": ["b"]}
{"problem_id": "113D49", "problem_text_en": "A 2-year-old boy has been intermittently experiencing high fever since the age of 1 year and 5 months, and has been receiving treatment for diagnosed urinary tract infections. He visited the hospital because of a fever in the 38-degree range that had persisted since the previous night. Urinalysis showed protein 1+, sugar (-), occult blood 1+, and sediment with 1-4 red blood cells/HPF and 50-99 white blood cells/HPF. Blood test results showed: red blood cells 4.88 million, Hb 12.4 g/dL, Ht 37%, white blood cells 14,800, and platelets 300,000. Blood chemistry results showed: total protein 6.9 g/dL, AST 29 U/L, ALT 18 U/L, blood urea nitrogen 9 mg/dL, and creatinine 0.5 mg/dL. CRP was 8.6mg/dL, and Gram-negative rods were detected by a Gram-stained urine sediment. Acute pyelonephritis was diagnosed and treated with antibiotics. The image of the bladder and urethra during urination after the fever subsided is shown separately. What is the most appropriate treatment?", "choices_en": ["Pyeloplasty", "Ureteral catheterization procedure", "Urethrotomy", "Bladder enlargement surgery", "Anti-reflux surgery for the bladder ureter"], "answer": ["e"]}
{"problem_id": "113D50", "problem_text_en": "A 72-year-old man presented with a chief complaint of frequent urination for the past 6 months. He feels the need to go to the toilet several times a day but does not experience any urine leakage during cough or sneeze. He sought medical attention a month ago due to discomfort during urination, which did not improve. He has no significant medical or family history. His abdomen is flat, soft, and there is no palpable liver or spleen. Urinalysis shows (-) protein, (-) glucose, 1+ occult blood, and 5-9 red blood cells/HPF and 5-9 white blood cells/HPF in the sediment. His blood test results show 4.42 million red blood cells, Hb 14.0 g/dL, Ht 40%, and 7,400 white blood cells per microliter. His platelet count is 240,000. Blood chemistry test results show a total protein level of 6.9 g/dL, albumin level of 4.3 g/dL, total bilirubin level of 1.2 mg/dL, AST level of 21 U/L, ALT level of 15 U/L, urea nitrogen level of 22 mg/dL, creatinine level of 1.0 mg/dL, uric acid level of 8.6 mg/dL, and blood sugar level of 94 mg/dL. His total cholesterol level is 192 mg/dL, and his sodium, potassium, and chloride levels are 142 mmol/L, 4.6 mmol/L, and 106 mmol/L, respectively. Abdominal ultrasound examination did not reveal hydronephrosis. Abdominal X-ray (A) and abdominal plain CT (B) are shown separately. A lithotripsy was performed, and a brick-red stone was discharged. What is the effective drug for preventing recurrence?", "choices_en": ["Allopurinol", "Thiazide diuretic", "Thiopronine", "Vitamin D preparation(s)", "Benzbromarone"], "answer": ["a"]}
{"problem_id": "113D51", "problem_text_en": "A 47-year-old man presented with chest tightness. He had been receiving treatment for hypertension and dyslipidemia at a clinic close to his home. He suddenly felt chest tightness radiating to his jaw at 7:00 am today and came to the hospital by taxi 15 minutes later because the symptoms did not improve. He was conscious and alert. His pulse was 80 bpm, regular. His blood pressure was 156/80 mmHg. His respiratory rate was 18 bpm. His SpO2 was 98% on room air. There were no abnormal findings in heart sounds and breath sounds. Blood tests showed red blood cells 5.01 million, Hb 15.1 g/dL, white blood cells 12,000, and platelets 220,000. Blood biochemistry tests showed AST 40 U/L, ALT 28 U/L, LD 178 U/L (reference range 176-353), CK 100 U/L (reference range 30-140), blood urea nitrogen 11 mg/dL, creatinine 0.9 mg/dL, total cholesterol 212 mg/dL, triglycerides 168 mg/dL, HDL cholesterol 42 mg/dL, Na 142 mEq/L, K 4.7 mEq/L, and Cl 102 mEq/L. The CRP level was 1.2 mg/dL. Chest X-ray showed no abnormalities. His electrocardiogram is shown separately. After he arrived at the hospital, an intravenous line was secured and nitroglycerin was administered sublingually. What should be the next appropriate response?\n", "choices_en": ["Cardiac MRI", "Electric shock", "Holter electrocardiogram", "Coronary angiography examination.", "Resting myocardial scintigraphy"], "answer": ["d"]}
{"problem_id": "113D52", "problem_text_en": "A 72-year-old woman was urgently hospitalized due to gastrointestinal bleeding and was diagnosed with rectal cancer after examination. The treatment plan is surgery, preceded by preoperative radiation therapy and rehabilitation. She has a history of hypertension for 10 years and is taking antihypertensive medication. She is fully conscious with a height of 152 cm, weight of 41kg, and a body temperature of 36.7℃. Her pulse rate is 88 beats/min and regular, blood pressure is 118/78 mmHg, respiratory rate is 20 breaths/min, and SpO2 is 97% on room air. Her abdomen is flat and soft, with no palpable liver or spleen. There is no nystagmus. She has symmetrical nasolabial folds, but drooling and difficulty in articulation. There is no tongue atrophy or limb weakness. She can walk in tandem and stand on one leg for 10 seconds. Her blood test results are as follows: red blood cells 3.41 million, Hb 10.7 g/dL, white blood cells 3,700, platelets 170,000, albumin 3.0 g/dL, total bilirubin 0.4 mg/dL, AST 14 U/L, ALT 6 U/L. ALP 174 U/L (reference range: 115-359), γ-GTP 23 U/L (reference range: 8-50), CK 92 U/L (reference range: 30-140), blood urea nitrogen 18 mg/dL, creatinine 0.6 mg/dL, Na 143 mEq/L, K 4.2 mEq/L, Cl 108 mEq/L. The CEA level is 6.3 ng/mL (reference range: 5 or less), CA19-9 level is 73 U/mL (reference range: 37 or less), and CRP level is 0.7 mg/dL. An MRI of the head is also shown in the separate T2-weighted image. Which test is necessary to develop a rehabilitation plan during the perioperative period?", "choices_en": ["Electroencephalogram (EEG)", "Swallowing function test", "Postural sway test", "Needle electromyography examination", "Facial nerve conduction test"], "answer": ["b"]}
{"problem_id": "113D53", "problem_text_en": "A 72-year-old man underwent right lower lobectomy and mediastinal lymph node dissection for right lung adenocarcinoma. The surgery lasted 2 hours and 40 minutes, with a blood loss of 80 mL. Vital signs were stable throughout the surgery. He had a good overall health condition and no abnormalities in cardiac function were found before surgery. He had been smoking 20 cigarettes a day for 50 years before admission. Respiratory function tests showed a VC of 3.51 L, %VC of 102%, FEV1 of 2.20 L, and FEV1% of 65%. His body temperature was 37.2℃ just after returning to his room. His pulse rate was 64 beats/minute, regular. His blood pressure was 128/68 mmHg, and his respiratory rate was 14 breaths/minute. His oxygen saturation (SpO2) was 98% with a reservoir mask at a flow rate of 8 L/minute of supplemental oxygen. Blood tests showed red blood cell counts of 3.83 million/μL, a hemoglobin level of 11.2 g/dL, a white blood cell count of 6,800/μL, and a platelet count of 190,000/μL. Blood chemistry showed a total protein level of 6.2 g/dL and an albumin level of 3.0 g/dL. Bubbles were observed in the water seal of the chest tube with each exhalation. Drainage was minimal. Which of the following postoperative instructions is appropriate?", "choices_en": ["Transfusion of red blood cells with lactated Ringer's solution", "Removal of thoracic drain", "Administration of albumin preparation", "Administration of adrenal cortex steroids", "Prescription of respiratory rehabilitation"], "answer": ["e"]}
{"problem_id": "113D54", "problem_text_en": "A 57-year-old man presents with fever and fatigue. He noticed a lump in his right neck about a month ago. He developed a fever over 38°C and fatigue two weeks ago, which led him to seek medical attention. Three lymph nodes, each measuring 1.5 cm in diameter, are palpable in his right neck. His abdomen is flat and soft, and his liver and spleen are not palpable. There are no significant past medical or family histories. The patient is conscious, his height is 170 cm, his weight is 68 kg, his body temperature is 37.4°C, his pulse rate is 100 bpm and regular, his blood pressure is 132/90 mmHg, his respiratory rate is 24/min, and his SpO2 is 98% (room air). Hematological parameters reveal a red blood cell count of 2.1 million/µL, a hemoglobin level of 7.4 g/dL, a hematocrit of 23%, a white blood cell count of 16,000/µL (with 60% abnormal cells), and a platelet count of 50,000/µL. A bone marrow blood smear is shown separately after May-Giemsa staining. His bone marrow cell karyotype analysis revealed a normal male genotype. Peroxidase test of abnormal cells was negative. Surface marker analysis showed CD19-positive, CD20-negative, CD33-negative, and TdT (terminal deoxynucleotidyl transferase)-positive. What is the diagnosis?", "choices_en": ["Acute myeloid leukemia", "Acute lymphocytic leukemia", "Chronic myeloid leukemia", "Chronic lymphocytic leukemia", "Adult T-cell leukemia"], "answer": ["b"]}
{"problem_id": "113D55", "problem_text_en": "A 24-year-old man has been diagnosed with spinal muscular atrophy and has received genetic counseling. He is concerned about the impact of the disease on his 16-year-old sister. What is the appropriate response?", "choices_en": ["\"Let's not tell until my younger sister becomes an adult.\"", "\"Let's do a genetic test as soon as symptoms appear in your younger sister\"", "\"We will perform genetic testing on your younger sister, so please bring her along.\"", "\"Since women do not develop the disease, genetic testing is not necessary.\"", "\"First, let's make the younger sister understand about this disease\"."], "answer": ["e"]}
{"problem_id": "113D56", "problem_text_en": "A 52-year-old woman presented with complaints of numbness in her left little and ring fingers. The numbness had persisted for three months, but she sought medical attention only two weeks ago when she had difficulty typing at work. She has been treated with oral hypoglycemic agents for diabetes for the past two years and has good glycemic control. She is 158 cm tall and weighs 57 kg. There is hypoesthesia of the ulnar aspect of the left palm and the left little and ring fingers, and the manual muscle testing showed a grade of 2 for the left wrist flexor, deep flexor of the fingers of the ring and little fingers, the first dorsal interosseous, and the abductor of the left little finger. Atrophy of the left first dorsal interosseous muscle was observed. A peripheral nerve conduction study was performed. What is the most likely diagnosis?", "choices_en": ["Cervical Shoulder Arm Syndrome", "Cervical radiculopathy", "Cubital tunnel syndrome", "Thoracic outlet syndrome", "Diabetic neuropathy"], "answer": ["c"]}
{"problem_id": "113D57", "problem_text_en": "A 61-year-old man complains of fever and rash. He has had a fever since the day before yesterday, and erythematous rash appeared on the trunk yesterday. Today, the rash has spread to the limbs, and he has come to the hospital. He continues to have a fever and also complains of a headache. The rash is not itchy. He has no abdominal pain or diarrhea. One week ago, he went to the mountains and worked on logging. No other family members have the same symptoms. He is conscious and alert. His height is 162 cm, weight is 62 kg. His body temperature is 38.8 ℃. Blood pressure is 146/88 mmHg, and pulse rate is 96 beats/minute, regular. Respiratory rate is 20 breaths/minute, and SpO2 on room air is 97%. There are scattered 2-3 cm erythematous macules on the trunk and limbs. On the right inguinal area, there is a 5 mm crust with reddening around it. There are no abnormalities in the conjunctiva and cornea of the eye, and no redness or swelling of the throat or tonsils. No abnormalities are found on heart and lung auscultation. His abdomen is flat and soft, and liver and spleen are not palpable. There are no abnormalities on neurological examination, and there is no joint swelling. Urinalysis showed (-) protein, (-) glucose, and (-) occult blood. Blood test results showed 4,880,000 red blood cells, hemoglobin 14.1 g/dL, hematocrit 42%, white blood cells 4,300 (neutrophils 67%, eosinophils 1%, basophils 1%, monocytes 15%, lymphocytes 16%), platelets 90,000. Blood biochemistry test results showed total protein 7.5 g/dL, albumin 3.9 g/dL, total bilirubin 0.9 mg/dL, AST 76 U/L, ALT 46 U/L, LD 356 U/L (reference 176-353), γ-GTP 45 U/L (reference 8-50), CK 46 U/L (reference 30-140), blood urea nitrogen 22 mg/dL, creatinine 0.9 mg/dL, blood glucose 96 mg/dL, Na 134 mEq/L, K 4.4 mEq/L, Cl 98 mEq/L, and CRP 7.4 mg/dL. What is the appropriate treatment?", "choices_en": ["Penicillin", "Acyclovir", "Aminoglycoside", "Amphotericin B", "Tetracycline"], "answer": ["e"]}
{"problem_id": "113D58", "problem_text_en": "A 50-year-old woman presented with a mass in her right breast. She had noticed a 2 cm lump in her right breast for 2 years, but had not sought medical attention because it had not changed much. Over the past 4 months, the mass has increased in size and has become painful, prompting her to seek medical attention. The mass in the right breast is 17 cm in the longest diameter, elastic soft, and not fixed to the chest wall. There is no redness or infiltration of the mass on the skin. There is no palpable axillary lymph node. A chest CT is also presented. What is the most likely condition?", "choices_en": ["Mastitis", "Mastopathy (breast disease or disorder)", "Fibroadenoma of the breast", "Breast lobular tumor", "Intraductal papilloma"], "answer": ["d"]}
{"problem_id": "113D59", "problem_text_en": "A 48-year-old woman visited the hospital because she noticed a bend in a utility pole when looking with her right eye and experienced visual impairment. Her visual acuity was 0.05 in the right eye (0.6 × -2.0D) and 0.1 in the left eye (1.2 × -2.75D). A separate right fundus photograph is also provided. What is the diagnostic test that would be useful in this case?", "choices_en": ["Color vision test", "Visual field test", "Fluorescein angiography", "Electroretinogram (ERG) test", "Optical coherence tomography (OCT)"], "answer": ["e"]}
{"problem_id": "113D60", "problem_text_en": "A 55-year-old man presents with low back pain as the primary complaint. He has been aware of low back pain since his 30s. He presented because his low back pain had worsened three months ago, and he also developed bilateral elbow and knee joint pain. No abnormalities were found in the conjunctiva of the eyelids or eyes. No abnormalities were detected in heart sounds or breath sounds. The abdomen is flat, soft, and no liver or spleen was palpable, and there was no tenderness. Tenderness was observed in both elbow and knee joints, both buttocks, and both Achilles tendon insertion sites. Blood test findings show a red blood cell count of 4.46 million, Hb level of 13.8 g/dL, Ht level of 42%, a white blood cell count of 6,200, and a platelet count of 160,000. The biochemistry test showed a serum urea nitrogen level of 12mg/dL and a creatinine level of 0.7mg/dL. Immunoserology tests also showed a C-reactive protein level of 0.3mg/dL, negative anti-nuclear antibodies, rheumatoid factor, and anti-CCP antibodies. An X-ray of the pelvis is presented separately. What are the characteristics of this patient's low back pain?", "choices_en": ["Often accompanied by fever.", "Accompanied by abnormal sensations in the lower extremities.", "Low back pain is unilateral.", "The timing of the onset of lower back pain is identifiable.", "The pain worsens at rest and improves with movement."], "answer": ["e"]}
{"problem_id": "113D61", "problem_text_en": "A 52-year-old man presents with a chief complaint of fever. He developed a fever, cough, and purulent sputum three days prior to presentation, and came to the hospital because his symptoms did not improve. He has been taking oral medication for diabetes for 5 years. He has a regular diet and is able to drink water. He is alert and conscious. His body temperature is 39.1℃. His pulse is 112 beats per minute and regular. His blood pressure is 140/86 mmHg. His respiration rate is 18 breaths per minute. His room air oxygen saturation is 97%. Coarse crackles are heard in the lower left chest. Laboratory findings show a white blood cell count of 17,900 (neutrophils 88%, monocytes 2%, lymphocytes 10%). Blood chemistry shows AST 62 U/L, ALT 54 U/L, BUN 16 mg/dL, creatinine 0.8 mg/dL, and blood glucose 150 mg/dL. The CRP is 10.6 mg/dL. Gram-positive diplococci are detected on Gram staining of the sputum. The urine pneumococcal antigen test is positive. A chest X-ray is shown separately. Which explanation to the patient is appropriate?", "choices_en": ["\"You have pneumonia, but it is not severe, so let's treat it on an outpatient basis.\"", "\"Since the inflammatory response is high and it is likely to become severe, let's hospitalize and treat it.\"", "\"Since pneumococcal pneumonia has a high mortality rate, let's enter the intensive care unit.\"", "\"You have liver dysfunction that is likely to worsen to a severe state, so let's be hospitalized and receive treatment.\"", "\"You have diabetes as a complication, and it is likely to worsen, so let's hospitalize and treat it.\""], "answer": ["a"]}
{"problem_id": "113D62", "problem_text_en": "A 70-year-old man presents with a chief complaint of rash on the lower extremities. No abnormalities were found in a blood test taken 3 months ago at a medical clinic near his home. He noticed pinpoint rashes on both lower extremities 3 days ago, which have since increased and prompted him to seek medical attention. He has been receiving antihypertensive treatment since age 50 but is not taking any over-the-counter medication. His body temperature is 36.4°C, pulse rate is 72 beats per minute and regular, and blood pressure is 138/82 mmHg. His abdomen is flat and soft without palpable liver or spleen. Purpura is found at venipuncture sites on both upper extremities and multiple purpura are observed on both lower extremities. Hematology: Red blood cells: 4.63 million, hemoglobin: 13.2 g/dL, hematocrit: 40%, white blood cells: 6,400 (neutrophils 55%, eosinophils 1%, basophils 2%, monocytes 6%, lymphocytes 36%), and platelets: 8,000/mm3. Blood chemistry includes a total protein of 7.0 g/dL, albumin of 4.5 g/dL, aspartate aminotransferase of 32 U/L, alanine aminotransferase of 25 U/L, lactate dehydrogenase of 186 U/L (reference range: 176–353), blood urea nitrogen of 12 mg/dL, creatinine of 0.6 mg/dL, glucose of 86 mg/dL, sodium of 142 mEq/L, potassium of 4.1 mEq/L, and chloride of 104 mEq/L. Bone marrow examination shows the presence of megakaryocytes, but no morphological abnormalities are observed in hematopoietic cells. Which diagnostic test would be useful in determining the treatment plan?", "choices_en": ["Urea breath test", "Platelet function test", "Bone marrow chromosome analysis", "Drug lymphocyte stimulation test", "Human leukocyte antigen (HLA) typing"], "answer": ["a"]}
{"problem_id": "113D63", "problem_text_en": "A 30-year-old woman presents with chief complaints of fever, fatigue, and nausea. She was diagnosed with systemic lupus erythematosus (SLE) and lupus nephritis (WHO Class IV) at the age of 15 and had multiple relapses. At her regular check-up 3 weeks ago, there were no abnormalities in symptoms, physical examination, or tests, and she was instructed to continue prednisolone 5 mg/day and azathioprine 100 mg/day. Five days ago, she developed fever, nausea, and pain in the left lumbar region and visited a medical institution near her home. Urine test: Protein 1+, occult blood 1+, white blood cells 3+, bacteria 3+. Blood test: White blood cell count 12,000, CRP 8.8 mg/dL. She was diagnosed with urinary tract infection and was instructed to take levofloxacin. Two days later, she became afebrile, but yesterday she developed systemic pain and nausea and visited the hospital. Her last menstruation was 10 days ago and lasted for 5 days. She is alert and conscious with a body temperature of 37.6°C, pulse rate of 92 beats/min, regular, blood pressure of 88/50 mmHg, respiration rate of 24 breaths/min, and SpO2 of 99% on room air. No skin or mucosal rash is observed, and Jolt accentuation is not noted. No abnormalities are observed in heart and lung sounds. The abdomen is flat, soft and neither the liver nor spleen is palpable. She has no tenderness, edema or limitation of joint motion. No percussion pain is detected in the costovertebral angle. Urine test: Protein (-), white blood cells 1-4/HPF, red blood cells 1-4/HPF, bacteria (-). Blood test: White blood cell count 4,500, blood biochemistry test normal, except for Na 124 mEq/L, K 5.1 mEq/L, Cl 92 mEq/L, and TSH 1.2 μU/mL (reference range 0.5-5.0) and FT4 1.0 ng/dL (reference range 0.9-1.7). CRP 3.1 mg/dL. The blood culture at the medical institution near her home was negative. Normal saline infusion was started. Which of the following is the next appropriate step?", "choices_en": ["Intravenous administration of furosemide", "Increase in Azathioprine dose", "Supplementation of thyroid hormone", "Administration of carbapenem antibiotics", "Intravenous administration of hydrocortisone"], "answer": ["e"]}
{"problem_id": "113D64", "problem_text_en": "A 34-year-old primigravida (G1P0) at 32 weeks of gestation presents to the hospital with lower abdominal pain and vaginal bleeding. She had mild lower abdominal pain for several days, but came to the hospital today after experiencing a small amount of vaginal bleeding this morning. At the last prenatal health checkup at 30 weeks and 5 days of gestation, nothing abnormal was noted. Pale bloody discharge was observed by vaginal examination at the time of hospitalization, and the cervix was closed. Abdominal ultrasound examination showed a normal fetal morphology with a cephalic presentation, an estimated fetal weight of 1,850 g, placenta attached to the uterine fundus, and an amniotic fluid index (AFI) of 18.0 cm. The fetal heart rate pattern (A) and transvaginal ultrasound image (B) are shown separately. Which of the following is an appropriate initial management for this patient? Select two.", "choices_en": ["Administration of antibiotics", "Administration of NSAIDs", "Administration of β2 stimulants", "Cervical cerclage surgery", "Adrenal cortex steroid administration"], "answer": ["c", "e"]}
{"problem_id": "113D65", "problem_text_en": "A 52-year-old man presents with a complaint of eyelid and neck swelling. He has noticed the swelling in both eyelids for a year, and swelling in both submandibular regions for the past six months. Recently, he visited the clinic because the swelling in his eyelids had been increasing and he also had nasal congestion. His body temperature is 36.5℃, pulse rate is 64/min, regular, and blood pressure is 110/76 mmHg. Swelling is observed in both eyelids and in the submandibular regions. The heart and respiratory sounds were normal. The abdomen is flat and soft, with no palpable liver or spleen, and there is no tenderness. Laboratory findings show erythrocyte count of 4.23 million/μL, hemoglobin level of 12.9 g/dL, hematocrit level of 37%, white blood cell count of 6,400/μL, and platelet count of 210,000/μL. Biochemical examination shows a blood urea nitrogen level of 13mg/dL, creatinine level of 0.5mg/dL, total protein level of 8.5g/dL, albumin level of 3.9g/dL, IgG level of 3,305 mg/dL (reference range: 960–1,960), IgA level of 159 mg/dL (reference range: 110–410), IgM level of 67mg/dL (reference range: 65-350), IgE level of 350 IU/mL (reference range: <250), total bilirubin level of 0.9mg/dL, AST level of 22IU/L, ALT level of 16IU/L, gamma-GTP level of 34 IU/L (reference range: 8-50), and amylase level of 122 U/L (reference range: 37-160). Results of the immunological serum examination show negative antinuclear antibodies and rheumatoid factor. An orbital CT and an abdominal contrast-enhanced CT are shown (A, B, and C). Which tests are useful for the diagnosis? Select two.", "choices_en": ["Liver biopsy", "Lacrimal gland biopsy", "Serum IgG4 measurement", "Percutaneous transhepatic cholangiography (PTC)", "Measurement of serum MPO-ANCA"], "answer": ["b", "c"]}
{"problem_id": "113D66", "problem_text_en": "A 20-year-old man is brought in by ambulance due to difficulty walking. He was found lying on the street and a passerby called for an ambulance. He has a JCS level of I-3, body temperature of 36.2°C, heart rate of 72 beats/minute, regular; blood pressure of 112/80 mmHg, respiratory rate of 16 breaths/minute, and SpO2 of 94% (room air). There are no abnormalities in heart sounds and breath sounds. He cannot stand up due to muscle weakness in his limbs. Blood biochemistry shows total protein 7.8 g/dL, albumin 3.8 g/dL, blood urea nitrogen 12 mg/dL, creatinine 1.1 mg/dL, Na 136 mEq/L, K 1.9 mEq/L, Cl 106 mEq/L, Ca 8.8 mg/dL, and P 2.5 mg/dL. Arterial blood gas analysis (room air) shows pH of 7.24, PaCO2 38 Torr, PaO2 88 Torr, and HCO3- 16.0 mEq/L. According to the family, the patient has a habit of inhaling thinner (an organic solvent containing toluene). Which of the following are possible consequences that may occur in the future? Select two.", "choices_en": ["Diarrhea", "Bile duct cancer", "Respiratory muscle paralysis", "Hyperactive tendon reflex", "Polymorphic ventricular tachycardia"], "answer": ["c", "e"]}
{"problem_id": "113D67", "problem_text_en": "A 52-year-old man complains of muscle weakness and difficulty climbing stairs without resting halfway since 3 months ago, so he visited a hospital. Blood tests showed positive anti-acetylcholine receptor antibodies. Chest X-ray (A) and contrast-enhanced chest CT (B) are shown separately. Which complications should be searched for in this patient? Select two.", "choices_en": ["Erythroblastosis fetalis", "Bronchial asthma", "Hyperuricemia", "Type 2 diabetes", "Hypogammaglobulinemia"], "answer": ["a", "e"]}
{"problem_id": "113D68", "problem_text_en": "A 60-year-old woman has had a low-grade fever in the high 37 °C range for a month and noticed a lump in her neck one week ago. Two days ago, erythema appeared on her back and anterior chest, and her fever spiked to the high 38 °C range. She became increasingly fatigued and unable to eat, so her family brought her to the hospital. Her mother died of a blood disorder at age 60. A peripheral blood smear stained with May-Giemsa is shown separately. Which of the following viruses is likely to be responsible for the disease this patient has? Select two.", "choices_en": ["Antiviral drugs are effective.", "Often caused by breastfeeding-related infections.", "It can be found during blood donation.", "If infected during pregnancy, there is a high chance of hearing loss in the child.", "If an infection is discovered during pregnancy, gamma globulin injection is administered after birth."], "answer": ["b", "c"]}
{"problem_id": "113D69", "problem_text_en": "A 62-year-old man complains of abdominal fullness and dark urine. He has been aware of abdominal discomfort and occasionally darker urine for a month. He drinks alcohol only occasionally and takes no medication. He is 169 cm tall and weighs 62 kg. His body temperature is 36.1℃, pulse rate 68 beats/min and regular, blood pressure 134/86 mmHg, and respiratory rate 14 breaths/min. No abnormalities are observed in the conjunctiva or eyeball. No abnormalities are detected in heart sounds or breath sounds. His abdomen is flat, soft, and non-tender, and the liver and spleen are not palpable. Urinalysis shows negative results for protein and glucose, small amount of urobilinogen, and positive results for occult blood. Blood test results show that he has 4.28 million red blood cells, hemoglobin level of 14.5 g/dL, hematocrit of 47%, 9,300 white blood cells, and 200,000 platelets. Blood biochemistry shows 4.0 g/dL albumin, 1.3 mg/dL total bilirubin, 0.9 mg/dL direct bilirubin, 98 U/L AST, 106 U/L ALT, 492 U/L ALP (reference range 115-359), 92 U/L γ-GTP (reference range 8-50), 58 U/L amylase (reference range 37-160), and 0.6 mg/dL creatinine. His CRP level is 1.1 mg/dL. An abdominal ultrasound examination shows no abnormalities. The upper gastrointestinal endoscopy image is shown separately. What should be done first? Select two.", "choices_en": ["Biopsy", "Administration of bile secretion agents", "Endoscopic papillotomy", "Percutaneous transhepatic biliary drainage", "Magnetic resonance cholangiopancreatography (MRCP)"], "answer": ["a", "e"]}
{"problem_id": "113D70", "problem_text_en": "A 78-year-old man presented with back pain, loss of appetite, and weight loss. He had occasionally experienced postprandial back pain for the past three months, but it recently became more frequent, sometimes causing continuous dull pain that prevented him from sleeping. His appetite had gradually diminished, and he had lost 7 kg over the past 6 months. He sought medical attention because he was unable to get up at times. He had no significant medical history, smoked 20 cigarettes per day for 40 years, drank two cups (180 mL each) of Japanese sake per day for 40 years, and lived with his 80-year-old wife. There was no significant family history. He was 168 cm tall and weighed 48 kg. His pulse was 72 bpm and regular, blood pressure was 126/60 mmHg, and respiration rate was 14 breaths/minute. Mild conjunctival pallor was observed, but there were no abnormalities in the ocular conjunctiva. An irregularly shaped, 3-cm tumor was palpable in the midline of his upper abdomen. Blood test results showed: red blood cell count 2.75 million, hemoglobin 7.8 g/dL, hematocrit 24%, white blood cell count 9,800, and platelets 140,000. Biochemical tests showed: total protein 5.2 g/dL, albumin 1.9 g/dL, total bilirubin 0.4 mg/dL, AST 34 U/L, ALT 40 U/L, γ-GTP 24 U/L (reference range 8 - 50), blood urea nitrogen 9 mg/dL, creatinine 0.4 mg/dL, total cholesterol 110 mg/dL, and triglycerides 48 mg/dL. CEA was 16.4 ng/mL (reference range <5) and CA19-9 was 580 U/mL (reference range <37). The CRP level was 2.0 mg/dL. A chest X-ray and chest CT revealed 1-cm tumors in two places in the right lung and one place in the left lung. Abdominal ultrasonography and CT showed a 3-cm tumor in the body of the pancreas, multiple tumor shadows measuring 1-2 cm in both liver lobes, and several gallstones measuring 5-8 mm in the gallbladder. Ascites was observed. What is the appropriate response at this time? Choose two.", "choices_en": ["Gastrostomy", "Surgical operation", "Nutrition therapy", "Administration of pain relievers", "Chemotherapy for cancer"], "answer": ["c", "d"]}
{"problem_id": "113D71", "problem_text_en": "A 21-year-old woman presents with a complaint of a vulvar lump. She noticed the lump on the vulva 2 months ago, and it has gradually increased in size, protruding from the skin. She experiences mild pruritus but no pain. Her menstrual cycle is regular with a 28-day cycle. There are no abnormalities observed in the uterus or ovaries. A photograph of the vulva is provided separately. Which of the following explanations to the patient are correct? Select two.", "choices_en": ["\"It is transmitted through sexual intercourse.\"", "\"You will experience strong pain in the future\"", "\"It spreads throughout the body through lymph nodes.\"", "\"Please apply a medication called Imiquimod.\"", "\"The cause is human papillomavirus (HPV) type 18\""], "answer": ["a", "d"]}
{"problem_id": "113D72", "problem_text_en": "A 50-year-old man presents with chest pain. He has been experiencing chest pain for the past 4 months, which has been gradually increasing in intensity. He has worked in shipbuilding industry from the age of 18 to the present. Malignant cells were detected in the pleural fluid, but the tissue type is unknown. Chest X-ray (A), chest contrast-enhanced CT (B), and PET/CT (C) are shown separately. Which of the following is the appropriate method to determine the tissue type? Select two.", "choices_en": ["Thoracoscopic biopsy", "Mediastinoscopy with biopsy", "CT-guided biopsy", "Bronchoscopic biopsy", "Upper gastrointestinal endoscopy with biopsy"], "answer": ["a", "c"]}
{"problem_id": "113D73", "problem_text_en": "A 44-year-old man is brought in by his wife who is concerned about his hyperactivity. He has complained of fatigue that does not go away for the past three months, and has had difficulty waking up in the morning, resulting in tardiness to work. Two weeks ago he suddenly became highly energetic without any particular cause, and says he doesn't feel fatigued at all even if he does not sleep at night. He talks rapidly and excessively, and changes subjects easily. His wife reports that he becomes irritable over trivial matters at home. He is conscious and alert, and there are no abnormalities in his physical examination. Which of the following is an appropriate treatment option? Select two.", "choices_en": ["Valproic acid", "Diazepam", "Lithium carbonate", "Imipramine", "Paroxetine"], "answer": ["a", "c"]}
{"problem_id": "113D74", "problem_text_en": "A 69-year-old woman was brought in by ambulance due to right leg pain. She had been experiencing fever of about 38°C for the past month and had taken over-the-counter cold medicine, but did not recover. One hour before admission today, she suddenly developed pain and discoloration in her right lower leg, so an ambulance was called. On admission, she was alert and oriented. Her body temperature was 37.6°C. Heart rate was 96 bpm and regular. Blood pressure was 152/70 mmHg. Respiratory rate was 20/min. Oxygen saturation was 98% on room air. A grade IV/VI systolic murmur was heard at the apex. No abnormal breath sounds were detected. The right femoral artery was not palpable, and the sensation in the right lower leg was diminished. The right lower leg had a paler color compared to the left. Blood tests showed a red blood cell count of 4.37 million/μL, Hb of 12.5 g/dL, Hct of 37%, WBC count of 21,700/μL, platelets of 70,000/μL, plasma fibrinogen of 422 mg/dL (reference range: 200-400), and D-dimer of 4.2 μg/mL (reference value: <1.0). Blood chemistry showed AST of 16 U/L, ALT of 22 U/L, CK of 222 U/L (reference range: 30-140), LD of 357 U/L (reference range: 176-353), and CRP of 24 mg/dL. A pelvic CT scan showed occlusion of the right femoral artery. Which examinations/tests should be conducted to identify the cause? Select two.", "choices_en": ["Blood culture", "Lumbar puncture", "Lumbar spine MRI", "Lower extremity venography", "Echocardiogram"], "answer": ["a", "e"]}
{"problem_id": "113D75", "problem_text_en": "An 83-year-old female patient presented with general malaise. She had been diagnosed with hypertension and osteoporosis and was receiving treatment with a thiazide diuretic and an oral active vitamin D3 supplement at a local clinic near her home. She had been prescribed NSAIDs for low back pain that started a month ago, and the pain was so severe during sitting or walking that she had been mostly bedridden during the day too. She had also lost her appetite for the past two weeks, eating only a small amount of food twice a day, and drinking only 2-3 cups of tea a day using a small teacup. Three days ago, she developed a worsening of general malaise, and was brought to the hospital for evaluation. She has not had a bowel movement for four days, but her urine output was unchanged with 5 times during the day and 2 times during the night. She was alert and oriented, and her height was 152 cm, and weight was 41 kg (down from 45 kg a month ago). Her body temperature measured 36.2°C. Her pulse was 108 beats/min and regular, and her blood pressure was 152/86 mmHg. A urine test revealed a specific gravity of 1.008, protein (±), glucose (-), occult blood 1+, and microscopic examination showed 1-4 RBCs/HPF, 1-4 WBCs/HPF, and bacteria (±). A blood test showed a hemoglobin level of 15.2 g/dL, hematocrit of 45%, and platelet count of 210,000/mm3, RBC count of 4.5 million/mm3, and WBC count of 6,800/mm3. Her serum chemistry panel showed a total protein level of 7.2 g/dL, albumin of 3.9 g/dL, aspartate aminotransferase (AST) of 22 IU/L, alanine aminotransferase (ALT) of 18 IU/L, lactate dehydrogenase (LD) of 250 IU/L (normal range, 176 to 353), and creatine kinase (CK) of 152 IU/L (normal range, 30 to 140). Other laboratory findings included a BUN level of 52 mg/dL, creatinine level of 2.8 mg/dL, eGFR of 13 mL/min/1.73 m2, sodium level of 135 mEq/L, potassium level of 4.0 mEq/L, and chloride level of 102 mEq/L. The CRP level was 0.1 mg/dL. What are the three possible causes of her renal impairment?", "choices_en": ["Dehydration", "Nonsteroidal anti-inflammatory drugs", "Urinary tract infection", "Rhabdomyolysis", "Hypercalcemia"], "answer": ["a", "b", "e"]}
