{"problem_id": "113E1", "problem_text_en": "Which of the following violates medical professional ethics?", "choices_en": ["Advise against inappropriate medical practices of other physicians.", "Responding to the patient's request for a second opinion.", "To post certified specialist qualifications on a website.", "Viewing the electronic medical records of a patient who is not related to your own duties.", "To explain the patient's medical condition and treatment to their legal guardian, on behalf of the incapacitated patient."], "answer": ["d"]}
{"problem_id": "113E2", "problem_text_en": "Which of the following statements about the social security system is correct?", "choices_en": ["The preservation period of medical records is 2 years from the end of treatment.", "The number of insured people in the National Health Insurance Association is more than 60 million.", "National medical expenses tripled during the 10 years from 2005.", "The number of insured persons under long-term care insurance Plan 1 is greater than Plan 2.", "The public cost burden for tuberculosis patients' medical expenses is stipulated by the Infectious Diseases Control Law."], "answer": ["e"]}
{"problem_id": "113E3", "problem_text_en": "Which step in evaluating the effectiveness and safety of pharmaceutical products is conducted during the final stage before manufacturing and sale?", "choices_en": ["Phase I clinical trial", "Phase II trial", "Phase III trial", "Phase IV clinical trial", "Non-clinical trial"], "answer": ["c"]}
{"problem_id": "113E4", "problem_text_en": "Which of the following statements is correct regarding medical safety?", "choices_en": ["If medical professionals act without negligence, accidents will not happen.", "Hospitals with fewer reported \"near-miss\" incidents have fewer accidents.", "The number of accidents increases when multiple healthcare providers check medical procedures.", "Holding medical personnel accountable for causing accidents is essential for preventing recurrence.", "Good communication among medical practitioners is useful for accident prevention."], "answer": ["e"]}
{"problem_id": "113E5", "problem_text_en": "Which of the following statements about physiological changes in the mother during pregnancy is correct?", "choices_en": ["Blood pressure will rise.", "The circulating blood volume decreases.", "Functional residual capacity decreases.", "Peripheral blood leukocyte count decreases.", "Insulin sensitivity increases."], "answer": ["c"]}
{"problem_id": "113E6", "problem_text_en": "Which of the following is involved in the decrease in the focusing ability of the eyes due to aging?", "choices_en": ["Cornea", "Iris.", "Crystalline lens", "Vitreous body", "Retina"], "answer": ["c"]}
{"problem_id": "113E7", "problem_text_en": "Based on the communication tool SBAR (Situation, Background, Assessment, Recommendation), a resident is reporting a patient's condition to a supervising physician. \n\nResident: \"I would like to report and discuss my patient's condition.\" \nSupervising physician: \"Please go ahead.\" \nResident: \"The patient is a 78-year-old female who underwent surgery for a femoral neck fracture yesterday and is currently receiving maintenance fluid. Since early this morning she has complained of shortness of breath.\" \nSupervising physician: \"How is the patient doing?\" \nResident: \"The SpO2 is 92% on room air, and coarse crackles are heard bilaterally. I suspect the possibility of heart failure. I think we should start oxygen therapy first.\" \nSupervising physician: \"Okay. Let's confirm the patient's condition together now.\" \n\nWhat corresponds to \"R\" in SBAR is which of the underlined sections?", "choices_en": ["① - This is actually not a word that can be translated. In Japanese, Arabic numerals are commonly used in place of some words or phrases, as they are in many other languages. In an exam context, ① might indicate the first option or choice in a list, but without more context it is impossible to give a precise translation.", "Unfortunately, ② cannot be translated without further context. It is likely a numerical choice in a multiple-choice question, but without knowing the options or the question prompt, it's impossible to provide an accurate translation.", "Without additional context, it is not possible to provide an accurate translation for \"③.\" It appears to be a numerical label for a choice in a multiple-choice question, and could refer to any number of options.", "Without context, it is impossible to provide an accurate translation for this choice. The number \"④\" alone does not have a specific meaning or translation.", "Sorry, I cannot translate this choice without context. It is just a number (5). Please provide more information or context related to this choice."], "answer": ["d"]}
{"problem_id": "113E8", "problem_text_en": "Which of the following combinations of auscultatory findings and respiratory diseases is incorrect?", "choices_en": ["stridor - pulmonary sarcoidosis", "wheezes --------- Asthma (the definition or explanation may be present in the previous question or context)", "Friction rub - Tuberculous pleurisy", "fine crackles --------- interstitial pneumonia", "coarse crackles - bacterial pneumonia"], "answer": ["a"]}
{"problem_id": "113E9", "problem_text_en": "What kind of thought disturbances are observed in bipolar disorder?", "choices_en": ["Conjunctival relaxation", "Disintegrative thinking", "Thought interruption / Ceased thinking", "Neologism", "Flight of ideas"], "answer": ["e"]}
{"problem_id": "113E10", "problem_text_en": "Which of the following is correct about the principles of drug therapy during pregnancy?", "choices_en": ["Avoid polypharmacy as much as possible.", "NSAIDs can be administered during the latter half of pregnancy.", "Quinolone antibiotics are recommended as antibacterial agents.", "Stop taking currently prescribed medications once pregnancy is confirmed.", "The possibility of drug-induced teratogenicity is high in less than 4 weeks of pregnancy."], "answer": ["a"]}
{"problem_id": "113E11", "problem_text_en": "Which of the following expressions is appropriate to show empathy for a patient with chronic pain?", "choices_en": ["\"That pain must be tough.\"", "\"If the pain can be tolerated, it's okay.\"", "\"Accepting pain is important\"", "\"I have stronger pain.\"", "\"This level of pain is something that often happens.\""], "answer": ["a"]}
{"problem_id": "113E12", "problem_text_en": "The vital signs of a patient suspected of having an infection are shown as follows: Consciousness level-GCS 15. Body temperature-39.2 °C. Pulse rate-112/minute, regular. Blood pressure of 92/50 mmHg. Respiratory rate-26/minute. What is the quick SOFA (Sequential Organ Failure Assessment) score?", "choices_en": ["0 points", "1 point", "2 points.", "3 points", "Four points"], "answer": ["c"]}
{"problem_id": "113E13", "problem_text_en": "Which of the following causes paradoxical splitting of the second heart sound?", "choices_en": ["Patent ductus arteriosus (PDA)", "Pulmonary valve stenosis", "Ventricular septal defect", "Atrial septal defect", "Complete left bundle branch block"], "answer": ["e"]}
{"problem_id": "113E14", "problem_text_en": "Which of the following is not observed in patients with liver cirrhosis associated with severe portal hypertension?", "choices_en": ["Swelling of the lower leg", "Rovsing's sign/syndrome", "Dilation of the abdominal wall veins", "The dullness of Traube's space", "Shifting dullness in the percussion of the abdomen"], "answer": ["b"]}
{"problem_id": "113E15", "problem_text_en": "Which of the following is used for the screening of scoliosis by observing the trunk while the patient bends forward?", "choices_en": ["Back muscle strength", "Costal hump (also known as rib hump)", "Respiratory distress", "Flexibility of the spine", "Radiating pain to the lower extremities"], "answer": ["b"]}
{"problem_id": "113E16", "problem_text_en": "What is the most important patient background to pay attention to when using gadolinium contrast agents in MRI?", "choices_en": ["Cerebrovascular accident (commonly known as stroke)", "Atrial fibrillation", "Interstitial pneumonia", "Increased intracranial pressure syndrome", "Chronic renal failure during hemodialysis"], "answer": ["e"]}
{"problem_id": "113E17", "problem_text_en": "Which of the following decreases the sensitivity of blood culture for diagnosing sepsis?", "choices_en": ["Store the specimen under refrigeration.", "Increase the number of specimen collections.", "To be collected before administering antimicrobial agents.", "Collect two sets from different sites.", "Inoculate the anaerobic bottle before the aerobic bottle."], "answer": ["a"]}
{"problem_id": "113E18", "problem_text_en": "What are the initial symptoms associated with congested nipples (engorged nipples)?", "choices_en": ["Eye pain", "Headache", "Eyestrain", "Visual impairment", "Concentric visual field narrowing"], "answer": ["b"]}
{"problem_id": "113E19", "problem_text_en": "What is a characteristic symptom that patients with social anxiety disorder typically present with?", "choices_en": ["\"I can't board the plane because I'm scared.\"", "\"Hated by society\"", "\"Something terrible could happen tomorrow.\"", "\"I feel anxious when going to crowded public places.\"", "\"I get nervous in front of people and cannot speak as I intend to.\""], "answer": ["e"]}
{"problem_id": "113E20", "problem_text_en": "Which of the following statements is true regarding minimal change nephrotic syndrome?", "choices_en": ["Adrenal cortex steroids are significantly effective.", "Recurrence is rare.", "The selectivity of urinary protein is low.", "The presence of hypocomplementemia.", "Slowly developing."], "answer": ["a"]}
{"problem_id": "113E21", "problem_text_en": "Which of the following is least likely after one hour of initiating a blood transfusion, when symptoms of fever, chills, and difficulty breathing appear along with decreased blood pressure?", "choices_en": ["Transfusion-related acute lung injury (TRALI)", "Hemolysis due to mismatched blood transfusion", "Endotoxin shock", "Anaphylactic shock", "Graft-versus-host disease (GVHD) after transfusion"], "answer": ["e"]}
{"problem_id": "113E22", "problem_text_en": "Which of the following is unlikely to be considered in an adult patient with vascular murmur in the neck?", "choices_en": ["Carotid artery stenosis", "Hypothyroidism", "Takayasu arteritis (a type of vasculitis also known as aortic arch syndrome)", "Arteriovenous fistula", "Anemia"], "answer": ["b"]}
{"problem_id": "113E23", "problem_text_en": "A tracheal intubation was performed on an adult patient who developed acute respiratory failure following bag-valve-mask ventilation. Manual ventilation was performed, and the position of the tracheal tube was confirmed by auscultation, but the epigastric area began to bulge. There was no detection of CO2 on the CO2 detector that was attached. What is the appropriate response?", "choices_en": ["Immediately remove the tracheal tube.", "Add more air to the balloon cuff.", "Continue supplying air to the tracheal tube for 2 minutes.", "Insert the tracheal tube another 3cm and provide ventilation.", "Insert a catheter into the tracheal tube and suction."], "answer": ["a"]}
{"problem_id": "113E24", "problem_text_en": "Which of the following is not an appropriate behavior to reduce the risk of coronary artery disease?", "choices_en": ["Smoking cessation", "Salt reduction", "Increase in vegetable intake.", "Avoidance of long working hours", "Increase in trans fatty acid intake"], "answer": ["e"]}
{"problem_id": "113E25", "problem_text_en": "What is the important potential complication in women who experience prolonged amenorrhea?", "choices_en": ["Hyperpigmentation", "Osteoporosis", "Endometriosis", "Peripheral neuropathy", "Premenstrual syndrome (PMS)"], "answer": ["b"]}
{"problem_id": "113E26", "problem_text_en": "Which of the following statements regarding grief reactions following the death of a loved one is incorrect?", "choices_en": ["It is a reaction specific to adults.", "Most of them will recover with time.", "The care provided is called grief care.", "Not only psychological but also physical effects occur.", "If it becomes prolonged, it will be necessary to differentiate it from depression."], "answer": ["a"]}
{"problem_id": "113E27", "problem_text_en": "A 15-year-old male patient and his mother visit the clinic with the chief complaint of school refusal. He is a third-year junior high school student preparing for high school entrance exams. For the past two months, he has been unable to wake up in the morning and has not been going to school. He complains of headaches, abdominal pain, etc. in the morning, and stays in bed, but becomes energetic and spends late nights playing games or studying from evening to the early morning. He was advised by the school to see a medical institution to confirm the possibility of illness. His mother emotionally asserts that \"he hates studying and is skipping school. He just plays games and stays up all night, so he cannot get up in the morning.\" The patient is silent and looking down. Which of the following is the most appropriate initial step that should be taken?", "choices_en": ["Encourage the patient to attend school.", "Listen to the patient's story.", "Prescribing sleeping pills to the patient.", "Prescribe an antianxiety medication to the mother.", "Pay close attention to the mother's response."], "answer": ["b"]}
{"problem_id": "113E28", "problem_text_en": "Which of the following is not an appropriate explanation to be given to a 50-year-old male patient who is undergoing treatment for pulmonary adenocarcinoma? The patient presented with coughing one year ago, and six months ago was diagnosed with unresectable stage III lung adenocarcinoma. He underwent standard treatment with radiation therapy and chemotherapy for cancer. There is no indication of new metastases, but the tumor size has increased, and the patient is being proposed as a candidate for a clinical trial.\n\n(Note: The options for the question are not provided, so I cannot provide a complete answer.)", "choices_en": ["\"It's okay even if you discuss it with your family\".", "\"Consent cannot be revoked midway\"", "\"It is up to you whether you participate or not\"", "\"Please participate only after fully understanding and agreeing\"", "\"There will be no disadvantage even if you do not participate.\""], "answer": ["b"]}
{"problem_id": "113E29", "problem_text_en": "A 70-year-old man was admitted for evaluation of abnormal chest shadows. A chest X-ray taken by his primary care physician showed a tumor-like lesion in the right lung, which was suspected to be malignant, so he was referred for further evaluation and admitted. He has been experiencing a shuffling gait and frequent falls for the past 2 years. He is alert and oriented. His pulse is 60 bpm, regular. His blood pressure is 126/78 mmHg. Heart and breath sounds are normal. Neurological examination shows bilateral tremors, rigidity, and bradykinesia, but postural reflexes are preserved and he is classified as stage II on the Hoehn and Yahr scale. His revised Hasegawa Dementia Scale score is 26 out of 30. What is the appropriate strategy for fall prevention upon admission?", "choices_en": ["Using sleeping pills during the day.", "Perform physical restraint on the bed.", "To lock the door of the patient's room from outside.", "Install a bed exit sensor around the bed.", "Requiring family members to accompany the patient throughout the hospitalization period."], "answer": ["d"]}
{"problem_id": "113E30", "problem_text_en": "A 78-year-old woman presented with a complaint of a rash all over her body. She had developed pruritic rashes on both thighs three weeks prior that had spread to her trunk and limbs, prompting her to seek medical attention. Direct immunofluorescence of a biopsy sample revealed linear deposition of IgG and C3 in the epidermal basement membrane zone. Her anti-BP180 antibody level was 421 U/mL (reference range <9.0). A photo of her thighs is shown separately. Which of the following is not observed?", "choices_en": ["Hemorrhagic blisters", "Erythema.", "Blisters", "Cyst", "Ulcer"], "answer": ["d"]}
{"problem_id": "113E31", "problem_text_en": "A 66-year-old man was transferred to the hospital by ambulance due to decreased consciousness level and seizures. He had been taking antiepileptic medication for post-traumatic epilepsy for three years. As he had not had any seizures for the past year, he stopped taking medication two weeks ago. However, he suddenly had a tonic-clonic seizure while he was out, and someone nearby called the ambulance. When the ambulance arrived ten minutes after the onset, he had some myoclonic seizures but they disappeared during transportation. On arrival at the hospital, he was not seizing, and his consciousness level was JCS I-3. His body temperature was 36.9℃, heart rate was 92 beats per minute and his blood pressure was 140/90 mmHg. His respiratory rate was 16 breaths per minute, and his SpO2 was 99% (via an oxygen mask at 6 L/min). After confirming vital signs and securing an intravenous line for fluid administration, he had another tonic-clonic seizure. What should be administered immediately?", "choices_en": ["Morphine", "Diazepam", "Pentazocine", "Sodium bicarbonate", "Calcium gluconate"], "answer": ["b"]}
{"problem_id": "113E32", "problem_text_en": "A multiple collision accident, including a large bus, has resulted in numerous casualties. The accompanying physician of the emergency team is tasked with determining the priority order for transporting the rescued casualties to the medical center. There are already around 30 wounded on the scene, and rescue operations are ongoing. Information suggests that there are insufficient medical resources at the triage center. Which of the following casualties should be given the highest priority for transportation to the triage center?", "choices_en": ["Unable to walk and has a respiratory rate of 36/minute.", "Can walk, but bleeding from the head.", "Can walk but complains of severe abdominal pain.", "The patient can walk, but there is an open fracture at the elbow joint and contamination of the wound.", "There is an open brain injury, and although a manual airway was established, no breathing was detected."], "answer": ["a"]}
{"problem_id": "113E33", "problem_text_en": "A 38-year-old nulliparous woman (G1P0) presented to the hospital complaining of epigastric pain and nausea at 34 weeks of gestation. There was no notable medical history, and no abnormalities were found during previous prenatal check-ups. She perceived fetal movement, and there was no genital bleeding. Her temperature was 36.5°C, blood pressure was 140/90 mmHg, and pulse rate was 100 beats per minute and regular. She had tenderness in the epigastric area and edema in her lower legs. Which of the following tests has a lower priority?", "choices_en": ["Blood test", "Blood biochemical test", "Abdominal ultrasound examination", "Upper gastrointestinal endoscopy", "Non-Stress Test (NST)"], "answer": ["d"]}
{"problem_id": "113E34", "problem_text_en": "A 35-year-old man was found collapsed on the streets and brought in by an ambulance. He has a JCS level of II-30, a body temperature of 36.0°C, a heart rate of 104 beats/minute, regular rhythm, blood pressure of 156/88 mmHg, and a respiratory rate of 16/minute. His SpO2 is 99% (with a mask and 5 liters/minute of oxygen). His pupillary light reflex is normal and there are no apparent external injuries on his moist skin. What is the first test that should be performed?", "choices_en": ["Blood glucose measurement", "Head plain CT scan", "Arterial blood gas analysis", "Chest X-ray imaging", "Urine drug screening"], "answer": ["a"]}
{"problem_id": "113E35", "problem_text_en": "A 62-year-old woman presents with dizziness. She experienced a sudden spinning sensation when she woke up this morning. After lying down for a while, the dizziness subsided in about 2 minutes. She did not feel deafness or tinnitus. In the afternoon, she looked up to hang laundry and experienced the same dizziness again. She had mild nausea, but the symptoms disappeared after about 1 minute of rest. There is no significant medical or family history. She is conscious and alert, with no abnormal vital signs or neurological examination findings. Laboratory tests show no abnormalities. What is the affected site?", "choices_en": ["Cochlea", "Semicircular canal", "Internal auditory canal", "Lymphatic cyst", "Vestibular cortex"], "answer": ["b"]}
{"problem_id": "113E36", "problem_text_en": "A 69-year-old man presented with a complaint of difficult urination. He had noticed a narrow urinary stream for the past 2 years but had attributed it to his age. He came for a medical checkup because he has had difficulty urinating for the past 3 months. Digital rectal examination revealed a slightly enlarged prostate gland that was smooth-surfaced and elastically firm with no nodules. Urinalysis and blood chemistry did not show any abnormalities. PSA was 1.8 ng/mL (normal range: less than 4.0 ng/mL). Abdominal ultrasound examination revealed a prostate volume of 40 mL. The residual urine volume was 100 mL. Which is the appropriate medication for the patient?", "choices_en": ["α1 blocker", "Angiotensin-converting enzyme (ACE) inhibitor", "Calcium channel blockers", "Anticholinergic drug", "β3 agonist"], "answer": ["a"]}
{"problem_id": "113E37", "problem_text_en": "A 4-year-old boy is brought to the hospital by his mother who is worried about his recurrent vomiting. He has been experiencing sudden vomiting occasionally after waking up for a month. Vomiting occurs every day after waking up for the past week, and he was brought to the hospital today because his response to calls got somewhat dull. He has no diarrhea or weight loss. He seems to fall over more easily as vomiting increases. His consciousness level is JCS I-1. His body temperature is 36.7℃. His heart rate is 100 bpm and regular. His blood pressure is 80/50 mmHg. His respiratory rate is 36 breaths/min. His SpO2 is 98% on room air, and his capillary refill time is less than 2 seconds. There are no abnormal heart or lung sounds. His abdomen is flat, soft, and there is no palpable liver or spleen. There are no abnormal bowel sounds or tendon reflexes. He shows trunk ataxia in the sitting position. He has poor finger-to-nose performance with nystagmus and dysmetria. Examination of the fundus with an ophthalmoscope shows bilateral congested optic discs. What is the most appropriate test to perform next?", "choices_en": ["Brain waves", "Lumbar puncture", "Blood culture", "Head plain CT scan", "Abdominal plain X-ray"], "answer": ["d"]}
{"problem_id": "113E38", "problem_text_en": "A 16-year-old female was found to have positive urine occult blood on a health check and came to the clinic. Urinalysis at the time of visit showed: yellow-brown and mildly turbid in appearance, specific gravity of 1.020, pH of 8.0, protein (±), glucose (-), occult blood (±), sediment showing <1/red blood cell per high power field, 5-9/white blood cells per high power field, 5-9/squamous epithelial cells per high power field, and 1-4/hyaline casts per whole field. Which of the following is the correct evaluation of the urinalysis?", "choices_en": ["There is no pus or urine.", "There is no hematuria.", "It is a dilute urine.", "The urine is acidic.", "There is a pathological cylinder."], "answer": ["b"]}
{"problem_id": "113E39", "problem_text_en": "A 66-year-old man has been undergoing treatment for prostate cancer for 5 years. Six months ago, metastasis was confirmed in the lumbar spine and right rib, and he has recently become aware of lower back pain. He has no other symptoms except for the pain. What should be the first medication given for pain relief?", "choices_en": ["Codeine", "Morphine", "Fentanyl", "Oxycodone", "Acetaminophen"], "answer": ["e"]}
{"problem_id": "113E40", "problem_text_en": "A 45-year-old man has been experiencing fatigue and shortness of breath for the past 3 months. He noticed a lump in his neck and became concerned, so he went to see a doctor. He has no significant medical or family history, works as an office worker, and lives with his wife and two children. After examination, he was diagnosed with malignant lymphoma and determined to need anticancer chemotherapy. The patient said, \"I recently changed jobs and am very anxious about my future job and relationship with the company, so I would like to consult about the support system available.\" It was decided to request the presence of other staff members during the explanation to the patient. Which of the following is the most appropriate person to be present as an observer?\n\n(Note: The selection of an observer is context-dependent and requires knowledge of the positions of the staff members, their roles and qualifications, and the ethical and legal standards of the medical institution. Therefore, the specific answer cannot be provided without more information.)", "choices_en": ["Nurse", "Pharmacist", "Clerical staff", "Colleague physician", "Medical social worker"], "answer": ["e"]}
{"problem_id": "113E41", "problem_text_en": "A 63-year-old woman, who cannot speak Japanese, was brought in by an ambulance to the emergency department in the early afternoon at the end of July. Her spouse, who is also a foreigner, accompanied her in the ambulance and provided her medical history and presenting symptoms to a foreign resident physician at the hospital. The medical record notes that the patient felt faint while walking on the beach. She then sat under a shade where she vomited. She complained of headache and dizziness before fainting. Her face turned red and her breathing became rapid. Physical examination revealed that her body temperature was 39.2℃, her conscious level was a Glasgow Coma Scale E3 V4 M5, her skin was generally hot, flushed and dry, her heart rate was 140/min and regular, her blood pressure was 86/60 mmHg and her respiratory rate was 24/min and shallow. There was no hemiplegia, and muscle spasms were present in the limbs. What should be done first?", "choices_en": ["Chest computed tomography (CT) scan", "Body cooling", "口からの水分摂取 (Kuchi kara no suibun setchi)", "Tracheal intubation", "抗生物質静脈内投与"], "answer": ["b"]}
{"problem_id": "113E42", "problem_text_en": "Read the following passage and answer questions 42 and 43. \n\nA 81-year-old female patient presented to the clinic with fatigue and loss of appetite. Medical history: She was diagnosed with cervical cancer 4 years ago and received radiation therapy, but it recurred 1 year ago. She had been on observation without additional treatment at the patient's request. Three months ago, she began experiencing genital bleeding and loss of appetite. In addition, she had anal pain and was taking opioids. She gradually became unable to perform daily activities over the past month. Although she was able to transfer to a portable toilet with support, she has been in a state of diaper defecation as she became too dizzy to move. She has severe fatigue and low appetite, with consumption limited to water only. She has nausea, but no vomiting. Life history: She has no smoking history, and drinks alcohol occasionally. She lives with her husband (84 years old). Family history: Nothing specific to note. \n\nCurrent status: She is conscious and mentally alert. She is 153 cm in height and weighs 42 kg. Her body temperature is 36.5℃, heart rate is 92 beats/min and regular, blood pressure is 128/76 mmHg, and respiratory rate is 16 breaths/min. SpO2 is 98% on room air. She has mild anemia in the palpebral conjunctiva and no icterus in the ocular conjunctiva. Nothing abnormal was found in her mouth. No jugular vein distention. Nothing abnormal was found in heart and lung sounds. Her abdomen is flat, soft, and her liver and spleen cannot be palpated. She has moderate indentation edema in both lower legs. Laboratory findings: Urinalysis could not be assessed because she had diaper defecation. Blood tests revealed that she had 3.48 million red blood cells/μL, 10.4 g/dL hemoglobin, 32% hematocrit, 8,800 white blood cells/μL, and 210,000 platelets/μL. Blood chemistry tests revealed that she had a total protein of 6.3 g/dL, albumin of 2.0 g/dL, total bilirubin of 0.6 mg/dL, AST of 13 U/L, ALT of 9 U/L, LD of 182 U/L (reference range: 176–353), γ-GTP of 12 U/L (reference range: 8–50), CK of 42 U/L (reference range: 30–140), 86 mg/dL urea nitrogen, 6.1 mg/dL creatinine, 10.7 mg/dL uric acid, 104 mg/dL glucose, 131 mEq/L sodium, 5.3 mEq/L potassium, 101 mEq/L chlorine, and 7.6 mg/dL calcium. No abnormalities were found by electrocardiogram, and chest X-ray showed a cardio-thoracic ratio of 53%. What should be done next? \n\n(Note: The questions referred to in the prompt are not visible to me, kindly provide me with the same so that I can answer them for you.)", "choices_en": ["Cystoscopy examination", "Rapid and massive fluid infusion", "Excretory urography", "Abdominal ultrasonography (ultrasound examination of the abdomen)", "Rectal administration of potassium-binding resin"], "answer": ["d"]}
{"problem_id": "113E43", "problem_text_en": "After hospitalization and treatment, the renal dysfunction improved, but due to the progression of the underlying disease, the patient became bedridden all day and requires assistance with almost all activities of daily living. The patient and family wish to use the long-term care insurance. Which of the following explanations is correct when preparing for discharge?", "choices_en": ["\"You can receive insurance benefits according to the required level of certified caregiving services\"", "\"Application procedures can be handled by the prefectural representative.\"", "\"Visiting nurse services cannot be utilized under the long-term care insurance system.\"", "\"During hospitalization, applying for long-term care insurance is not possible.\"", "\"The installation of handrails is not covered by long-term care insurance.\""], "answer": ["a"]}
{"problem_id": "113E44", "problem_text_en": "Read the following passage and answer questions 44 and 45.\n\nA 46-year-old woman presents to the emergency department with abdominal pain. She reports that she has had mild epigastric pain since waking up 2 days ago. She ate breakfast as usual but developed decreased appetite and nausea, eventually vomiting after lunch yesterday. Today, the epigastric pain has resolved but she has developed right lower quadrant pain. She reports that the pain is not worsened with eating but is worsened with walking and is persistent. She denies fever, chills, diarrhea, melena, hematochezia, dysuria, and hematuria. Three days ago, she attended a barbecue, but none of her friends or family have similar symptoms. She has a history of Chlamydia infection when she was 20 years old, and she smokes 20 cigarettes daily for 26 years and drinks 350 mL of beer daily. She began menstruating at age 13 years with regular, 28-day cycles, and no abnormal vaginal bleeding. Her last menstrual period was 2 weeks ago. Which of the following would be an appropriate approach for a resident physician to take when conducting an abdominal examination?\n\n44. 診察の前に患者に効果と問題点を説明する必要があるかどうかを確認する。\n45. 患者に少なくとも2分間の自由記述式の症状報告を求める。 \n\n44. Should the patient be informed about the benefits and drawbacks before the examination?\n45. Should the patient be asked for free-form symptom reporting of at least two minutes? \n\n(Note: These translations are not direct translations of each sentence, but a summary of their meaning in English)", "choices_en": ["\"We will conduct abdominal examination over your clothes\"", "\"Let's have you examined by a gynecologist first.\"", "\"You will receive a CT scan of your abdomen before the examination.\"", "\"May I begin examining the abdomen by myself first?\"", "\"I will palpate from where your abdomen hurts, please show me where it hurts.\""], "answer": ["d"]}
{"problem_id": "113E45", "problem_text_en": "Present condition: Consciousness is clear. Height 154 cm, weight 65 kg. Body temperature is 37.6℃. Pulse rate is 92 beats per minute, regular. Blood pressure is 110/62 mmHg. Respiratory rate is 18 per minute. SpO2 is 99% (room air). There are no abnormalities in the eyelid conjunctiva or eyeball conjunctiva. The abdomen is flat and the liver and spleen are not palpable. There is tenderness at the McBurney point and rebound tenderness is observed. Psoas sign is negative. Medical findings: Urinalysis: Normal. Blood test: Red blood cells 3.94 million, Hemoglobin 11.5 g/dL, Hematocrit 36%, White blood cells 5,300 (Neutrophils 6%, Band neutrophils 56%, Monocytes 10%, Lymphocytes 28%), Platelets 300,000. Blood biochemistry test: Blood urea nitrogen 12 mg/dL, Creatinine 0.6 mg/dL, Blood glucose 86 mg/dL, Sodium 139 mEq/L, Potassium 3.9 mEq/L, Chloride 105 mEq/L. CRP is 4.0 mg/dL. Pregnancy test negative. No abnormalities found in ECG, chest X-ray, and abdominal X-ray. Alvarado score is used to diagnose acute appendicitis. Sensitivity and specificity by score are shown below: \n\nItem Score\nMigration of pain to the right lower abdomen\n1 point\nLoss of appetite\n1 point\nNausea\n1 point\nTenderness over right lower abdomen\n2 points\nRebound tenderness\n1 point\nFever above 37.3°C\n1 point\nWhite blood cell count above 10,000\n1 point\nShift to the left in white blood cells (neutrophils ≧75%)\n1 point\n\nAlvarado score = Total points\n\nTotal points\nSensitivity\nSpecificity\n\n\n4 points\n98%\n30%\n\n\n7 points\n70%\n70%\n\n\n9 points\n30%\n95%\n\nWhich interpretation is correct?", "choices_en": ["It is possible to make a definitive diagnosis of appendicitis at this point.", "The sensitivity and specificity of this diagnostic criterion are influenced by the prevalence of the disease.", "Additional tests are necessary for the definitive diagnosis of appendicitis.", "The higher the Alvarado score, the lower the severity of appendicitis.", "The lower the Alvarado score, the more suitable it is for a definitive diagnosis."], "answer": ["c"]}
{"problem_id": "113E46", "problem_text_en": "Read the following passage and answer questions 46 and 47.\n\nA 72-year-old man presents with left leg pain. Present illness: He has had bilateral leg pain in the calves for the past two years when walking about 500 meters. The symptoms have progressed and he now experiences the pain after walking only 100 meters. The pain is relieved when he stops to rest, but he experiences coldness and numbness in his toes afterward. Yesterday, he suddenly experienced pain in his left toe while at rest and presented to the clinic. Past history: The patient has been treated for hypertension and dyslipidemia at a medical facility for the past 15 years. He was on medication for a while but has not received regular medical care since his retirement at 60 years old. Personal history: He lives with his wife and is independent in activities of daily living, including eating, excretion, and changing clothes. He has smoked 20 cigarettes per day for 43 years and drinks only on occasion. Current status: The patient is mentally alert. His height is 168 cm, and his weight is 75 kg. His body temperature is 36.3°C. His pulse rate is 76 bpm, regular. His blood pressure is 156/88 mmHg in the right upper extremity. His respiratory rate is 20 breaths per minute. His SpO2 is 98% on room air. No vascular murmurs are heard in the neck or thorax/abdomen. Heart and lung sounds are normal. His abdomen is flat and soft, and the liver and spleen are not palpable. There is no color change in his right foot, but his left foot appears a dark red color. His posterior tibial artery is palpable on the right but not on the left. His brachial blood pressure and ankle-blood pressure indices (ABI) were measured in the outpatient clinic. Which of the following blood pressure measurements is most likely for this patient? \n\nUpper limb blood pressure\nLower limb blood pressure\n\nRight\nLeft\nRight\nLeft\n\na. 156\nb. 158\nc. 162\nd. 136\ne. 110\n\n(Unit: mmHg)", "choices_en": ["Without context, the translation of \"ａ\" is unclear. It could be an abbreviation, symbol, or variable in a mathematical equation. Without further information, it cannot be translated accurately.", "It's not possible to accurately translate \"ｂ\" without additional context. It could represent anything.", "Unfortunately, the choice you provided seems incomplete or is missing. Could you please provide the full choice so I can translate it accurately?", "I'm sorry, but \"ｄ\" on its own does not provide enough context for me to accurately translate it. Could you please provide more information or the full question?", "Sorry, \"e\" by itself does not provide enough context for me to give a proper translation. Could you please provide more information or the full question?"], "answer": ["e"]}
{"problem_id": "113E47", "problem_text_en": "The patient underwent percutaneous angioplasty and antiplatelet therapy was initiated. The patient’s pain and cold sensation disappeared and they began walking training. On the third day after the surgery, a hospital team was formed to plan the treatment and discharge. In addition to a physician, nurse, and pharmacist, which of the following is an appropriate team member?", "choices_en": ["Physical therapist", "Speech therapist / Audiologist", "Clinical engineering technician", "Clinical laboratory technician", "Radiologic technologist"], "answer": ["a"]}
{"problem_id": "113E48", "problem_text_en": "Read the following passage and answer questions 48 and 49:\nA 23-year-old man presented with a complaint of penile ulcer. Current illness history: the ulcer appeared on his penis one week ago and gradually enlarged, so he came to the hospital. There is no pain at the ulcer site. There is no frequency or pain during urination. Past illnesses: pneumococcal pneumonia at age 14. Low blood pressure and skin rash were observed after administration of ampicillin/sulbactam. Lifestyle: he has smoked 20 cigarettes per day for 3 years and drinks alcohol occasionally. He has had sexual intercourse with multiple partners. Current symptoms: he is alert and oriented. Height is 170 cm, weight is 74 kg. Body temperature is 36.3°C. Pulse rate is 80 beats/min and regular. Blood pressure is 128/68 mmHg. Respiratory rate is 12 breaths/min. There are no abnormalities in heart sounds or breath sounds. The abdomen is flat, soft, and there is no palpable liver or spleen. There are no neurological abnormalities. There is no edema in the lower legs. An ulcer is observed on the penis. Test findings: ESR 32 mm/hour. Blood test results: red blood cells 4.18 million, Hb 13.3 g/dL, Ht 42%, white blood cells 9900 (segmented neutrophils 14%, band neutrophils 66%, eosinophils 2%, basophils 3%, monocytes 9%, lymphocytes 6%), platelets 200 thousand. Biochemical blood test results: total protein 7.6 g/dL, albumin 4.2 g/dL, blood urea nitrogen 20 mg/dL, creatinine 1.0 mg/dL, Na 137 mEq/L, K 4.2 mEq/L, Cl 105 mEq/L. Immunological blood test results: CRP 3.2 mg/dL, negative for anti-HIV antibody screening test, negative for Chlamydia antigen in urine, RPR 32-fold (less than 1-fold reference), TPHA less than 80-fold (less than the reference of 80-fold). A photo of the ulcer site is shown separately. What is the appropriate antibacterial drug?\n", "choices_en": ["Cephalosporin antibiotics", "Quinolone-based", "Penicillin-based", "Carbapenem antibiotics", "Tetracycline type"], "answer": ["e"]}
{"problem_id": "113E49", "problem_text_en": "One month later, an increase in Treponema antibody levels was observed. Which test would be most useful for determining the efficacy of treatment going forward?", "choices_en": ["CRP (C-reactive protein)", "Rapid Plasma Reagin (a blood test for syphilis)", "TPHA (T. pallidum hemagglutination assay)", "Erythrocyte sedimentation rate", "White blood cell count"], "answer": ["b"]}
{"problem_id": "113E50", "problem_text_en": "Read the following passage and answer questions 50 and 51.\n\nA 79-year-old man presented with cough and dyspnea. He had been aware of cough and dyspnea on exertion for the past 6 months. He had been taking over-the-counter cough medicine and monitoring his symptoms, but they had persisted. Three days ago, he noticed an increase in coughing and worsening of dyspnea, so he visited a hospital. He had a history of hypertension. His smoking history was 15 cigarettes per day for 35 years, and he had quit smoking at 55 years of age. He drank alcohol occasionally. There was no significant family history. On examination, his height was 162 cm, weight was 59 kg, body temperature was 36.5°C, pulse rate was 68 beats per minute, regular. Blood pressure was 140/90 mmHg, respiratory rate was 22 breaths per minute, and pulse oximetry revealed an oxygen saturation of 91%(room air). There was no abnormality in the conjunctiva and eyeball. There was no abnormality in heart sounds. Fine crackles were heard in the back of the lower center of the chest. His abdomen was flat, soft, and liver and spleen were not palpable. The laboratory results included red blood cell count of 4.03 million/μL, hemoglobin concentration of 12.8 g/dL, hematocrit of 31%, and white blood cell count of 7,700/μL, platelet count of 180,000/μL. As for blood biochemistry, AST was 24 U/L, ALT was 11 U/L, LD was 442 U/L (normal range: 176-353), γ-GTP was 16 U/L, urea nitrogen was 14 mg/dL, creatinine was 0.5 mg/dL, uric acid was 8.8 mg/dL, Na was 141 mEq/L, K was 3.9 mEq/L, Cl was 105 mEq/L, and KL-6 was 1,300 U/mL (normal range: <500). CRP was 0.3 mg/dL. Chest CT is shown separately. Which of the following is not useful for diagnosis?\n\n(Note: The text is missing the options for questions 50 and 51.)", "choices_en": ["Pulmonary biopsy", "High-resolution CT (computed tomography)", "Spirometry", "Bronchoalveolar lavage (BAL)", "Airway hyperresponsiveness test"], "answer": ["e"]}
{"problem_id": "113E51", "problem_text_en": "What is the most likely possibility?", "choices_en": ["Hypercapnia", "Reduced ejection fraction", "Decreased lung diffusion capacity", "Decrease in A-aDO2 value.", "Increased airway hypersensitivity"], "answer": ["c"]}
