{"problem_id": "113B1", "problem_text_en": "Which of the following is correct regarding informed consent?", "choices_en": ["After consenting, it cannot be withdrawn.", "Prescribed by the Medical Practitioners Act.", "It is sufficient to confirm intention in writing.", "The purpose is to avoid responsibility for medical professionals.", "An act that values the patient's autonomy."], "answer": ["e"]}
{"problem_id": "113B2", "problem_text_en": "What is stated in the Helsinki Declaration?", "choices_en": ["Conditions for euthanasia", "Definition of health", "Ethical principles of medical research involving human subjects", "Primary healthcare", "Health promotion"], "answer": ["c"]}
{"problem_id": "113B3", "problem_text_en": "The medical record of a patient hospitalized with pneumonia is shown below. \n\nS: \"My cough is getting better and it seems like my fever is going down too. Today, I'm feeling very good.\" \n\nO: \"Temperature is 36.2°C, blood pressure is 120/82 mmHg, pulse is 88 beats per minute and regular. Respiratory rate is 16 breaths per minute. Breath sounds are clear, and no obvious extra heart sounds are heard. Heart sounds I and II are normal, no III or IV are heard, and no heart murmurs are detected. Blood test results: WBC 9,800 (16,800 previously), neutrophils 65% (previously 92%), AST 30, ALT 32, LD 245, BUN 16, Cr 0.6. Sputum culture results show H. influenzae.\" \n\nA: \"Bacterial pneumonia: Symptoms and test results both show signs of improvement, and the antibiotics are effective.\" \n\nP: \"The patient wants to continue hospitalization until the weekend. As it is the third day of treatment, antibiotic administration will continue. The schedule for chest X-rays and blood tests will be confirmed with Dr. A and decided.\" \n\nWhich of the underlined parts does not match the SOAP note format?", "choices_en": ["① (This is not a word, but a symbol used for numbering or indicating a list item in Japanese.)", "Unfortunately, I cannot translate the choice without any additional context or information. The number ② by itself has no meaning or context for me to provide a translation. Please provide more information or context to help me understand what is being asked in the question.", "Sorry, I am not able to translate this choice as it is just a symbol without any context. It could refer to the third choice in a list of options, or the number of a specific question, but additional information is needed to provide an accurate translation.", "Sorry, I cannot translate \"④\" as it is a symbol used in a multiple-choice question to represent one of the answer choices. It has no meaning outside of that specific context.", "Sorry, I cannot translate this without further context. \"⑤\" is a symbol or number, but it cannot be translated without knowing what it refers to in the question."], "answer": ["e"]}
{"problem_id": "113B4", "problem_text_en": "Which of the following combinations of causative agents and infection prevention measures is inappropriate?", "choices_en": ["HIV - Standard Precautions", "Dust mite --------- droplet precautions", "Measles virus--------- Airborne precautions", "C.difficile - Contact precautions", "Influenza virus - Droplet precautions"], "answer": ["b"]}
{"problem_id": "113B5", "problem_text_en": "What are the characteristics of infants when compared to adults?", "choices_en": ["Reduced urine concentrating ability.", "A small proportion of body fluid per unit body weight.", "Low requirement of water per unit of body weight.", "Low perspiration rate per unit of body surface area.", "Low energy requirement per unit of body weight."], "answer": ["a"]}
{"problem_id": "113B6", "problem_text_en": "What is the advantage of using open-ended questions in a medical interview?", "choices_en": ["The medical interview can be done in a short amount of time.", "You can omit a systematic review.", "Comprehensive collection of information other than the chief complaint.", "Information can be obtained easily even from patients with cognitive impairment.", "It becomes easier to understand what the patient is interested in."], "answer": ["e"]}
{"problem_id": "113B7", "problem_text_en": "Which of the following indicates a hemodynamic status characterized by increased cardiac output, decreased systemic vascular resistance, decreased central venous pressure, and decreased pulmonary artery wedge pressure?", "choices_en": ["Tension pneumothorax", "Hemorrhagic shock", "Cardiogenic shock", "Cardiac tamponade", "Anaphylactic shock"], "answer": ["e"]}
{"problem_id": "113B8", "problem_text_en": "Separate abdominal X-ray images (①-⑤) are shown. Which of the following is most likely to be the cause of the detected wave motion on abdominal examination?", "choices_en": ["① (This is not translatable as it is a numbered choice in a multiple-choice question and could refer to anything)", "This is not a choice, it is a numeric reference. It would depend on the context of the question to indicate what it refers to.", "Sorry, I cannot translate this without any context. Please provide more information or the full question.", "Sorry, ④ is a number or symbol and cannot be translated without additional context.", "Unfortunately, without any context or additional information, it is impossible to provide an accurate translation of the choice \"⑤\". It could mean many different things depending on the content of the question."], "answer": ["d"]}
{"problem_id": "113B9", "problem_text_en": "Which of the following is the inability to repeat words/phrases, despite fluent speech and good comprehension of spoken language?", "choices_en": ["Dyslexia", "Congenital deafness", "Conduction aphasia", "Broca's aphasia", "Wernicke's aphasia"], "answer": ["c"]}
{"problem_id": "113B10", "problem_text_en": "What are the signs suggestive of abnormality in a newborn infant who is 40 weeks of gestation and has passed 30 minutes after birth?", "choices_en": ["Rectal temperature of 37.1℃", "Heart rate of 120 beats per minute", "Systolic blood pressure of 60mmHg", "Respiratory rate of 44/minute", "SpO2 85% (breathing room air)"], "answer": ["e"]}
{"problem_id": "113B11", "problem_text_en": "What is a useful evaluation for considering the presence of sepsis in a patient suspected of having an infectious disease who visited the emergency room, along with the level of consciousness?", "choices_en": ["Body temperature and pulse rate", "Body temperature and blood pressure", "Pulse and blood pressure", "Pulse rate and respiratory rate", "Blood pressure and respiratory rate"], "answer": ["e"]}
{"problem_id": "113B12", "problem_text_en": "Which of the following is appropriate for venipuncture using a syringe?", "choices_en": ["Remove the hemostatic band after removing the needle.", "Puncture the part where the pulsation can be felt.", "Immediately after blood collection, put a cap on the needle.", "Puncture the skin surface at an angle of 15 to 30 degrees.", "If there is a hemodialysis arteriovenous shunt, it should be performed on the same arm."], "answer": ["d"]}
{"problem_id": "113B13", "problem_text_en": "Which combination of disease and abdominal examination finding is correct?", "choices_en": ["Liver abscess --------- tenderness on percussion", "Cholecystitis --------- Splenomegaly", "Pancreatic tail cancer --------- palpable gallbladder", "Abdominal aortic aneurysm ---------- Tortuous veins in the abdominal wall", "Krukenberg tumor - palpable lymph nodes"], "answer": ["a"]}
{"problem_id": "113B14", "problem_text_en": "Which of the following is correct regarding a gynecological examination?", "choices_en": ["It will be done at the gravel bed.", "Palpating normal fallopian tubes.", "To be done before visual examination of the external genitalia.", "Urinating by storing urine in the bladder.", "The Douglas pouch is palpated by external examination."], "answer": ["a"]}
{"problem_id": "113B15", "problem_text_en": "Which of the following specimens should be immediately immersed to make a pathological tissue diagnosis using H&E staining from a sample collected by endoscopic biopsy?", "choices_en": ["Distilled water", "Baking soda solution", "Acetic acid solution", "Paraffin (wax)", "Formalin solution"], "answer": ["e"]}
{"problem_id": "113B16", "problem_text_en": "Which of the following is true about the \"recommended\" items listed in clinical practice guidelines?", "choices_en": ["The recommended content is not changed for 5 years.", "Weak recommendations should not be used in medical treatment.", "The recommended content is applicable to all patients.", "Medical practices that contradict strong recommendations should not be performed.", "There is a recommendation that \"～ should not be done.\""], "answer": ["e"]}
{"problem_id": "113B17", "problem_text_en": "Which of the following is the most suggestive of bacteremia in a febrile patient?", "choices_en": ["Nausea", "Headache", "Joint pain", "Chills and shivering", "Swollen lymph nodes (lymphadenopathy)"], "answer": ["d"]}
{"problem_id": "113B18", "problem_text_en": "Which of the following statements made by a patient strongly suggests schizophrenia?", "choices_en": ["\"I am possessed by a spirit.\"", "\"(Pointing to the stain on the ceiling) There are bugs crawling.\"", "\"I have cancer, so I will die tomorrow.\"", "\"The belief that one's thoughts are clearly conveyed to those around them.\"", "\"I can't go out because people passing by look at me when I'm outside.\""], "answer": ["d"]}
{"problem_id": "113B19", "problem_text_en": "Which of the following is incorrect about measles?", "choices_en": ["The incubation period is 10 to 14 days.", "Fever takes a biphasic course.", "White patches observed on the oral mucosa.", "The rash will heal (by) coalescence.", "The rash disappears with fever reduction."], "answer": ["e"]}
{"problem_id": "113B20", "problem_text_en": "What are the extra-articular manifestations of rheumatoid arthritis?", "choices_en": ["Vulvar ulcer", "Interstitial pneumonia", "Retoperitoneal fibrosis", "Ischemic optic neuropathy", "Aortic valve insufficiency/stenosis"], "answer": ["b"]}
{"problem_id": "113B21", "problem_text_en": "What is the first-line treatment for tension pneumothorax?", "choices_en": ["Administration of painkillers", "Administration of anti-anxiety medication", "Wearing a ventilator or mechanical ventilator", "Emergency thoracoscopic surgery", "Chest tube insertion"], "answer": ["e"]}
{"problem_id": "113B22", "problem_text_en": "Which of the following is the most appropriate for the purpose of urinary catheterization?", "choices_en": ["Prevention of urinary tract infection", "Reduction of care burden", "Measurement of urinary protein level", "Long-term bed rest of the patient", "Treatment of chronic urinary retention with hydronephrosis."], "answer": ["e"]}
{"problem_id": "113B23", "problem_text_en": "Which of the following is designated as the ultimate goal of \"Health Japan 21 (the second term)\"?", "choices_en": ["Improvement of lifestyle habits and social environment", "Extension of healthy life expectancy and reduction of health disparities", "Development of social environment to support and protect health.", "Thorough prevention of onset and exacerbation of lifestyle diseases", "Maintenance and improvement of the functions necessary for social life"], "answer": ["b"]}
{"problem_id": "113B24", "problem_text_en": "What are the habits that need to be improved to prevent the onset of lifestyle diseases in adults?", "choices_en": ["Salt intake of 12g/day", "Intake of dietary fiber is 50g/day.", "Consume more fish and shellfish than meat.", "2 times a week of exercise for 30 minutes or more.", "350mL of beer twice a week"], "answer": ["a"]}
{"problem_id": "113B25", "problem_text_en": "A 55-year-old man visited the evening outpatient clinic with the chief complaint of lower back pain. He reported that his chronic back pain had worsened since this morning despite taking over-the-counter painkillers three times, and he came to the clinic because he could not work with the pain. He was conscious, his temperature was 36.2°C, his pulse was 64/min, regular, and his blood pressure was 146/82 mmHg. Tenderness was detected in the paraspinal muscle at the level of the fourth lumbar vertebrae, but no abnormalities were noted on neurological examination. His attending physician considered the possibility of muscle/fascial back pain and proposed taking oral anti-inflammatory and analgesic medication, but the patient insisted, \"I won't leave unless you give me a shot that works well because pills don't work for me.\" A record from six months ago notes that the patient received an intramuscular injection of pentazocine and returned home with similar symptoms. What is the appropriate first response in this situation?", "choices_en": ["Arrange not to receive medical treatment in the future.", "Report to the police as drug intoxication.", "Inject 5% glucose solution into the muscle.", "Inject pentazocine intramuscularly.", "Listen to more detailed explanations."], "answer": ["e"]}
{"problem_id": "113B26", "problem_text_en": "An 80-year-old male patient complains of coughing. He noticed the onset of coughing after breakfast yesterday and came to the hospital after realizing that the crown of his right upper molar was missing. He is alert and conscious. His height is 162 cm, weight is 55 kg. His body temperature is 36.8 ℃. His pulse is 72 beats per minute and regular, blood pressure is 120/70 mmHg. His respiratory rate is 18 breaths per minute. No abnormalities are detected in heart sounds and breath sounds. Chest X-ray images (A, B) are shown separately. What should be done first?", "choices_en": ["Administration of antimicrobial agents", "Thoracoscopic surgery", "Bronchoscopy", "Self-induced coughing (habit cough)", "Upper gastrointestinal endoscopy"], "answer": ["c"]}
{"problem_id": "113B27", "problem_text_en": "A 26-year-old man was admitted to the hospital due to chest pain. While on a business trip, he experienced mild pain in his right shoulder during a morning flight. After arrival at the airport, he noticed difficulty breathing while walking and the symptoms continued, so he went to a nearby hospital. He was diagnosed with spontaneous pneumothorax and underwent chest tube insertion with continuous suction drainage. The following morning, when his attending physician examined him, the chest tube had slipped out about 20 cm compared to the previous day, with the tip of the tube remaining about 5 cm inside his body. The patient did not complain of difficulty breathing and his respiratory rate was 16/min with a SpO2 of 99% (room air). What is the first response that should be taken?", "choices_en": ["Stop continuous suctioning.", "Perform arterial blood gas analysis.", "Perform a chest X-ray.", "Double the continuous positive airway pressure (CPAP).", "Push the chest tube 20cm in."], "answer": ["c"]}
{"problem_id": "113B28", "problem_text_en": "A 23-year-old woman noticed a lump in her left breast and consulted a doctor. The results of fine needle aspiration and tissue examination led to a diagnosis of breast cancer. The responsible physician decided to explain the test results, diagnosis, and future treatment plan to the patient and her mother. What corresponds to the \"P\" in the SPIKES model for delivering bad news?", "choices_en": ["Have a conversation in a soundproof private room.", "Ask if they wish to have a further detailed explanation.", "Explain the options for future treatment.", "Confirm the patient's understanding of their illness.", "To empathize with the emotional state of shock."], "answer": ["d"]}
{"problem_id": "113B29", "problem_text_en": "A 32-year-old man presents with left anterior chest pain. He had been taking over-the-counter cold medicine for a fever of about 38℃ for 4 days. Two days prior to presentation, he began experiencing left anterior chest pain and became concerned. The pain was a persistent dull ache that had been gradually worsening. Presently, it is slightly exacerbated by deep inspiration. The electrocardiogram is shown separately. What auscultatory finding is most likely?", "choices_en": ["Increased sharpness of I sound", "Paradoxical splitting of the second heart sound.", "Pericardial friction rub", "Continuous murmur", "Systolic murmur radiating to the neck"], "answer": ["c"]}
{"problem_id": "113B30", "problem_text_en": "A 60-year-old man came to the hospital after being pointed out by his wife for having yellowing of the skin. He was diagnosed with diabetes at age 45 and has been taking oral diabetes medication. He is conscious and his vital signs are stable. His temperature is 36.8°C, pulse rate is 72/min, blood pressure is 128/76 mmHg, and respiratory rate is 14/min. There is mild anemic conjunctiva, and yellowing is observed in the ocular conjunctiva. There are no abnormalities in the heart and breath sounds. The abdomen is flat and there is no palpable liver or spleen. Mild tenderness is observed in the right hypochondrium. There is no edema in the lower legs. His blood test results are as follows: RBC count 3.56 million, Hb 10.8 g/dL, Ht 35%, WBC count 7,500, and platelet count 380,000. Blood biochemistry results reveal a total protein level of 7.2 g/dL, albumin level of 4.2 g/dL, total bilirubin level of 5.8 mg/dL, direct bilirubin level of 3.7 mg/dL, AST level of 48 U/L, ALT level of 65 U/L, ALP level of 689 U/L (reference range, 115–359), γ-GTP level of 243 U/L (reference range, 8–50), urea nitrogen level of 45 mg/dL, creatinine level of 3.5 mg/dL, blood sugar level of 153 mg/dL, and HbA1c level of 7.4% (reference range, 4.6–6.2). Which examination should be performed first?", "choices_en": ["Abdominal contrast-enhanced CT", "Laparoscopic liver biopsy", "Abdominal ultrasonography", "Magnetic resonance cholangiopancreatography (MRCP)", "Endoscopic retrograde cholangiopancreatography (ERCP)"], "answer": ["c"]}
{"problem_id": "113B31", "problem_text_en": "A 48-year-old woman was hospitalized yesterday due to a femoral fracture caused by a fall. She had no significant medical history and no smoking history. She began drinking alcohol at age 20, started caring for her mother-in-law at home at age 32, and increased her drinking frequency. She began drinking during the day from age 38 and consumed more than 500 mL of shochu per day from age 45. She did not sleep at all last night and has had coarse tremors in her hands and upper limbs since this morning. Her body temperature is 36.7℃, pulse rate is 68/min, blood pressure is 140/88mmHg, and heart and lung sounds are normal. Her abdomen is flat and soft, with no palpable liver or spleen. Blood tests show 3.92 million red blood cells, hemoglobin of 13.0 g/dL, hematocrit of 42%, 7,500 white blood cells, and 170,000 platelets. Biochemical blood tests show total protein of 7.8 g/dL, albumin of 3.8 g/dL, total bilirubin of 1.0 mg/dL, AST of 140 U/L, ALT of 80 U/L, γ-GTP of 210 U/L (normal range 8 to 50), total cholesterol of 295 mg/dL, and triglycerides of 240 mg/dL. There are no abnormalities on head CT. What is the appropriate medication to prevent symptoms that are likely to occur within a few days?", "choices_en": ["Selective serotonin reuptake inhibitors (SSRIs)", "Benzodiazepine-based medicine", "Psychoactive drugs", "Antipsychotic drugs", "Anti-alcohol medication"], "answer": ["b"]}
{"problem_id": "113B32", "problem_text_en": "An 11-year-old boy was brought to the clinic by his mother because of a rash on his lower legs. The rash appeared 2 days ago and he has complained of abdominal pain and knee joint pain since yesterday. He weighs 37 kg, his body temperature is 36.5℃, his pulse rate is 80 beats per minute and regular, and his respiratory rate is 20 breaths per minute. There are rashes on both lower legs, but there is no abnormality in the conjunctiva or sclera of the eyes or in the throat, and no cervical lymph nodes are palpable. There are no abnormalities in heart sounds or breath sounds, and his abdomen is flat with mild tenderness around the umbilicus. A photo of the rash on his left lower leg is shown separately. What is the skin finding observed in this patient?", "choices_en": ["When the non-rash area is warmed, a rash appears.", "Friction easily causes blisters on the rash.", "Even under compression with a glass plate, the rash does not fade.", "Rubbing the rash results in swelling at the site of friction.", "When ultraviolet radiation is applied to non-lesioned skin, the same rash as on the affected area appears."], "answer": ["c"]}
{"problem_id": "113B33", "problem_text_en": "A 4-month-old infant is hospitalized due to respiratory distress caused by an RS virus infection. A respiratory and heart rate monitor alarm sounded, so a resident doctor, supervising doctor, and nurse went to examine the patient and found cyanosis throughout the body. Airway management was performed and breathing was checked, but no spontaneous breathing was detected. The electrocardiogram monitor shows cardiac arrest. A peripheral intravenous line is secured, and resuscitation equipment is in the room. What is the immediate action to be taken?", "choices_en": ["Oxygen therapy", "Tracheal intubation", "Electric shock", "Adrenaline administration", "Chest compressions and artificial respiration"], "answer": ["e"]}
{"problem_id": "113B34", "problem_text_en": "A 25-year-old man is experiencing abdominal pain for the past two days. Yesterday, his pain was periodic and located around the periumbilical area. Today, the pain is persistent and located in the right lower quadrant. He has a fever and does not smoke or drink alcohol. His body temperature is 37.7℃, blood pressure is 126/62mmHg, and pulse rate is 94/min, regular. What is the next step to take?", "choices_en": ["CRP検査を実施する", "検査して腹膜刺激を調べる, check for peritoneal irritation", "広域抗生物質を投与する", "腹部造影CTを実施する", "上部消化管内視鏡検査を実施する"], "answer": ["b"]}
{"problem_id": "113B35", "problem_text_en": "A 37-year-old primigravid woman (G1P0) presented at 30 weeks of gestation with worsening bilateral leg edema. She had an uneventful pregnancy until 27 weeks, when she developed bilateral leg edema, which worsened from 28 weeks. She was conscious and alert. Her pulse was 72 beats per minute and regular, and her blood pressure was 160/104 mmHg. Urinalysis showed 2+ protein. Nonstress test (NST) was reactive, and uterine contractions were not observed. After admission, she was advised to rest, and her blood pressure was rechecked, which was 164/106 mmHg. Which medication should be administered?", "choices_en": ["β2-adrenergic agonist", "Loop diuretic", "Magnesium sulfate", "Dopamine receptor agonist", "Benzodiazepine anxiolytics"], "answer": ["c"]}
{"problem_id": "113B36", "problem_text_en": "A 20-year-old man was brought to the emergency room complaining of deformity and pain in his right ankle. He works as an office worker and belongs to a soccer club team. He sustained injuries during a game after colliding with another player and required an ambulance due to difficulty in walking. The position of his ankle at the time of injury is unknown. There is no significant medical, social, or family history. On arrival (2 hours after the injury), he was alert and oriented. His temperature was 36.9 °C, heart rate was 100 beats/min and regular, blood pressure was 124/76 mmHg, and respiratory rate was 14/min. His SpO2 was 100% (with 1 L/min of oxygen via nasal cannula). Swelling and tenderness were noted throughout his right ankle, but there were no open wounds around the area. The dorsalis pedis artery was palpable bilaterally and there was no abnormal sensation or movement noted in the right toe. No abnormalities were noted in areas other than the right ankle. The simple X-ray of the right ankle is shown separately. What is the appropriate initial treatment?", "choices_en": ["Taping fixation", "Antibiotic administration", "Revascularization", "Large volume infusion", "Manual therapy / Chiropractic adjustment"], "answer": ["e"]}
{"problem_id": "113B37", "problem_text_en": "A 21-year-old man complains of fever and cough and is brought to the hospital. His temperature is 39.2°C, pulse rate is 108 beats per minute and regular, blood pressure is 120/70 mmHg, respiratory rate is 16 breaths per minute, and SpO2 is 97% on room air. After blood collection from the right median cubital vein for blood tests, he complains of feeling uncomfortable. He becomes pale and develops profuse sweating all over his body, so the blood collection is immediately stopped. What is the next appropriate action to take?", "choices_en": ["Raise the lower limbs while supine.", "Apply a cold wet compress to the blood sampling site.", "Administering adrenaline intravenously.", "Instruct to increase the respiratory rate.", "Inject local anesthetic subcutaneously at the site for blood collection."], "answer": ["a"]}
{"problem_id": "113B38", "problem_text_en": "A 75-year-old man is undergoing home care after gastric cancer surgery. He underwent total gastrectomy for gastric cancer 3 years ago. One year ago, he was diagnosed with peritoneal dissemination, and pulmonary and liver metastases, but he did not choose chemotherapy. At a home visit, his condition was stable, but he began to experience loss of appetite 2 weeks ago, and maintenance fluid therapy of 1,700 mL per day was started at home. After that, he gradually spent more time in bed, and yesterday he began to complain of dyspnea. He urinates 4-5 times a day, with a volume of about 100 mL each time. He lives with his wife and eldest son's family, and he and his family hope to continue his medical care at home. He is 165 cm tall, weighs 43 kg, and has a body temperature of 36.2℃. His pulse rate is 96 beats per minute, regular, his blood pressure is 118/76 mmHg, and his respiratory rate is 18 breaths per minute. His SpO2 is 96% on room air. Coarse crackles and mild wheezes are heard in both lung fields. A 3-cm lump is palpable in his upper abdomen, but there is no tenderness. Marked edema is observed in both lower legs. His blood test results from two weeks ago showed: red blood cells 3.08 million, Hb 7.4 g/dL, Hct 28%, white blood cells 10,300, and platelets 180,000. Biochemical blood test results from two weeks ago are as follows: total protein 5.8 g/dL, albumin 2.3 g/dL, blood urea nitrogen 26 mg/dL, creatinine 1.3 mg/dL, blood glucose 89 mg/dL, Na 134 mEq/L, K 4.4 mEq/L, Cl 95 mEq/L. What should be done first?", "choices_en": ["Swallowing therapy", "Oxygen administration", "Reduction of fluid infusion.", "Emergency hemodialysis", "Introduction of palliative care ward."], "answer": ["c"]}
{"problem_id": "113B39", "problem_text_en": "A 5-year-old boy was brought to the clinic by his mother who was concerned about his slow running speed. She had noticed that he had been falling easily for the past year. During a recent sports festival, she became worried when she observed that he ran significantly slower than other children. There was nothing notable during the perinatal and neonatal periods. The mother's uncle died of heart failure at the age of 25. The child is 104 cm tall, weighs 17 kg, and has a body temperature of 36.8℃. There is no redness in the throat. No abnormal heart sounds or breathing sounds are heard. The abdomen is flat, soft, and no liver or spleen is palpated. There is no abnormality in tendon reflexes. The calf area is enlarged. Blood test results: Red blood cell count 4.68 million, Hb 12.6 g/dL, Ht 37%, white blood cell count 9,800, platelet count 210,000. Blood biochemical test results: Total protein 6.2 g/dL, albumin 3.8 g/dL, AST 436 U/L, ALT 478 U/L, CK 12,300 IU/L (reference range 46-230), blood urea nitrogen 9 mg/dL, creatinine 0.4 mg/dL. What are the findings observed in this patient?", "choices_en": ["Albright Syndrome", "Orthostatic hypotension", "Scarf sign", "Horner's syndrome", "Muscle rigidity phenomenon"], "answer": ["b"]}
{"problem_id": "113B40", "problem_text_en": "Read the following passage and answer questions 40 and 41. \n\nA 40-year-old woman visits the clinic complaining of palpitations. She has been experiencing palpitations for 2 months, initially feeling them when carrying shopping for around 5 minutes. 10 days ago, she began to feel palpitations even with slight activity at home. Her friend suggested that she should see a doctor. Her palpitations felt like an increase in heart rate. The symptoms have been gradually getting stronger, and she is worried that they will worsen. She heard that her father had a stroke and that it was due to a heart condition. She is worried about heart disease because she will not be able to do housework if she becomes bedridden. Additionally, she has had loose stools and has been feeling hotter than usual lately, and has lost 3 kg in the past 2 months. She has no medical history and has not been alerted to any abnormality on her electrocardiogram during a workplace health examination. She lives with her husband and elementary school-aged daughter. She has never smoked and has been drinking one beer (350 mL/day) once a week for the past 10 years. She works in an office. Her father has hypertension and had a stroke, and her mother has dyslipidemia. She had menarche at the age of 13 and has a 28-day menstrual cycle. \n\nWhich of the underlined items below indicates the interpretation model? \n\n① She began to feel palpitations even with slight activity at home. \n\n② Her friend suggested that she should see a doctor. \n\n③ Her palpitations felt like an increase in heart rate. \n\n④ She heard that her father had a stroke and that it was due to a heart condition. \n\n⑤ She is worried about heart disease because she will not be able to do housework if she becomes bedridden.", "choices_en": ["① (This is not a word or phrase, it is a numeric symbol/symbolic representation)", "Choice 2", "Unfortunately, ③ cannot be translated without additional context. It is likely a number or symbol used to represent a choice in the multiple-choice question, but there is not enough information to provide an accurate translation.", "I'm sorry, ④ cannot be translated without further context. It is simply a number and could represent any answer choice in a multiple-choice question.", "Sorry, ⑤ is a numeration symbol and cannot be translated without any context. Please provide more information about the question or choice."], "answer": ["e"]}
{"problem_id": "113B41", "problem_text_en": "Current symptoms: Conscious and alert. Height 160 cm, weight 52 kg. Body temperature 37.1 °C. Pulse rate 104 beats/min regular. Blood pressure 128/66 mmHg. Respiratory rate 16 breaths/min. Oxygen saturation 97% (on room air). Pupils are equal, round, and reactive to light, with no abnormality observed in the conjunctiva or sclera. Diffuse goiter is noted. No abnormality is observed in the heart or lung sounds. The abdomen is flat, soft, and non-tender, with no palpable liver or spleen. What can be expected to be found during the physical examination?", "choices_en": ["Hirsutism", "A stung or swollen finger; A finger with a blister or an inflammation caused by a burn or a wound", "Finger tremor", "Ptosis of the eyelid", "Cervical lymph node enlargement"], "answer": ["c"]}
{"problem_id": "113B42", "problem_text_en": "Read the following passage and answer questions 42 and 43.\n\nA 79-year-old woman came to the hospital with complaints of pain and stiffness in her upper arms and back. Current medical history: Two weeks ago, she began to feel pain and stiffness in her upper arms and back. One week ago, she noticed pulsating headaches on the right side. Additionally, she has had a fever of over 38℃ every evening and night. She came to the hospital due to severe stiffness in her back that made it difficult to turn over in bed when she woke up. She has lost 1.5 kg in two weeks but has no nausea, vomiting, numbness, or weakness in her limbs. Previous medical history: She is being treated for hypertension but has no history of migraines. Lifestyle information: She lives alone and has no history of smoking or alcohol consumption. Current symptoms: She is conscious and alert. Her body temperature is 38.9℃, her pulse rate is 104 beats per minute and regular, her blood pressure is 142/80 mmHg, and her respiratory rate is 14 breaths per minute. Her conjunctiva appears pale. There is tenderness and swelling on her right temple, but no skin rash. There is no stiffness in her neck, and no palpable lymph nodes are found. No abnormalities are found in her heart or lung sounds. Her abdomen is flat, soft, and no liver or spleen are palpable. There is no tenderness or lumps to be found. No Osler nodes or leg edema are found. Grip pain is present in both upper arms, but no joint swelling or tenderness is found. What should be the first thing confirmed?\n\n42. 患者の体温は何度？ \nWhat is the patient's body temperature?\nAnswer: 38.9℃\n\n43. 患者の右側頭部にみられる主な症状は何か？\nWhat is the main symptom seen in the patient’s right temple?\nAnswer: Swelling and tenderness.", "choices_en": ["Visual impairment or decreased vision", "Dental treatment history", "Feeling depressed", "History of abuse of headache medicine", "Family history of migraine"], "answer": ["a"]}
{"problem_id": "113B43", "problem_text_en": "Examination results: ESR 102 mm/hr. Blood test results: RBC count 3.01 million, Hb 9.6 g/dL, Hct 29%, WBC count 9,800, platelet count 470,000. Blood biochemistry results: total protein 5.9 g/dL, AST 29 U/L, ALT 28 U/L, LD 321 U/L (normal range: 176-353), CK 38 U/L (normal range: 30-140), blood urea nitrogen 18 mg/dL, creatinine 0.7 mg/dL, blood glucose 102 mg/dL, Na 138 mEq/L, K 4.9 mEq/L, Cl 100 mEq/L. Immunoserology results: CRP 8.6 mg/dL, rheumatoid factor (RF) negative, ANA negative, CH50 52 U/mL (normal range: 30-40). No abnormalities were observed on chest X-ray. After investigation, a decision was made to initiate treatment with corticosteroids for adrenal cortex dysfunction. What are the examination parameters to be monitored during treatment?", "choices_en": ["Blood glucose", "Platelets", "Total protein", "Serum complement level", "Creatinine"], "answer": ["a"]}
{"problem_id": "113B44", "problem_text_en": "Read the following passage and answer questions 44 and 45.\nA 67-year-old man was brought in by ambulance in a state of cardiac arrest. His medical history: his wife went to wake him up in his bedroom around 6 o'clock this morning and he responded, but he didn't wake up again even after an hour passed. When she went to call him again, he didn't respond and his eyes remained closed, so at 7 o'clock, an ambulance was called. The ambulance arrived five minutes later and determined that he was in cardiac arrest. They did not contact his primary care physician and brought him to a life support ambulance center while performing CPR. At the emergency center, pulseless electrical activity was determined, and CPR was continued. While a resident continued chest compressions, the attending physician decided to secure an intravenous line for drug administration. What is the first-choice site for intravenous line placement? \n\n(Note: Question 44 is not provided in the original text and should be inferred from the context. It is asking about the medical condition the patient is in when he reaches the emergency center.)", "choices_en": ["Femoral vein", "Internal jugular vein", "Subclavian vein", "Great saphenous vein", "Median Antebrachial Vein"], "answer": ["e"]}
{"problem_id": "113B45", "problem_text_en": "Medical history: Diagnosed with diabetes and hypertension 20 years ago, and continued to receive oral medication. Lifestyle: Smoked 20 cigarettes/day for 45 years until the age of 65. Alcohol consumption: drank 2 go of shochu 3 days a week. The results of the venous blood sampling taken upon admission are as follows: Blood test: red blood cells 3.22 million, Hb 10.1 g/dL, Hct 31%, white blood cells 8,800, platelets 110,000. Blood biochemistry: AST 92 U/L, ALT 78 U/L, blood urea nitrogen 82 mg/dL, creatinine 9.8 mg/dL, blood glucose 228 mg/dL, Na 142 mEq/L, K 9.8 mEq/L, Cl 112 mEq/L, Ca 8.6 mg/dL. CRP 2.3 mg/dL. The internist and surgeon on duty who responded to the in-hospital emergency call continued cardiopulmonary resuscitation with medical residents and attendings from the emergency center, but the patient's heart did not restart, and the patient's death was confirmed. When the attending physician was contacted, it was found out that this patient was scheduled to receive dialysis soon due to diabetic nephropathy and chronic renal failure. The last visit was one week ago. Which of the following cannot be issued on the death certificate?", "choices_en": ["The internal medicine ward on-call doctor who performed the confirmation of death", "The surgical ward on-call doctor who assisted in life-saving treatment", "Primary care physician who received a death report over the phone", "The supervising physician of the emergency medical center that provided life-saving treatment.", "Trainee doctor at a life-saving emergency center where life-saving measures were taken"], "answer": ["c"]}
{"problem_id": "113B46", "problem_text_en": "Read the following passage and answer questions 46 and 47. \n\nA 72-year-old man is currently undergoing outpatient treatment following pancreatic cancer surgery. Medical history: He underwent surgery for pancreatic cancer 6 months ago. A follow-up examination 6 months post-surgery revealed metastases to other organs and a prognosis of 3 months left to live. Previous medical history: He has been receiving drug therapy for hypertension since the age of 60 and for dyslipidemia since the age of 62. Lifestyle history: He has been smoking 20 cigarettes per day since he was 20 years old and drinks alcohol occasionally. He is living with his son's family. Family history: His father had hypertension and myocardial infarction. Current symptoms: Alert and oriented. Height: 165 cm, weight: 48 kg. Body temperature: 36.8 ℃. Pulse rate: 72 / min, regular. Blood pressure: 134/74 mmHg. Respiratory rate: 20 / min. SpO2: 98% (room air). No abnormalities observed in the palpebral conjunctiva or ocular conjunctiva. No abnormalities observed in heart sounds or breath sounds. Abdomen is flat and soft, with no palpable liver or spleen. A surgical scar is observed in the middle of the abdomen. The patient expresses to his primary physician, “Doctor, I don't know what to do now.” What would be an appropriate response by the physician?\n\n---\n\n46. 何かしらの症状が感じられないことに患者は不安になっている。 -> The patient is anxious about not feeling any symptoms. \n\n47. 医師は医療行為の範疇を超えた更なる援助を患者に提供する必要がある。 -> The physician needs to provide further support to the patient beyond the scope of medical treatment.", "choices_en": ["\"I don't know either\"", "\"Please accept reality.\"", "\"Please be a little more careful\"", "\"Please change to a medical institution nearby.\"", "\"Well, let's consider future plans together.\""], "answer": ["e"]}
{"problem_id": "113B47", "problem_text_en": "The attending physician found a research report on a randomized comparative trial of supportive therapy X for pancreatic cancer. The report separately compares the intervention group (Group A) and control group (Group B) of supportive therapy X. Which of the following statements is correct?", "choices_en": ["The 6-month survival rate for Group A is approximately 60%.", "The two-month survival rate for Group B is about 90%.", "The median survival time for Group A is about 2 months.", "The median survival of Group B is about 3 months.", "It can be said that supportive therapy X has a life-prolonging effect."], "answer": ["b"]}
{"problem_id": "113B48", "problem_text_en": "Read the following passage and answer questions 48 and 49. \n\nA 68-year-old man comes to the hospital with the chief complaint of transient loss of consciousness. Present illness history: He suddenly felt that his vision became dark and lost consciousness, fell down while shopping. According to his family who was present at that time, he quickly regained consciousness about 30 seconds later and was taken to the hospital by his family. Past history: He has been visiting a clinic near his home for hypertension for the past 10 years. Lifestyle: He has been smoking 10 cigarettes a day for 40 years until he was 68 years old, and he drinks alcohol occasionally. Family history: His father died of colon cancer at the age of 70. Which of the following information to be additionally confirmed is of relatively low importance?\n\n48: 追加して確認すべき情報で重要度が低いのはどれか。\n \nAnswer: Drinking alcohol occasionally.\n\n49: この患者に対して今後の検査で最も適切なものはどれか。\n \nAnswer: 頭部CTスキャン。 (Head CT scan.)", "choices_en": ["Oral medication", "Presence of palpitations", "Presence of chest pain", "Presence of black stool", "Presence of dizziness during positional change"], "answer": ["e"]}
{"problem_id": "113B49", "problem_text_en": "Present condition: Clear consciousness. Height 168 cm, weight 64 kg. Body temperature 36.1°C. Pulse rate 88/min, regular. Blood pressure 128/88 mmHg. Respiration rate 16/min. SpO2 98% (room air). No abnormalities detected in the conjunctiva or sclera of the eyes. Auscultation of the heart reveals a grade IV/VI systolic murmur at the second right intercostal space adjacent to the sternum. The schematic of heart sounds and murmurs is shown below. What is the predicted condition in this patient?", "choices_en": ["① (It refers to a number, so it does not have a specific translation. It could mean \"one\" or \"1\" depending on the context.)", "This choice cannot be translated without further context. It is simply the number \"2\" in Japanese.", "Sorry, it is not possible to translate choice ③ without the context of the question. Please provide more information.", "This is not a phrase or a term to be translated, but it is a number 4 represented in Arabic numerals (0,1,2,3,4,5,6,7,8,9).", "This is not a word or phrase, but rather a numerical symbol. It has no meaning on its own and cannot be translated without further context."], "answer": ["b"]}
