{"problem_id": "113F1", "problem_text_en": "Which of the following statements about the changes in mortality and life expectancy in our country is correct?", "choices_en": ["Since 1950, the leading cause of death with the highest mortality rate has consistently been malignant neoplasms (cancer).", "The main reason for the extension of lifespan until the mid-1960s was the reduction of infant and child mortality.", "The decrease in stroke mortality rate in the 1970s was mainly due to a reduction in cerebral infarction.", "Since 1980, the age-adjusted death rate from pneumonia has continued to increase.", "Since 1990, the number of deaths due to suicide has consistently exceeded 30,000."], "answer": ["b"]}
{"problem_id": "113F2", "problem_text_en": "Which of the following statements is incorrect regarding patient surveys?", "choices_en": ["It is possible to know the treatment rate.", "It is conducted once every three years.", "Answered by the patient himself/herself.", "Average length of hospital stay can be determined.", "Implemented by the Ministry of Health, Labour and Welfare."], "answer": ["c"]}
{"problem_id": "113F3", "problem_text_en": "Which of the following is correct regarding public medical insurance?", "choices_en": ["Insurance premium rates are uniformly set nationwide.", "Medical benefits are provided in cash.", "More than 80% of the funding comes from insurance premiums.", "Everyone aged 75 or older is responsible for a 10% co-payment.", "There is a subsidy system for cases where the medical expenses are high."], "answer": ["e"]}
{"problem_id": "113F4", "problem_text_en": "Which of the following statements is correct regarding the national medical expenses in the fiscal year 2015?", "choices_en": ["Includes nursing care insurance costs.", "The proportion of national income exceeds 10%.", "Medical expenses at general clinics are higher than those at hospitals.", "By age group, those 65 years of age or older exceed 80%.", "Pharmacy dispensing medical expenses are higher than medical expenses for medical treatment in clinics."], "answer": ["b"]}
{"problem_id": "113F5", "problem_text_en": "Which organization plays a central role in building a network to prevent elder abuse?", "choices_en": ["Public health center.", "Regional medical support hospital", "Municipal health center", "Community Inclusive Support Centers", "Medical Safety Support Center"], "answer": ["d"]}
{"problem_id": "113F6", "problem_text_en": "Which of the following shows an estimation of medical demand for home healthcare?", "choices_en": ["Patient survey", "Census", "Health Japan 21", "Regional medical care plan", "Long-term care insurance business plan"], "answer": ["d"]}
{"problem_id": "113F7", "problem_text_en": "Which indicator shows the proportion at a certain point in time?", "choices_en": ["Mortality rate", "Birth rate", "Mortality rate", "Prevalence of disease", "Incidence/prevalence rate"], "answer": ["d"]}
{"problem_id": "113F8", "problem_text_en": "To verify the efficacy of the new drug A, a randomized controlled trial (RCT) was conducted. A predetermined number of cases was randomized to receive drug A or standard therapy according to a number obtained from prior sample size calculation. The administration of the drugs was double-blind, and after the end of the study period, which used death as the endpoint, a survival curve was created using the Kaplan-Meier method and survival analysis was performed using the intention-to-treat (ITT) approach. Which combination of method and purpose is correct?", "choices_en": ["Counting number of cases -------- Prevention of selection bias", "Random allocation --------- Improvement of reproducibility", "Double-blind study  ---------  prevention of information bias", "Kaplan-Meier method - Adjustment for confounding factors", "ITT - Ensuring external validity"], "answer": ["c"]}
{"problem_id": "113F9", "problem_text_en": "What can be identified on a frontal chest X-ray image of a healthy adult?", "choices_en": ["Thymus", "Aortic valve", "Ventricular septum", "Tracheal bifurcation", "Hilar lymph node"], "answer": ["d"]}
{"problem_id": "113F10", "problem_text_en": "Which of the following is caused by organic shortening of skeletal muscles?", "choices_en": ["Stiffness or rigidity", "Rigidity", "Spasm or spastic contraction", "Contracture", "Tremor"], "answer": ["d"]}
{"problem_id": "113F11", "problem_text_en": "Which of the following statements is correct regarding mental health and welfare in our country?", "choices_en": ["The number of female suicide victims is higher than that of male victims.", "Mental illnesses are included in the five diseases of medical care plans based on medical treatment laws.", "Mental disorders are not subject to the Act on Promotion of Employment of Persons with Disabilities.", "The number of psychiatric hospital beds per capita is lower than in other OECD countries.", "The provision of medical expenses for independent support of mental illness will be discontinued during the maintenance treatment phase."], "answer": ["b"]}
{"problem_id": "113F12", "problem_text_en": "Which of the following is true regarding norovirus infection?", "choices_en": ["Preheating before eating is effective.", "Antiviral drugs are effective.", "Produce botulinum toxin inside the body.", "Vaccination is classified as a regular inoculation.", "The number of patients with identified causes of food poisoning is ranked 3rd."], "answer": ["a"]}
{"problem_id": "113F13", "problem_text_en": "What is observed in Langerhans cells?", "choices_en": ["Birbeck granules", "Desmosome", "Melanosomes", "Tonofilament.", "Keratohyalin granule"], "answer": ["a"]}
{"problem_id": "113F14", "problem_text_en": "Which of the following statements about cancer cachexia is incorrect?", "choices_en": ["Related to chronic inflammation.", "Induced by anti-cancer chemotherapy.", "Related to the energy metabolism of cancer cells.", "The three major symptoms are fatigue, loss of appetite, and weight loss.", "There are three stages; pre-cachexia, cachexia, and irreversible cachexia."], "answer": ["b"]}
{"problem_id": "113F15", "problem_text_en": "Separately showing a 3D-CT of post-coronary artery bypass grafting. Which arrow indicates the graft anastomosis?", "choices_en": ["Left main coronary artery", "Left anterior descending artery", "Left anterior descending coronary artery", "Left circumflex artery", "Right posterior descending artery"], "answer": ["b"]}
{"problem_id": "113F16", "problem_text_en": "Where is the center for ejaculation located?", "choices_en": ["Cerebral cortex", "Bridge", "Cervicothoracic medulla", "Thoracolumbar cord", "Lumbosacral spinal cord"], "answer": ["d"]}
{"problem_id": "113F17", "problem_text_en": "Which of the following is correct regarding life tables?", "choices_en": ["Maximum effort takes a value of 1 or less by definition.", "The average lifespan varies depending on the age structure of the actual population.", "Average lifespan is calculated from the average age of death each year.", "The average life expectancy at 50 years old is calculated using the annual mortality rate since the birth of a person who is currently 50 years old.", "The 50-year mortality rate is the probability that someone who turned 50 will die before reaching age 51."], "answer": ["e"]}
{"problem_id": "113F18", "problem_text_en": "Which combination of various T lymphocytes (T cells) and their functions is correct?", "choices_en": ["Th1 cells --------- Activation of macrophages", "Th2 cells activate neutrophils.", "Th17 cells --------- activation of eosinophils", "Cytotoxic T cells --------- Induction of antibody production", "Regulatory T cells (Tregs) induce IL-6 production."], "answer": ["a"]}
{"problem_id": "113F19", "problem_text_en": "Which of the following is subject to hospitalization recommendations based on the Infectious Diseases Control Law?", "choices_en": ["Measles", "Tetanus", "Hepatitis B", "Avian influenza (H5N1)", "Acquired Immune Deficiency Syndrome (AIDS)"], "answer": ["d"]}
{"problem_id": "113F20", "problem_text_en": "What is the earliest event that occurs in the fetus/placenta?", "choices_en": ["Completion of placenta", "Hair growth", "Formation of alveoli in the lungs", "Descent of the testes", "Urinary secretion from the kidney"], "answer": ["e"]}
{"problem_id": "113F21", "problem_text_en": "Results of a 10-month-old infant's health checkup show a height of 70 cm, weight of 8,330 g, head circumference of 40 cm, and chest circumference of 43 cm. What is the Kaup index?", "choices_en": ["13 (there is no meaning or context provided for this choice)", "15", "17", "19", "21"], "answer": ["c"]}
{"problem_id": "113F22", "problem_text_en": "Which of the following is least likely to be the cause of progressive cognitive impairment in elderly patients over several days?", "choices_en": ["Subdural hematoma", "Hyponatremia", "Side effects caused by medication", "Alzheimer's type dementia", "Sepsis due to pyelonephritis"], "answer": ["d"]}
{"problem_id": "113F23", "problem_text_en": "The family tree is shown below. Which one exhibits a genetic pattern in this family tree?", "choices_en": ["Duchenne muscular dystrophy", "Sturge-Weber syndrome", "Phenylketonuria", "Neurofibromatosis type 1", "Huntington's disease"], "answer": ["a"]}
{"problem_id": "113F24", "problem_text_en": "Which of the following is correct regarding death certificate?", "choices_en": ["Reported by the hospital.", "Do not describe autopsy findings.", "Both signature and stamp are required.", "Can only be written by the attending physician.", "Can be listed as cause of death due to senility."], "answer": ["e"]}
{"problem_id": "113F25", "problem_text_en": "The patient who complained of bilateral hearing loss presents the audiogram separately. What is the average hearing level (4-tone average) in the right ear?", "choices_en": ["(40+50+50+60)/4=50dB", "(40+50+60+70)/4 = 55dB", "(50+60+60+70)/4=60dB", "(50+60+70+80)/4 = 65dB", "(50+50+60+70)/4 = 57.5dB"], "answer": ["c"]}
{"problem_id": "113F26", "problem_text_en": "Which vaccine is recommended for regular inoculation at the age of 65?", "choices_en": ["Measles vaccine", "Pneumococcal vaccine", "Meningococcal vaccine", "Hepatitis B vaccine", "Influenza bacillus vaccine (The correct term should be \"Influenza bacterial vaccine\" or \"Influenza vaccine for bacterial infections\" as the Influenza virus is not a bacterium but a virus.)"], "answer": ["b"]}
{"problem_id": "113F27", "problem_text_en": "Which of the following is incorrectly used as an evaluation criterion for physical frailty?", "choices_en": ["Easily fatigued", "Decrease in grip strength", "Reduced sleep time", "Decreased walking speed", "Decrease in physical activity levels in daily life"], "answer": ["c"]}
{"problem_id": "113F28", "problem_text_en": "The following is a partial image of a set of graphics that are used in a psychological test. Which statement is correct regarding this psychological test?", "choices_en": ["It consists of monochrome and color illustrations.", "The entire test will take about 5 minutes.", "The whole test consists of 4 illustrations.", "The subject fills out the questionnaire by themselves.", "It aims to screen for mental illness."], "answer": ["a"]}
{"problem_id": "113F29", "problem_text_en": "Which of the following is the most useful addition to a plain CT scan to confirm the diagnosis in a trauma patient, a contrast-enhanced CT scan?", "choices_en": ["Pneumothorax", "Cerebral concussion/brain contusion.", "Splenic injury", "Rib fracture", "Diffuse axonal injury"], "answer": ["c"]}
{"problem_id": "113F30", "problem_text_en": "The electrocardiogram during paroxysmal tachycardia (A) and the electrocardiogram after restoration to sinus rhythm by electric shock (B) are shown separately. Which treatment is appropriate?", "choices_en": ["Verapamil oral administration", "Oral administration of digoxin", "Implantation of an implantable defibrillator", "Catheter ablation", "Cardiac resynchronization therapy with biventricular pacing"], "answer": ["d"]}
{"problem_id": "113F31", "problem_text_en": "What is always performed in health examinations based on the pneumoconiosis health checkup law?", "choices_en": ["Sputum cytology examination", "Arterial blood gas analysis", "Spirometry", "Tuberculin skin test", "Direct chest X-ray"], "answer": ["e"]}
{"problem_id": "113F32", "problem_text_en": "Which of the following combinations of laws and their contents is incorrect?", "choices_en": ["Medical Law; Prohibition of Diagnosis and Treatment without Examination", "Labor Standards Act ----- Maternity/Paternity leave", "Health Promotion Law ----------- Prevention of Passive Smoking", "Child Welfare Law --------- Medical expense allowances for pediatric chronic specified diseases", "Worker's Accident Compensation Insurance Law - Benefit for occupational accidents"], "answer": ["a"]}
{"problem_id": "113F33", "problem_text_en": "Separate pictures of walking aids (① to ⑤) are shown. Which one is the most suitable for outdoor walking with complete unloading of one lower limb?", "choices_en": ["① (pronounced \"ichi\") is just the numeral 1. It does not have a specific translation in the context of a multiple-choice question without additional information. It could be indicating a choice option, question number, or other information.", "This is not a linguistic question and cannot be translated. It is a numeric choice in a multiple-choice question which indicates the second option.", "Sorry, it is not possible to translate \"③\" without more context. It appears to be a numerical symbol or placeholder used in a multiple-choice question to represent a specific answer choice.", "Sorry, ④ is a number and not a word, so there is not a specific translation for it. Could you please provide more context so I can assist you properly?", "As an isolated choice, ⑤ cannot be translated accurately without any context. It is usually a numerical reference within a list or a sequence, and its meaning depends on the context in which it is used."], "answer": ["c"]}
{"problem_id": "113F34", "problem_text_en": "Which of the following have decreased while crude mortality rate has increased in 2016 compared to 2006? Choose two. (Note: 年齢調整死亡率 refers to age-adjusted mortality rate.)", "choices_en": ["Suicide", "Tuberculosis", "Heart disease", "Malignant neoplasm (cancer)", "Cerebrovascular disease"], "answer": ["c", "d"]}
{"problem_id": "113F35", "problem_text_en": "From the questionnaire obtained during the BCG vaccination of a 6-month-old infant, which of the following information requires caution and confirmation of details before administering the vaccine? Select two.", "choices_en": ["The mother has an egg allergy.", "My older brother has congenital immunodeficiency.", "The grandfather living together is currently hospitalized with pulmonary tuberculosis.", "On the day of vaccination, the person's body temperature is 37.0℃.", "I received Hepatitis B vaccination 2 weeks ago."], "answer": ["b", "c"]}
{"problem_id": "113F36", "problem_text_en": "Which of the following are considered health effects of ultraviolet radiation? Choose two.", "choices_en": ["Hay fever", "Cataract", "Glaucoma", "Skin cancer", "Chronic bronchitis"], "answer": ["b", "d"]}
{"problem_id": "113F37", "problem_text_en": "Which of the following conditions cause back pain that is not alleviated by rest? Select two.", "choices_en": ["Scoliosis", "Aortic dissection", "Metastatic spinal tumor", "Lumbar spinal canal stenosis", "Lumbar intervertebral disc herniation"], "answer": ["b", "c"]}
{"problem_id": "113F38", "problem_text_en": "Which of the following are observed in COPD? Select two.", "choices_en": ["Increased residual volume", "Increased diffusion capacity", "Increased A-a gradient", "Elevation of serum KL-6", "Fine crackles auscultation"], "answer": ["a", "c"]}
{"problem_id": "113F39", "problem_text_en": "Which of the following statements about radiation exposure during pregnancy is correct? Select two.\n\nNote: Without context, the translation of this question may vary slightly based on the intended meaning of \"which of the following,\" as there may be a list to choose from.\n\nPossible translations:\n\n- Which of the following statements about radiation exposure during pregnancy is true? Choose two.\n- Which of the following options correctly describes radiation exposure during pregnancy? Choose two.\n- Which of the following is accurate regarding radiation exposure during pregnancy? Select two.", "choices_en": ["Exposure during early pregnancy is an indication for medical termination of pregnancy.", "The occurrence of fetal abnormalities is considered a deterministic effect with a threshold.", "A radiation dose limit is established for those engaged in radiation work.", "The risk of fetal malformation is higher after exposure to radiation during the later stages of pregnancy.", "The risk of postnatal mental developmental delay is high with exposure in the later period of pregnancy."], "answer": ["b", "c"]}
{"problem_id": "113F40", "problem_text_en": "Which of the following combinations of illnesses and criteria for absence from school are correct for middle school students? Select two.", "choices_en": ["Seasonal flu - Until 5 days after onset and 2 days after fever subsides.", "Pharyngoconjunctival fever - Until 2 days after the main symptoms have subsided.", "Pertussis - Until 3 days after the characteristic cough disappears", "Rubella - until 3 days after the fever has subsided", "Chickenpox - until 3 days after all rashes have crusted"], "answer": ["a", "b"]}
{"problem_id": "113F41", "problem_text_en": "Which of the following adverse events are common with benzodiazepine hypnotics? Select two.", "choices_en": ["Falling, tumble, slip", "Aphasia", "War of aggression", "Anterograde amnesia", "Akathisia"], "answer": ["a", "d"]}
{"problem_id": "113F42", "problem_text_en": "Which of the following is incorrect regarding the contents of a health examination for a 3-year-old child?", "choices_en": ["Urinalysis", "Blood pressure measurement", "Dental check-up/examination", "Presence or absence of speech disorder", "Implementation status of immunization"], "answer": ["b"]}
{"problem_id": "113F43", "problem_text_en": "Which of the following are required to be placed at a Regional Comprehensive Support Center? Select three.", "choices_en": ["Physician (Doctor)", "Public health nurse", "Certified social worker", "Chief Care Manager", "Medical social worker"], "answer": ["b", "c", "d"]}
{"problem_id": "113F44", "problem_text_en": "A 22-year-old woman was brought in by ambulance due to eating disorder and muscle weakness. She began to restrict her food intake after a love affair at the age of 18 and could not stop losing both her food intake and body weight. She had been undergoing treatment at a nearby psychiatric facility. Due to muscle weakness, she became unable to move at home and requested an ambulance. She has not had menstruation for three years. She is conscious. She is 152 cm tall and weighs 26 kg. Her body temperature is 35.1℃. Her heart rate is 48/min and regular. Her blood pressure is 80/52 mmHg. She has increased hair growth on her forearms. Urinalysis: Protein (-), glucose (-), ketones (+). Blood test results: Red blood cells 4.08 million, Hb 11.0 g/dL, Ht 38%, white blood cells 3,300, platelets 80,000. Blood chemistry test results: AST 28 U/L, ALT 16 U/L, blood urea nitrogen 12 mg/dL, creatinine 0.6 mg/dL, Na 135 mEq/L, K 3.0 mEq/L, Cl 94 mEq/L, blood glucose 45 mg/dL, HbA1c 4.4% (reference range 4.6-6.2), TSH 2.8 μU/mL (reference range 0.5-5.0), FT3 1.8 pg/mL (reference range 2.3-4.3), FT4 0.9 ng/dL (reference range 0.9-1.7). When intravenous fluids containing glucose were started, dyspnea, consciousness disorders (JCS II-20), and systemic edema appeared from the second day of hospitalization, and blood test results were AST 539 U/L and ALT 654 U/L. Which of the following is not an appropriate response?", "choices_en": ["Administering phosphorus.", "Conduct an electrocardiogram (ECG/EKG).", "Measure trace elements.", "Administer vitamin B$_1$.", "Administer thyroid hormone."], "answer": ["e"]}
{"problem_id": "113F45", "problem_text_en": "This is a report from a trainee to a supervising physician regarding an examination of a child at the emergency department. Trainee: \"A one-year-old girl has been presenting with fever, cough, and runny nose for three days, and rash on the limbs and trunk since today, which prompted her parents to bring her to the hospital. She has severe coughing and her room-air oxygen saturation is at 92%, so hospitalization should be considered.\" Supervising physician: \"What kind of rash is it?\" Trainee: \"There are widespread erythematous papules on her limbs and trunk.\" Supervising physician: \"What about mouth findings?\" Trainee: \"Pharyngeal erythema, and there are white spots on her cheek mucosa.\" Supervising physician: \"If the patient needs to be hospitalized, what infection control measures are particularly necessary for this patient?\" What would be the most appropriate response from the trainee?", "choices_en": ["\"We will perform isolation using curtains\"", "\"We will use a pediatric stethoscope.\"", "\"I will wear an apron during the examination\"", "\"The patient will wear an N95 mask\"", "\"We will confirm the infection antibody titer and vaccination status of medical staff who are involved.\""], "answer": ["e"]}
{"problem_id": "113F46", "problem_text_en": "A 35-year-old woman underwent partial mastectomy for right breast cancer six months ago. She is currently receiving chemotherapy on an outpatient basis and her condition is stable. She worked as an office worker, but has been on leave of absence since surgery. She has expressed a wish to discuss her condition and future treatment with her workplace as she plans to return to work. Her workplace has an industrial physician on contract. What is the appropriate response?", "choices_en": ["To explain to a colleague in the workplace.", "Explain to the occupational physician.", "Explain it as if you were telling someone.", "Inform that permission from the Labor Standards Supervision Office is necessary.", "Explain that we cannot contact the workplace without the family's consent."], "answer": ["b"]}
{"problem_id": "113F47", "problem_text_en": "A 6-year-old boy is brought to the clinic by his mother who is worried about his short stature. At the time of the visit, the boy's height is 99.2 cm and weight is 19.0 kg. He was born in a breech presentation via vaginal delivery, and at birth he was 50.2 cm tall and weighed 3,520 g. His father is 174 cm tall and his mother is 156 cm tall. A growth chart for the boy is shown separately. Which of the following would be an appropriate explanation for the mother?", "choices_en": ["\"Let's start growth hormone medication immediately.\"", "\"Let's observe the progress because it is constitutional (innate)\".", "\"Let's expect that your height will continue to grow from now on.\"", "\"Let's evaluate the secretion of hormones involved in growth\"", "\"If your height continues to grow slowly, please come for another examination in 3 years.\""], "answer": ["d"]}
{"problem_id": "113F48", "problem_text_en": "A 70-year-old woman was brought to the emergency room for chest and back pain. She experienced sudden chest and back pain while doing household chores at home, followed by a loss of consciousness, prompting her husband to call for an ambulance. She was previously advised that her blood pressure was high during a checkup. She is independent in activities of daily living and her condition before onset was normal. Upon admission, her level of consciousness was assessed as JCS III-100. Her heart rate was 100 bpm and regular. The blood pressure in the upper extremities was unmeasurable. The blood pressure in the lower extremities was 70 mmHg by palpitation. Her respiratory rate was 30 breaths/minute and SpO2 measurement was unobtainable. Jugular venous distension was observed. Radial arteries could only be palpated weakly on both sides, but both carotid arteries and both femoral arteries were palpable. Auscultation of the chest revealed a decrease in intensity for the first and second heart sounds, but no abnormalities in breath sounds were noted. Her abdomen was flat and soft, and the liver and spleen were not palpable. A lacy-like, reticular rash was observed on her limbs. What is the most urgent test to be performed?", "choices_en": ["Lower extremity venous ultrasound examination", "Echocardiogram (ultrasound of the heart)", "Thoracic spine MRI", "Head CT (Computed Tomography)", "Chest CT (computed tomography)"], "answer": ["b"]}
{"problem_id": "113F49", "problem_text_en": "A 34-year-old primigravida (G1P0) reported sensing ruptured membranes at 00:00 a.m. on her 37th week and 6th day of pregnancy and subsequently visited the hospital at 01:00 a.m. She received regular antenatal care since 8 weeks of gestation, and no notable abnormal findings were identified. Upon admission, it was discovered that amniotic fluid was draining out with no cloudiness. Upon internal examination, it was found that the cervix had dilated to 3 cm. The subsequent labour history is detailed below: 03:00 a.m. - uterine contractions at 10-minute intervals; cervix dilated to 5 cm. 10:00 a.m. - cervix fully dilated. 11:00 a.m. - delivery of a female infant weighing 2,850 grams. After the delivery of the infant, despite attempts to control postpartum hemorrhage with uterine massage and an oxytocin drip, the placenta was not naturally expelled. At 11:30 a.m., the placenta was extracted via manual removal. After the delivery of the placenta, the uterine contractions became normal, and the bleeding was successfully stopped. The amount of bleeding during delivery was 1,200 mL. Which of the following is correct?", "choices_en": ["Labor begins at midnight (12:00 AM).", "It is a timely rupture of membranes.", "The first stage of labor is 11 hours.", "The third stage of labor is 30 minutes.", "The amount of bleeding during delivery is within the normal range."], "answer": ["d"]}
{"problem_id": "113F50", "problem_text_en": "A 28-year-old woman, a primipara (G1P0), went into labor at 38 weeks and 4 days of gestation. The labor progressed smoothly and a vaginal delivery was achieved. No abnormalities were observed during the childbirth process, and the amount of bleeding after delivery was small, with good uterine contractions. The newborn was a male weighing 3,240 g, with no abnormalities in the neonatal course. The patient had a history of schizophrenia and has been taking multiple antipsychotic medications since the age of 24 years. As such, she does not wish to breastfeed her infant. Which medication is appropriate for inhibiting lactation?", "choices_en": ["Sulpiride", "Nifedipine", "Bromocriptine", "Metoclopramide", "Methylergonovine"], "answer": ["c"]}
{"problem_id": "113F51", "problem_text_en": "A 70-year-old man presents with leg swelling as the main complaint. He has been noted to have urinary protein and occult blood on health checkups for the past 30 years. He was told that his kidney function was poor three years ago, but did not seek medical attention. He came to the hospital because he became aware of leg swelling three months ago. He is 165 cm tall and weighs 60 kg. His pulse is regular at 92/min, and his blood pressure is 186/100 mmHg. Swelling is observed in both lower legs. Urine findings: protein 3+, glucose (-), occult blood 2+, dysmorphic red blood cells and granular casts are observed in the sediment. Urine protein/creatinine ratio is 2.5 g/g creatinine (reference value: <0.15) on spot urine testing. Blood test results: red blood cells 3.56 million, Hb 10.8 g/dL, Hct 32%, white blood cells 7,800, platelets 200,000. Serum biochemistry results: total protein 6.5 g/dL, albumin 3.0 g/dL, blood urea nitrogen 20 mg/dL, creatinine 1.6 mg/dL, eGFR 34 mL/min/1.73 m2, Na 138 mEq/L, K 4.0 mEq/L, Cl 104 mEq/L. Which of the following is appropriate dietary advice for him?", "choices_en": ["High protein diet", "Excessive fluid intake", "Potassium intake restriction", "A salt restriction of 10g per day", "Energy intake of 25-35kcal/kg/day"], "answer": ["e"]}
{"problem_id": "113F52", "problem_text_en": "A one-month-old infant is brought to the clinic by parents for the one-month health check. The infant was born at 38 weeks of gestation with a birth weight of 2,998g. The Apgar scores were 8 (1 minute) and 9 (5 minutes) respectively. The infant has been exclusively breastfed since birth and weighs 4,050g today. The baby moves limbs vigorously and exhibits fixation. Seven rashes, approximately 2-3 cm in size, are seen on the trunk and limbs. One of the rashes on the trunk is shown separately. The father has numerous vascular fibromas around the nose, but the mother has no rash. What is the appropriate response to the parents?\n\n", "choices_en": ["\"Let's apply antifungal medication.\"", "\"Let's do a cardiac echo test.\"", "\"The rash will disappear naturally.\"", "\"Let's take a chest x-ray\"", "\"There is a possibility of worsening of the rash (condition)\"."], "answer": ["b"]}
{"problem_id": "113F53", "problem_text_en": "A 68-year-old woman presented with complaints of general malaise, rash, and weakness in the limbs. A red rash appeared on her exposed skin three months ago. Three weeks ago, she started feeling general malaise and found it difficult to get up, stand, and raise her upper limbs. She visited the clinic due to the appearance of a rash all over her body and a loss of appetite that developed one week ago. Her temperature was 37.3℃, pulse rate was 92 bpm and regular, blood pressure was 122/88 mmHg, respiratory rate was 16 bpm, and SpO2 was 98% on room air. Redness was observed on her upper eyelids and forehead. She had diffuse erythema with scales and some erosion and crusting on her trunk and limbs. No abnormalities were observed in her oral mucosa. No abnormalities were heard in her heart sounds. Fine crackles were heard in both sides of her chest. The neck flexors and limb proximal muscles had a grade 4 on manual muscle testing. No abnormalities were observed in her urinalysis. Her laboratory test results were: RBC 4.16 million/μL, Hb 13.9 g/dL, Hct 39%, WBC 7,400/μL (neutrophils 70%, eosinophils 2%, basophils 1%, monocytes 13%, lymphocytes 14%), and platelets 180,000/μL. Biochemical test results were: total protein 7.0 g/dL, AST 137 U/L, ALT 55 U/L, LD 421 U/L (reference range 176-353), blood urea nitrogen 17 mg/dL, creatinine 0.6 mg/dL, and CK 2,010 U/L (reference range 30-140). Immunological test results were as follows: CRP 1.1 mg/dL, negative for antinuclear antibodies, anti-Mi-2 antibodies, and anti-MDA5 antibodies, and positive for anti-TIF1-γ antibodies. Chest CT scan revealed mild fibrotic changes localized in both lower posterior pleura. Skin rashes on the fingers and lower extremities (A, B) are shown separately. What is the most likely complication to occur in this patient?", "choices_en": ["Malignant tumor (cancer)", "Digital ulcer", "Dystrophic calcification", "Multiple mononeuropathy", "Ulcerative arthritis"], "answer": ["a"]}
{"problem_id": "113F54", "problem_text_en": "A 35-year-old man presents with right-sided chest pain. He has been feeling fatigued and experiencing right-sided chest pain for the past two days, and a rash has appeared in the same area since yesterday. He had a similar rash on his left abdomen two years ago. He had acute hepatitis B when he was 24 years old, but has no history of smoking or alcohol consumption. He is alert and oriented. His height is 165 cm, weight is 57 kg. His body temperature is 37.2°C, pulse rate is 96 beats/min and regular, blood pressure is 118/60 mmHg, and respiratory rate is 14 breaths/min. A picture of the rash is provided separately. What virus should be tested for antibodies?", "choices_en": ["HIV (Human Immunodeficiency Virus)", "EB virus (Epstein-Barr virus)", "Measles virus", "Rubella virus", "Coxsackie virus"], "answer": ["a"]}
{"problem_id": "113F55", "problem_text_en": "A 68-year-old woman has been experiencing frequent eye pain, seeing halos, and mild headaches for the past 5 months and came to the clinic for examination. Her visual acuity is 0.3 in the right eye (with +2.5D), and 0.2 in the left eye (with +3.0D). Her intraocular pressures are 19mmHg in the right eye and 24mmHg in the left eye. A slit-lamp photograph of her left eye is shown separately. What is the appropriate response?", "choices_en": ["Atropine eye drops", "Topical adrenal cortex steroid", "Highly concentrated diuretic infusion", "Laser iridotomy", "Vitreous surgery"], "answer": ["d"]}
{"problem_id": "113F56", "problem_text_en": "A one-year-old boy was admitted to the operating room for surgery to treat undescended testis. Anesthesia was induced slowly with a mask delivering oxygen and volatile anesthetics. After securing intravenous access and administering muscle relaxant for endotracheal intubation, his heart rate suddenly increased from 120/min to 160/min. Difficulties were encountered during intubation due to airway obstruction. After starting artificial ventilation, reddish-brown urine was seen draining from the inserted urinary catheter. Subsequently, his body temperature increased rapidly from 37.0℃ to 40.0℃. Metabolic acidosis was detected on arterial blood gas analysis. Which of the following is the most likely diagnosis?", "choices_en": ["Sepsis", "Hematuria", "Pyelonephritis", "Malignant hyperthermia", "Malignant syndrome"], "answer": ["d"]}
{"problem_id": "113F57", "problem_text_en": "A 64-year-old man was brought in by ambulance due to cardiac arrest. He collapsed suddenly at his workplace, and his colleagues called for an ambulance. Upon arrival of the ambulance, cardiac arrest was confirmed by the paramedics and cardiopulmonary resuscitation (CPR) was initiated. An AED was used for electric shock at the scene by the paramedics. While performing chest compressions, bag-valve mask ventilation, and electric shocks every two minutes, the patient was transported to the hospital. Upon arrival, the patient was moved from the ambulance stretcher to the treatment table while continuing chest compressions. What should be the next priority action to be taken?", "choices_en": ["Blood pressure measurement", "Tracheal intubation", "Electric shock", "Tap on the shoulder to check for response", "Observation of the waveform on an electrocardiogram (ECG) monitor."], "answer": ["e"]}
{"problem_id": "113F58", "problem_text_en": "A 2-month-old infant was brought to the hospital by the mother who noticed an abnormality in the anal region. The infant has two bowel movements per day and cries during defecation or diaper changes. The infant breastfeeds eight times a day and has good suckling ability. The infant has a body temperature of 37.0°C, a heart rate of 100 beats per minute with regular rhythm, a blood pressure of 80/50 mmHg, and a respiratory rate of 20 breaths per minute. The abdomen is mildly distended, and the liver is palpable 2 cm below the right costal margin. There are no abnormal bowel sounds. A photo of the anal region is shown separately. The area is soft to the touch and the infant is observed to be in pain. Which of the following is a correct explanation for the mother?", "choices_en": ["\"It is a congenital condition.\"", "This is a tumorous disease.", "\"The cause is bacterial infection\"", "\"It is caused by straining during defecation\"", "\"It occurs as a result of the anal fissure.\""], "answer": ["c"]}
{"problem_id": "113F59", "problem_text_en": "A newborn infant with a gestational age of 39 weeks and 3 days was delivered via spontaneous vaginal delivery. The infant did not cry at birth and required bag-mask ventilation due to apnea, despite stimulation of the skin. Bag-mask ventilation was discontinued after two minutes, when spontaneous breathing occurred. At five minutes after birth, the infant exhibited cyanosis throughout the body, a heart rate of 140 beats per minute, and a respiratory rate of 70 breaths per minute. Strong cough reflex occurred after nasal suction. The infant moved arms and legs vigorously. What is the Apgar score at five minutes after birth?", "choices_en": ["10 points", "8 points", "6 points", "4 marks (points)", "Two points"], "answer": ["b"]}
{"problem_id": "113F60", "problem_text_en": "A nulliparous woman (G1P0) at 34 weeks 1 day of gestation presents with decreased fetal movement. At the antenatal check-up two days ago, no abnormalities were noted. However, she has been aware of decreased fetal movement since yesterday and came to the hospital worried. She has no lower abdominal pain or uterine contractions, and no complaints of vaginal bleeding or a sense of ruptured membranes. Her pulse is 72 beats/minute and regular, blood pressure is 124/72 mmHg, and respiratory rate is 18 breaths/minute. The fetal heart rate tracing performed after admission is presented separately. What is the first thing that should be measured to evaluate fetal well-being?", "choices_en": ["Amniotic fluid index (AFI)", "Irregular maternal antibody titre", "Bilirubin concentration in amniotic fluid", "Fetal middle cerebral artery blood flow velocity", "Hemoglobin F concentration in maternal blood"], "answer": ["d"]}
{"problem_id": "113F61", "problem_text_en": "A 65-year-old man visited the hospital after an abnormal shadow was detected on his chest X-ray during a health checkup. He worked on inspecting and maintaining boilers in a factory from the age of 18 to 35, and then worked in agriculture. He has smoked 25 cigarettes per day for 40 years. He has a height of 163 cm, weight of 72 kg, body temperature of 36.3 ℃, pulse rate of 72 beats/min, regular rhythm, blood pressure of 102/68 mmHg, respiratory rate of 16 breaths/min, and oxygen saturation of 98% (room air). No abnormal heart sounds were detected, and respiratory sounds were weakened in both lower lung fields. Chest CT scan showed pleural plaques. Which of the following is the most likely substance that caused this condition?", "choices_en": ["Asbestos", "Organophosphorus", "Nitrogen dioxide", "Formaldehyde", "Polychlorinated biphenyl (PCB)"], "answer": ["a"]}
{"problem_id": "113F62", "problem_text_en": "A 72-year-old man presents with a complaint of back pain. He was diagnosed with multiple myeloma three years ago, and has received three different types of chemotherapy, but has never achieved remission. Two months ago, he developed lower back pain, rib pain, and lumbar pain and was treated with NSAIDs, however, the pain worsened, and he is now having difficulty moving indoors due to the pain, and spends most of the day lying in bed. His symptoms have worsened in the past few days, and he has developed poor appetite and vomiting. He is alert, and has a height of 172 cm, weight of 54 kg, and a temperature of 37.2℃. His pulse is 84 beats per minute and regular, blood pressure is 102/68 mmHg, performance status (PS) is 4. There is pallor of the conjunctivae, and a systolic ejection murmur at the right sternal edge in the second intercostal space. There is no subcutaneous bleeding in the limbs. Laboratory data: red blood cells 2.77 million/μL, hemoglobin 6.1 g/dL, hematocrit 26%, white blood cells 3,300/μL, platelets 40,000/μL. The blood chemistry shows a total protein of 11.5 g/dL, albumin 2.9 g/dL, IgG 8,450 mg/dL (reference range 960-1960), IgA 26 mg/dL (reference range 110-410), IgM 18mg/dL (reference range 65-350), total bilirubin 0.6 mg/dL, AST 23 U/L, ALT 17 U/L, LDH 325 U/L (reference range 176-353), ALP 420 U/L (reference range 115-359), blood urea nitrogen 30 mg/dL, creatinine 1.8 mg/dL, uric acid 9.2 mg/dL, Na 145 mEq/L, K 4.0 mEq/L, Cl 101 mEq/L, Ca 14.0 mg/dL. X-rays of the whole body show extensive bone lysis in both femurs and compression fractures of the 4th and 5th lumbar vertebrae. Which treatment should be considered at this time?", "choices_en": ["Platelet transfusion", "Autologous peripheral blood stem cell transplantation", "Administration of albumin preparation", "Administration of bisphosphonate medication", "Rehabilitation with the aim of independent walking"], "answer": ["d"]}
{"problem_id": "113F63", "problem_text_en": "A 34-year-old woman (G1P1) visited the obstetrics clinic where she had delivered 2 weeks ago, hoping to have a postpartum checkup. She had undergone vaginal delivery of a 3,150 g male infant as her first child 2 weeks prior. Her temperature on arrival was 36.5℃, and her pulse was 80 beats/min and regular. Her blood pressure was 126/76 mmHg. Her urine test showed negative for protein and sugar. Upon vaginal examination, there was no abnormality in the involution of the uterus, and lochia was normal. Although breastfeeding, she is very worried about whether she is doing it well and cannot sleep well at night. She does not enjoy childcare at all and sometimes feels like she wants to hurt herself. Her self-reported score on the Edinburgh Postnatal Depression Scale (EPDS) was 12 points (threshold: 8 or below). What are two appropriate responses at this point?", "choices_en": ["Prescribe antipsychotic medication.", "Suggest to have a consultation with a psychiatrist.", "Admission for the purpose of separating a child.", "To disclose patient information to municipal authorities with the patient's consent.", "Instruct to stop breastfeeding and switch to artificial milk feeding."], "answer": ["b", "d"]}
{"problem_id": "113F64", "problem_text_en": "An 83-year-old man is brought in by ambulance due to impaired consciousness. He had complained of dizziness during a long grass-cutting work on a summer day. He subsequently became drowsy, and his colleagues noticed and called an ambulance. He has a medical history of type 2 diabetes and hypertension and is currently on oral medications. His consciousness level is JCS III-100. His body temperature is 38.3℃, his heart rate is 120 beats per minute, regular, his blood pressure is 92/50 mmHg, and his respiratory rate is 24 breaths per minute. His SpO2 is 98% (under a mask with 5 L/min oxygen administration). His oral cavity is dry, and he has sweating all over his body. Blood findings show Hb 15.2 g/dL, Ht 53%. Blood chemistry shows Na 148 mEq/L, K 4.6 mEq/L, Cl 104 mEq/L, blood glucose 98mg/dL, urea nitrogen 30 mg/dL, and creatinine 1.2 mg/dL. Which fluids are appropriate for initial management? Select two.", "choices_en": ["Physiological saline solution", "Amino acid solution/supplement", "5% glucose solution", "High-calorie infusion", "Lactate Ringer's solution"], "answer": ["a", "e"]}
{"problem_id": "113F65", "problem_text_en": "A 52-year-old man was diagnosed with a 2 cm gastric cancer in the gastric vestibule on upper gastrointestinal endoscopy during an annual health screening. Which of the following are useful for determining the treatment strategy? Select two.", "choices_en": ["Magnifying endoscope", "Transnasal endoscopy", "Endoscopic ultrasound", "Capsule endoscopy", "Balloon endoscope"], "answer": ["a", "c"]}
{"problem_id": "113F66", "problem_text_en": "A 69-year-old man presented with fever and a sensation of fullness in the lower abdomen. He had been aware of difficulty urinating previously. A few days ago, he started experiencing frequent urination and pain during urination, and this morning he developed a sensation of fullness in the lower abdomen and a fever in the 38-degree range with fatigue, so he came to the hospital. Liver and spleen were not palpable in the abdomen. A sense of fullness was found in the lower abdomen. Prostate tenderness was observed on digital rectal examination. Urinalysis: protein 1+, glucose (-), ketones (-), occult blood 1+, sediment contains 5-9 red blood cells/HPF and 50-99 white blood cells/HPF. Blood test results: red blood cell count 4.35 million, Hb 13.6 g/dL, Hct 41%, white blood cell count 16,900, and platelets 160,000. Blood biochemistry: total protein 6.6 g/dL, albumin 4.1 g/dL, total bilirubin 0.6 mg/dL, AST 30 U/L, ALT 21 U/L, blood glucose 175 mg/dL, Na 141 mEq/L, K 4.1 mEq/L, Cl 105 mEq/L. CRP was 8.5 mg/dL. Select two options that should be considered as treatment at this point.\n\n", "choices_en": ["Nephrostomy procedure", "Administration of antibiotics", "Administration of anticholinergic drugs", "Insertion of a urinary catheter", "Administration of LH-RH agonist"], "answer": ["b", "d"]}
{"problem_id": "113F67", "problem_text_en": "A 50-year-old woman is accompanied by her husband, who is concerned about her decreasing activity level. Two months ago, she started sitting in a daze after waking up in the morning without being able to prepare breakfast. She stopped watching the news and reading newspapers, and although she went shopping, she would return without buying anything because she couldn't decide what to cook. Two weeks ago, she became unable to do household chores such as laundry and cleaning, so her husband took her to see a doctor. She is conscious and alert, and there are no abnormalities in her consciousness, recognition or memory. There are no abnormal physical findings. What are the expected complaints that this patient may have? Select two.", "choices_en": ["\"I am causing trouble for my family because of my own fault.\"", "\"I suddenly become completely blank in my mind\"", "\"I get emotional and teary-eyed when I watch TV dramas\"", "\"I feel creeped out as though there is some hidden meaning to things.\"", "\"I can no longer enjoy my hobbies or things that I used to like.\""], "answer": ["a", "e"]}
{"problem_id": "113F68", "problem_text_en": "Read the following passage and answer questions 68-70. \nA 65-year-old man was hospitalized for treatment of colorectal polyps. Present illness: One month ago, a polyp was pointed out by colonoscopy and endoscopic polypectomy was scheduled. Past history: Sinusitis for eight years, atrial fibrillation, hypertension and dyslipidemia for five years, and type 2 diabetes was diagnosed three years ago and he has been self-administering insulin before each meal. Personal history: Lives with his wife. He has no smoking history and drinks alcohol on occasion. Family history: His 5-years-older brother had angina at the age of 55. Current status: height 173 cm, weight 68 kg. Body temperature 36.1°C. Pulse rate 80/min, irregular. Blood pressure 140/74 mmHg. Respiratory rate 14/min. No pallor was observed in the palpebral conjunctiva. No abnormalities were detected in heart sounds or breath sounds. His abdomen was flat, soft, and no palpable liver or spleen. Which of the following medications should be given special attention when performing endoscopic polypectomy?\n\n", "choices_en": ["Blood pressure-lowering medication", "Antibiotics", "Anticoagulant medication", "Statins", "Antihistamine"], "answer": ["c"]}
{"problem_id": "113F69", "problem_text_en": "The patient had been fasting since morning on the day of treatment, and had taken bowel-cleansing solution to induce frequent bowel movements. She was then found crouching in the hallway of the hospital ward by a nurse. Present condition: the patient responds to calls. Body temperature is 36.2°C. Pulse rate is 96/minute and irregular. Blood pressure is 146/84 mmHg. Respiratory rate is 20/minute. No anemia is evident in the conjunctiva. The face is pale and sweating is observed. No jugular vein distension is observed. No abnormalities are found in heart sounds or breath sounds. The abdomen is flat and soft. No blood in the stool is observed. No paralysis or relaxation is found in the limbs. The simple blood glucose measurement was 45 mg/dL and 50% glucose 20mL was administered intravenously. Which of the following is not an appropriate response?", "choices_en": ["Emergency endoscopy", "Explanation to the family", "12-lead electrocardiogram", "Re-examination of blood glucose levels", "Re-evaluation of vital signs"], "answer": ["a"]}
{"problem_id": "113F70", "problem_text_en": "After confirming with the nurse, it was found out that the patient had fasted in the morning, but the insulin injection was carried out as directed by the doctor. Which of the following is an inappropriate response in this situation?", "choices_en": ["Explained the incident to the patient.", "I saved the recorded monitoring electrocardiogram at the time of the incident.", "Shared the contents of the incident with the pharmacist.", "Recorded the details of the incident in the medical record.", "Left the submission of an incident report to a nurse."], "answer": ["e"]}
{"problem_id": "113F71", "problem_text_en": "Read the following passage and answer questions 71 to 73.\n\nA 80-year-old woman complains of loss of appetite. Present illness: feeling unwell since yesterday morning with appearance of cold sweats and dyspnea as well as decreased appetite. She was unable to sleep well last night. She still experienced the same symptoms today, but she insists that she is alright. Her husband, who lives with her, is worried and accompanied her to get medical care. Past history: osteoarthritis of the knee joints, hypertension, and type 2 diabetes. Blood sugar control was good. Personal history: living with her husband alone. Active daily living is almost independent but needs a cane when walking. She used to smoke 20 cigarettes a day for 50 years until ten years ago. She drinks occasionally. Family history: her father died of stroke, her sister has diabetes. Current findings: conscious and clear. Height of 155 cm, weight of 44 kg. Body temperature of 36.0°C. Pulse rate of 100/min and regular. Blood pressure of 114/60 mmHg. Respiration rate of 18/min. SpO2 of 98% (in room air). No abnormalities were observed in the eyelids, conjunctiva, or eyeballs. No abnormalities were detected in heart sounds and breath sounds. The abdomen is flat and soft with no palpable liver or spleen. Mild bilateral lower leg edema was observed. Slight decrease in both Achilles tendon reflexes. No decrease in vibration sensation of the lower limbs. Laboratory findings: urinalysis: 2+ protein and + glucose. Blood analysis: 4.04 million red blood cells, Hb 12.4 g/dL, Hct 37%, 15,000 white blood cells, and 230,000 platelets. Blood biochemistry: total protein 6.9 g/dL, albumin 3.6 g/dL, AST 71 U/L, ALT 21 U/L, γ-GTP 24 U/L (reference range 8-50), LD 419 U/L (reference range 176-353), CK 450 U/L (reference range 30-140), CK-MB 42 U/L (reference range less than 20), blood sugar 234 mg/dL, HbA1c 6.2% (reference range 4.6-6.2), blood urea nitrogen (BUN) 18 mg/dL, creatinine (Cr) 0.9 mg/dL, Na 140 mEq/L, K 4.0 mEq/L, Cl 102 mEq/L. CRP is 0.1 mg/dL. A 12-lead electrocardiogram (ECG) shows sinus rhythm with ST elevations in leads V1-V3, and ST depressions in leads II, III, aVF, and V5-V6. Imaging findings: chest X-ray shows a cardiothoracic ratio of 56%, no enhancement of pulmonary blood vessels, and no dullness of the bilateral rib-diaphragm angle. What is the most likely cause?", "choices_en": ["Pulmonary emphysema", "Acute coronary syndrome", "Pulmonary embolism", "Hyperthyroidism", "Superior mesenteric artery thrombosis"], "answer": ["b"]}
{"problem_id": "113F72", "problem_text_en": "What could be the reasons for the discrepancy between blood glucose levels and HbA1c?", "choices_en": ["Smoking history", "Zinc deficiency", "Liver dysfunction", "Leukocytosis", "Acute hyperglycemia"], "answer": ["e"]}
{"problem_id": "113F73", "problem_text_en": "The patient was transferred to a general ward after a week of intensive care unit management and required an additional three weeks of hospitalization. Vital signs were stable and the patient was able to consume all meals, but due to pain from osteoarthritis of the knee, rehabilitation could not be fully performed, resulting in almost complete bed rest. A Mini-Mental State Examination (MMSE) was conducted after transfer to the general ward and scored 28 out of 30 points. On the last night before discharge, the patient fell while returning to the room from the bathroom. Which of the following is unlikely to be a factor in the fall?", "choices_en": ["Knee osteoarthritis", "Long-term bedrest", "Orthostatic hypotension", "Cognitive dysfunction", "Diabetic neuropathy"], "answer": ["d"]}
{"problem_id": "113F74", "problem_text_en": "Read the following text and answer questions 74-76. A 70-year-old man presents to the clinic with complaints of dyspnea on exertion. His medical history includes a resection surgery for mediastinal tumor 4 years ago, which was diagnosed as soft tissue sarcoma on pathological examination. He received Adriamycin for 2 months for lung metastases 2 years ago and has had no progression since then. He has been experiencing fatigue for the past month and dyspnea on exertion for several days. He has gained 3 kg in the past 3 months. His past medical history is significant for hypertension, which he has been treating with medication since he was 45 years old. He smoked 20 cigarettes per day from 20 to 33 years of age and drinks alcohol on occasion. His mother died from lung cancer. Upon physical examination, he is alert and oriented. His height is 172 cm and weight is 63 kg, and his vital signs are: temperature 36.5℃, pulse rate 80/min, regular, blood pressure 164/78 mmHg, respiratory rate 18/min. There are no abnormalities in the conjunctiva or sclera. No jugular venous distension is observed. There is a surgical scar on the midline of his sternum from previous surgery. A grade III murmur is heard, but no abnormal heart sounds are detected. His lung sounds are normal. His abdomen is flat, soft, and no liver or spleen is palpable. No coolness is noted in his peripheral limbs, but bilateral lower leg edema is observed. Laboratory findings are: RBC 3.99 million/μL, Hb 11.6 g/dL, Ht 38%, WBC 4000 /μL, platelet count 160,000/μL, total protein 6.2 g/dL, albumin 3.6 g/dL, AST 62 U/L, ALT 81 U/L, LD 251 U/L (reference range: 176-353), blood urea nitrogen 14 mg/dL, creatinine 0.6 mg/dL, blood glucose 97 mg/dL, Na 142 mEq/L, K 4.4 mEq/L, Cl 108 mEq/L, brain natriuretic peptide (BNP) 696 pg/mL (reference range: less than 18.4), troponin T 0.14 (reference range: less than 0.01), CK-MB 5 U/L (reference range: 20 or less), and CRP 0.3 mg/dL. Arterial blood gas analysis (room air) reveals pH 7.4, PaCO2 38 Torr, PaO2 83 Torr, and HCO3 24 mEq/L. On chest X-ray, the cardiothoracic ratio is 53% 3 months ago and 58% on admission. His electrocardiogram (ECG) shows high voltage and slight ST depression in V5 and V6. A cardiac echo examination from 1 year ago was normal. A cardiac echo examination on presentation reveals diffuse wall motion abnormality of the left ventricle, with an ejection fraction of 35%. What is the most likely cause of his symptoms?\n\n症状の原因として最も考えられるのはどれか。\nWhat is the most likely cause of his symptoms?\n\nPossible answer:\n心筋症と肺高血圧症の両方が関与する心肺疾患。", "choices_en": ["Pericarditis", "Acute myocardial infarction", "Dilated cardiomyopathy", "Infective endocarditis.", "Drug-induced myocardial damage"], "answer": ["e"]}
{"problem_id": "113F75", "problem_text_en": "Which are the current treatment options? Choose three.", "choices_en": ["Beta blocker", "Digitalis", "Loop diuretics", "Cephalosporin antibiotics", "Angiotensin converting enzyme (ACE) inhibitors"], "answer": ["a", "c", "e"]}
{"problem_id": "113F76", "problem_text_en": "Which of the following does not require continuous evaluation during drug treatment for heart failure?", "choices_en": ["Body weight", "Heart rate", "CK-MB (creatine kinase-MB)", "Left ventricular ejection fraction", "Brain natriuretic peptide (BNP)"], "answer": ["c"]}
{"problem_id": "113F77", "problem_text_en": "Read the following passage and answer questions 77-79. \n\nA 58-year-old woman presents with a chief complaint of hemoptysis. She reports a history of cough, sputum production, and dyspnea on exertion over the past few years, which she attributed to her smoking habit and did not seek medical attention until she started coughing up blood a few days ago. She had a surgical repair of her right patellar fracture from a motor vehicle accident at age 20. She smoked 40 cigarettes per day from the age of 20 to 55 years and drinks occasionally with meals. There is no significant family history. \n\nHer vital signs are stable with a heart rate of 80 beats/min, blood pressure of 132/74 mm Hg, respiratory rate of 16 breaths/min, and room air oxygen saturation of 97%. Physical examination demonstrates coarse crackles in her right lung base, and her abdomen is flat, soft, and nontender, without hepatosplenomegaly or lymphadenopathy noticed on palpation. Laboratory results reveal a hemoglobin level of 9.8 g/dL, white blood cell count of 10,300/μL, and a platelet count of 300 × 10^3/μL.\n\nWhich of the following is an accurate description of changes in the patient's flow-volume curve compared to when she underwent surgery for her patellar fracture at age 20? \n\n- (A) Her current flow-volume curve shows a decreased peak expiratory flow rate (PEFR).\n- (B) Her current flow-volume curve depicts a decrease in both inspiratory and expiratory maneuvers.\n- (C) Her current flow-volume curve exhibits only decreased expiratory flow rate.\n- (D) Her current flow-volume curve is within normal limits and does not differ from her peak flow-volume at age 20. \n\nNote: There are no specific details in the passage to provide a definite answer.", "choices_en": ["Increase in $\\dot{V}$25 (ventilation volume at tidal volume)", "Decrease in residual volume", "Increase in lung diffusion capacity", "Decrease in effort vital capacity", "Increase in peak flow"], "answer": ["d"]}
{"problem_id": "113F78", "problem_text_en": "Which of the following explanations given to the patient about the biopsy results is incorrect, in which all findings show lung adenocarcinoma?", "choices_en": ["Recovery is difficult.", "Genetic testing of the tumor is necessary.", "Chemotherapy is indicated for cancer treatment.", "You can receive a second opinion.", "Palliative care should begin after the completion of cancer treatment."], "answer": ["e"]}
{"problem_id": "113F79", "problem_text_en": "After hearing the explanation, the patient wished to make a decision after consulting with their family and scheduled a follow-up appointment for one week later. However, the day before this appointment, the patient experienced three episodes of cough with hemoptysis of about 30-50 mL each time, associated with increased coughing. On the day of the appointment, the patient has frequent coughing but no hemoptysis, and reddish-brown blood is visible in the sputum. The patient's pulse is 104 beats per minute and regular, blood pressure is 140/88 mmHg, respiratory rate is 12/minute, and SpO2 is 96% on room air. The blood test shows a red blood cell count of 3.39 million, Hb of 9.5 g/dL, Ht of 29%, white blood cell count of 8,900, and platelet count of 290,000. What is the first thing to do in response?", "choices_en": ["Red blood cell fluid - LR transfusion", "Administration of cough medicine", "Administration of iron supplement", "Oxygen administration", "Fluid replacement therapy"], "answer": ["b"]}
{"problem_id": "113F80", "problem_text_en": "Read the following passage and answer questions 80 to 82. \n\nA 67-year-old man was brought in by ambulance due to sudden difficulty with swallowing. Medical history: Today, during lunch, the patient suddenly felt pain in the back of his head, dizziness, and nausea, and vomited. After lying down for a while and being called by his wife, he noticed that his voice was hoarse and difficult to speak. He tried to drink water but choked and could not swallow it. Worried, his wife called an ambulance. Past history: Hypertension since age 40. Lifestyle: Living with wife. Smoked 10 cigarettes a day for 45 years. Occasional alcohol consumption. Current symptoms: Consciousness clear. Height 165 cm, weight 60 kg. Body temperature: 36.6°C. Heart rate: 72/min, regular. Blood pressure: 160/90 mmHg. Respiratory rate: 12/min. SpO2: 97% (with mask 4 L/min oxygen inhalation). No palpable thyroid gland or cervical lymph nodes. No abnormalities in heart sounds or breath sounds. Flat and soft abdomen, no palpable liver or spleen. Neurological examination reveals no limitation of eye movement or diplopia, but speech and swallowing disorders are observed. Warm and painful sensation is reduced in the left upper and lower extremities. No abnormalities are observed in tendon reflexes, and the Babinski sign is negative. Test results: Blood test results: Red blood cell count: 4.52 million, Hb: 13.1 g/dL, Ht: 40%, white blood cell count: 5,300, platelet count: 320,000. Blood biochemistry results: Total protein: 8.1 g/dL, albumin: 4.2 g/dL, total bilirubin: 1.0 mg/dL, AST: 15 U/L, ALT: 18 U/L, LD: 280 U/L (reference range 176-353), ALP: 213 U/L (reference range 115-359), γ-GTP: 18 U/L (reference range 8-50), CK: 50 U/L (reference range 30-140), blood urea nitrogen: 20 mg/dL, creatinine: 0.7 mg/dL, uric acid: 4.2 mg/dL, blood glucose: 82 mg/dL, triglycerides: 185 mg/dL, HDL cholesterol: 40 mg/dL, LDL cholesterol: 200 mg/dL, Na: 145 mEq/L, K: 3.9 mEq/L, and Cl: 104 mEq/L. CRP: 0.2 mg/dL. Diffusion-weighted MRI image of the head is shown separately. What is the most likely condition observed in this patient?", "choices_en": ["Left cerebellar ataxia", "Left facial hypoalgesia (diminished sense of pain)", "Right Horner's syndrome", "Motor paralysis of the right upper and lower limbs", "Decreased vibration sensation in the right upper and lower extremities"], "answer": ["c"]}
{"problem_id": "113F81", "problem_text_en": "Which test is most likely to indicate an abnormality?", "choices_en": ["Brain waves", "Hearing test", "Visual evoked potential", "Ocular movement test", "Nerve conduction studies (NCS)"], "answer": ["d"]}
{"problem_id": "113F82", "problem_text_en": "What is the appropriate response at the time when aspiration of the contrast agent was observed on the swallow test performed after admission?", "choices_en": ["Gastrostomy", "Aphasia training", "Nasogastric tube feeding", "Esophageal voice training", "High-calorie intravenous fluid"], "answer": ["c"]}
{"problem_id": "113F83", "problem_text_en": "What is expected in the early shock of extensive burns?\n\nCardiac output\nCentral venous pressure\nSystemic vascular resistance\n\n\na\n↑\n↑\n↑\n\n\nb\n↑\n↑\n↓\n\n\nc\n↑\n↓\n↑\n\n\nd\n↑\n↓\n↓\n\n\ne\n↓\n↑\n↑\n\n\nf\n↓\n↑\n↓\n\n\ng\n↓\n↓\n↑\n\n\nh\n↓\n↓\n↓", "choices_en": ["I cannot translate \"ａ\" without more context. In Japanese, this character does not carry any meaning on its own. Please provide more information or context so I can give an accurate translation.", "It is not possible to translate this choice into English without additional context. It could refer to anything from a letter of the alphabet to a specific technical term.", "I'm sorry, but the choice you provided is incomplete. Please provide complete information so that I can assist you better.", "I'm sorry, but just \"ｄ\" without any context or additional information cannot be accurately translated. Could you please provide more context or the full question in which \"ｄ\" appears?", "This is not a complete choice and does not provide any context to determine its meaning. Please provide more information or context for accurate translation.", "Sorry, but \"ｆ\" alone doesn't provide enough context to accurately provide a translation for it as a multiple-choice question choice. Please provide more information.", "g (gram)", "I'm sorry, \"ｈ\" on its own is unclear and could potentially be a typo. Can you please provide more context or information?"], "answer": ["g"]}
{"problem_id": "113F84", "problem_text_en": "In the 19th century, a disease outbreak occurred in London that was later identified as cholera and was accompanied by severe diarrhea. Epidemiologist John Snow suspected a relationship with the drinking water and conducted a detailed investigation. The summary of the investigation results are shown below. Note that A and B refer to the different water supply sources with different water systems.\n\nWater Supply\nDeaths (people)\nPopulation (people)\n\nA\n810\n150,000\n\nB\n18\n24,000\n\nCalculate the risk ratio of deaths from this disease associated with A compared to B. Round to the third decimal place in case of obtaining a number with more decimal places. Answer: ①. ② ③.", "choices_en": [], "answer": ["7.20"]}
