{"problem_id": "113C1", "problem_text_en": "What international organization is primarily focused on promoting Universal Health Coverage (UHC)?", "choices_en": ["ILO (International Labor Organization)", "World Health Organization", "JICA (Japan International Cooperation Agency)", "OECD (Organization for Economic Cooperation and Development)", "The Joint United Nations Programme on HIV/AIDS (UNAIDS)"], "answer": ["b"]}
{"problem_id": "113C2", "problem_text_en": "Which of the following statements is correct about the medical accident investigation system?", "choices_en": ["The survey is only conducted by outside institutions.", "All deaths caused by medical treatment are included.", "In case of an accident, promptly report it to the police from a medical institution.", "Until the investigation is concluded, medical institutions must not explain the accident to the bereaved families.", "It is a system aimed at preventing recurrence of medical accidents to ensure medical safety."], "answer": ["e"]}
{"problem_id": "113C3", "problem_text_en": "Which of the following is not included as a component of \"Activities and Participation\" in the International Classification of Functioning, Disability and Health (ICF)?", "choices_en": ["Activity", "Environment", "Participation", "Psychosomatic functions.", "Body structure"], "answer": ["b"]}
{"problem_id": "113C4", "problem_text_en": "What information is necessary to determine the proportion of out-of-pocket expenses in the late-stage elderly medical care system?", "choices_en": ["Assets", "Place of residence", "Degree of care required (in reference to elderly or disabled individuals needing assistance with daily living activities)", "Family composition", "Previous year's income"], "answer": ["e"]}
{"problem_id": "113C5", "problem_text_en": "Which of the following is correct about collaboration between hospitals/clinics and pharmacies?", "choices_en": ["If a pharmacist receives a report from a patient about a mistake in taking medication, they should inform the doctor.", "Pharmacists can provide medication guidance to patients under the instruction of nurses.", "Medical social workers cannot access medication notebook information.", "The prescription contains the name of the drug and the name of the disease.", "Pharmacists can modify prescriptions at their own discretion."], "answer": ["a"]}
{"problem_id": "113C6", "problem_text_en": "Which of the following statements is true regarding medical care in remote areas?", "choices_en": ["The Disaster Medical Assistance Team (DMAT) is established for each city and town.", "Local medical clinics/hospitals are established for each primary medical care area.", "The healthcare plan for underpopulated areas is formulated by regional medical support hospitals.", "Remote medical facilities play a role in dispatching substitute doctors.", "Mobile medical vehicles are dispatched from regional emergency medical centers to remote areas."], "answer": ["d"]}
{"problem_id": "113C7", "problem_text_en": "The following shows the frequency of maternal deaths in Japan from 2010 (Heisei 22) to 2016 (Heisei 28) by cause (source: Regional Medical Infrastructure Development Promotion Research Project [FY 2016 Health and Labor Sciences Research Grant]). Which is ①? However, ① to ⑤ correspond to either a to e.", "choices_en": ["Infectious disease", "Pulmonary embolism", "Obstetric hemorrhage", "Cardiovascular disease", "Cardiopulmonary collapse type of amniotic fluid embolism"], "answer": ["c"]}
{"problem_id": "113C8", "problem_text_en": "Which of the following is correct about mental health?", "choices_en": ["The number of patients admitted to the hospital for protective care is increasing every year.", "Psychiatric day care is covered by medical insurance.", "Certification of a designated psychiatrist in mental health is recognized by an academic society.", "Mental health and welfare centers are established in each city and town.", "Rehabilitation facility for mentally handicapped individuals that provides training for social reintegration of inpatients."], "answer": ["b"]}
{"problem_id": "113C9", "problem_text_en": "Which of the following is the appropriate handling method for foods to prevent botulism food poisoning?", "choices_en": ["Perform vacuum preservation.", "Perform ultraviolet irradiation.", "Heat at 120℃ for 4 minutes.", "Store at a temperature below 20℃.", "Make it pH 8 or higher."], "answer": ["c"]}
{"problem_id": "113C10", "problem_text_en": "What are the substances targeted by the environmental standards for air pollution?", "choices_en": ["Lead", "Cadmium", "Sulfur dioxide", "Alkyl mercury compounds", "Polyvinyl alcohol"], "answer": ["c"]}
{"problem_id": "113C11", "problem_text_en": "What is innervated by the trigeminal nerve?", "choices_en": ["Frontalis muscle", "Temporalis muscle", "Orbicularis oculi muscle", "Orbicularis oris muscle", "Splenius muscle"], "answer": ["b"]}
{"problem_id": "113C12", "problem_text_en": "Which of the following is correct regarding digestive and absorptive functions in the gastrointestinal tract?", "choices_en": ["Obstructive jaundice does not affect stool color.", "Digestion is unnecessary for the absorption of protein.", "Dietary fiber does not affect the absorption of sugar.", "Medium-chain fatty acids are transported to the lymphatic vessels.", "Bile acids are necessary for the absorption of long-chain fatty acids."], "answer": ["e"]}
{"problem_id": "113C13", "problem_text_en": "Which of the following is correct regarding ultrasound findings during pregnancy?", "choices_en": ["The gestational sac is recognized at 3 weeks of pregnancy.", "Fetal heartbeat can be confirmed at 4 weeks of pregnancy.", "The fetal heart rate at 9 weeks of pregnancy is 160-180 beats per minute.", "Correcting the estimated delivery date based on the biparietal diameter (BPD) at 10 weeks of gestation.", "Physiological umbilical hernia can be observed at 15 weeks of pregnancy."], "answer": ["c"]}
{"problem_id": "113C14", "problem_text_en": "What is the earliest adverse effect that appears in radiation therapy for nasopharyngeal cancer?", "choices_en": ["Mucositis", "Cataract", "Salivary gland disorder", "Radiation pneumonitis", "Radiation-induced cancer"], "answer": ["a"]}
{"problem_id": "113C15", "problem_text_en": "The 3D CT images of the patient's facial bones taken immediately after being struck in the face are shown separately. What symptoms are likely to be considered?", "choices_en": ["Hoarseness", "Nasal congestion", "Trismus (Limitation of mouth opening)", "Malocclusion", "Facial nerve paralysis"], "answer": ["c"]}
{"problem_id": "113C16", "problem_text_en": "Which disease causes hypocomplementemia?", "choices_en": ["Giant cell arteritis", "Cryoglobulinemic vasculitis", "Polyarteritis nodosa", "Microscopic polyangiitis", "Takayasu's arteritis (an inflammatory disease that affects the aorta and its branches)"], "answer": ["b"]}
{"problem_id": "113C17", "problem_text_en": "Which of the following options are categorized as primary prevention? Select two.", "choices_en": ["Cancer screening for residents", "Rehabilitation after cerebral infarction/stroke", "Occupational therapy for people with mental disorders", "Use of condoms for prevention of sexually transmitted infections", "Human papillomavirus (HPV) vaccination"], "answer": ["d", "e"]}
{"problem_id": "113C18", "problem_text_en": "Which of the following is true about the changes in the population statistics of our country over the past 20 years? Select two.", "choices_en": ["The infant mortality rate is on the rise.", "The natural increase/decrease turned negative.", "The elderly population index is declining.", "The number of fatalities in traffic accidents is on a decreasing trend.", "The age-adjusted mortality rate of malignant neoplasms is on the rise."], "answer": ["b", "d"]}
{"problem_id": "113C19", "problem_text_en": "Which of the following are associated with magnesium deficiency? Select two.", "choices_en": ["Hair loss", "Arrhythmia", "Dermatitis", "Tetanus", "Taste disturbance"], "answer": ["b", "d"]}
{"problem_id": "113C20", "problem_text_en": "Which combination of community healthcare, medical, welfare, and caregiving organizations and their functions is correct? Select two.", "choices_en": ["Child consultation center --------- Consultation for treatment and education of children with developmental disabilities", "Local hygiene research institute --------- investigation and cause clarification of medical accidents", "Social welfare council - Reception of applications for public assistance.", "Municipal public health center - designation as a designated provider of independent support medical services.", "Regional inclusive support center ------- Protection of elderly abuse victims."], "answer": ["a", "e"]}
{"problem_id": "113C21", "problem_text_en": "Which of the following are observed in acute appendicitis? Choose two.", "choices_en": ["Blumberg sign (also known as rebound tenderness)", "Courvoisier's sign/syndrome", "Grey-Turner's sign", "Murphy's sign", "Rosenstein sign/syndrome."], "answer": ["a", "e"]}
{"problem_id": "113C22", "problem_text_en": "Which of the following statements are true regarding the care of terminal cancer patients? Select two.", "choices_en": ["Also provide care to the family.", "To avoid thinking about death.", "To renew hope for possibilities of natural healing and new drug discoveries.", "Develop a care plan that takes into consideration the social role played by the patient.", "Prioritizing care by medical staff over visits with family members."], "answer": ["a", "d"]}
{"problem_id": "113C23", "problem_text_en": "What are two characteristics of the endocrine system in elderly individuals?", "choices_en": ["Decreased gonadotropin secretion", "Excessive cortisol secretion", "Increased insulin resistance", "Decreased secretion of thyroxine (a thyroid hormone)", "Decreased renin secretion"], "answer": ["c", "e"]}
{"problem_id": "113C24", "problem_text_en": "Which of the following includes the parasympathetic nervous system? Choose three.", "choices_en": ["Oculomotor nerve", "Trigeminal nerve", "Facial nerve", "Vagus nerve", "Sublingual nerve"], "answer": ["a", "c", "d"]}
{"problem_id": "113C25", "problem_text_en": "An 80-year-old male is hospitalized due to aspiration pneumonia, left hemiplegia caused by a cerebral infarction, vascular dementia, and sacral pressure sores. He is bedridden and has difficulty with oral intake, so he is receiving enteral nutrition via a nasal feeding tube. His pneumonia has improved with antibiotic treatment, and it has been decided to provide the doctor responsible for home medical care with clinical information and consult with the discharge support team to prepare for discharge to his home. What is the appropriate response?", "choices_en": ["Discontinue intervention by the pressure ulcer team.", "Arrange for suction equipment to be prepared at home.", "A nurse instructs a family member on the insertion of a gastric tube.", "The attending physician will create a care plan for after discharge.", "The care manager teaches the family how to perform sputum suction."], "answer": ["b"]}
{"problem_id": "113C26", "problem_text_en": "A 70-year-old man presented with dyspnea on exertion. He had been aware of feeling breathless with exertion for the past 10 years, but it gradually worsened and he sought medical attention. He has no history of wheezing. He has smoked 40 cigarettes a day for the past 50 years. His pulse rate is 72 beats/min and regular. Blood pressure is 128/74 mmHg. Respiratory rate is 16 breaths/min. There are no abnormalities in his heart and breath sounds. Pulmonary function testing reveals a decreased forced expiratory volume in 1 second (FEV1), but there is no improvement in FEV1 after inhalation of a β2-stimulating drug. Chest X-ray (A) and chest CT (B) are shown separately. Which of the following is not an appropriate response?", "choices_en": ["Smoking cessation counseling", "23-valent pneumococcal vaccine administration", "Influenza vaccine administration", "Long-acting anticholinergic drug administration", "Leukotriene receptor antagonist administration"], "answer": ["e"]}
{"problem_id": "113C27", "problem_text_en": "A 40-year-old man came to the clinic after seeing a rubella prevention poster. He has not received the rubella vaccine and his infection history is not clear. He is healthy with no significant medical history. He wants to receive the vaccine. Which of the following statements is correct?", "choices_en": ["It is highly possible that immunity has been acquired and vaccination is not necessary.", "If administering another vaccine, space it out by at least one week.", "Due to the high possibility of side effects, vaccination should be avoided.", "Measuring antibody levels is not mandatory for vaccination.", "Adult vaccination can also be done orally."], "answer": ["d"]}
{"problem_id": "113C28", "problem_text_en": "A 28-year-old man visited the company physician after requesting a consultation. He was selected as a high-stress individual during workplace stress checks, and was advised to have a counseling session. Three months ago, he had a regular health examination which revealed a height of 172cm, weight of 65kg, and blood pressure of 136/88mmHg; no abnormalities were found on blood tests or biochemical tests. He has no noteworthy medical history. Four months ago, he was transferred to a new department and was assigned to handle external negotiations, which he had no previous experience in. He was having trouble getting used to his new role. Communication with his superiors and colleagues was scarce, and his workload increased, requiring him to work overtime and on holidays. Over the past month, he has found it difficult to stop thinking about work even on holidays, and has had trouble falling asleep at night and getting up in the morning, resulting in frequent tardiness. His current weight is 62kg and blood pressure is 142/92mmHg. Recently, he and his wife have been having frequent fights. He believes that the cause of his stress is the unwelcome job transfer and strongly hopes that he can be transferred again. What is the appropriate action for the company physician to take first?", "choices_en": ["Instruct to visit a psychiatrist and terminate the interview.", "Inquire only about work-related stress.", "Propose a three-party discussion involving the supervising manager to the person concerned.", "Submit a written opinion to the business operator immediately so that it can be transferred.", "Immediately allow the personnel in charge to review the results of the stress check."], "answer": ["c"]}
{"problem_id": "113C29", "problem_text_en": "A 29-year-old woman (Gravida 2, Para 0) had been receiving antenatal care at hospital A near her home, but now at 32 weeks of gestation, she has come to the hospital with the intention of giving birth at her parents' home. She had previously undergone a medical abortion at 9 weeks of gestation when she was 24 years old. She started living with her parents two days ago and plans to return home two months after delivery. She is 163 cm tall, weighs 66 kg, and has a body temperature of 36.5℃, a pulse rate of 84 beats per minute and regular, and a blood pressure of 134/76 mmHg. Her fundal height is 29 cm, and abdominal circumference is 83 cm. No edema is observed in the lower leg. Urinalysis shows protein(±) and sugar(±), and her blood test shows 3.8 million RBC, Hb 11.8 g/dL, Hct 34%, 9,800 WBC, and 160,000 platelets. Abdominal ultrasound examination shows that the fetus is in a cephalic position without any malformations, with an estimated weight of 1,800 g, the placenta is attached to the lower part of the uterus, and the amniotic fluid index (AFI) is 10.8 cm. What is the most appropriate response, considering her medical history and examination findings, and her maternity and child health handbook?", "choices_en": ["Administer iron supplements.", "Perform a cesarean section.", "Evaluate the biophysical profile score (BPS).", "Instruct to receive a prenatal health checkup after two weeks.", "Perform oral glucose tolerance test (75g OGTT)."], "answer": ["d"]}
{"problem_id": "113C30", "problem_text_en": "A 72-year-old woman presents to the emergency department with lower abdominal pain and bloody stool. She experienced a sudden onset of lower abdominal pain and diarrhea before going to bed last night. After several episodes of diarrhea, she had bloody stool, which led her to seek medical attention. She has a history of diabetes and hypertension for the past 20 years and regularly visits a local clinic. The patient is conscious and alert. Her temperature is 37.2°C, blood pressure is 142/92 mmHg, heart rate is 96 beats per minute, and respiratory rate is 20 breaths per minute. Her pulse oximetry on room air is 96%. On examination, her abdomen is flat, and she experiences spontaneous pain and tenderness in the left lower quadrant. No muscular defense is detected. Her blood test results show a red blood cell count of 3.8 million/μL, hemoglobin level of 11.4 g/dL, and hematocrit level of 39%. Her white blood cell count is 11,200, with 4% neutrophils, 55% segmented neutrophils, 2% eosinophils, 7% monocytes and 32% lymphocytes. Her platelet count is 230,000/μL. Her blood biochemistry shows total protein level of 6.9 g/dL, albumin level of 3.8 g/dL, total bilirubin level of 0.9 mg/dL, aspartate aminotransferase level of 24 U/L, alanine aminotransferase level of 27 U/L, lactate dehydrogenase level of 267 U/L (normal range 176-353), amylase level of 60 U/L (normal range 37-160), blood urea nitrogen level of 21 mg/dL, creatinine level of 1.1 mg/dL, uric acid level of 6.6 mg/dL, blood glucose level of 138 mg/dL, glycated hemoglobin of 6.9% (normal range 4.6-6.2), sodium level of 141 mEq/L, potassium level of 4.4 mEq/L and chloride level of 99 mEq/L. C-reactive protein level is 2.1 mg/dL. Arterial blood gas analysis on room air reveals a pH of 7.41, PaCO2 of 36 Torr, PaO2 of 90 Torr and HCO3- level of 24 mEq/L. What is the most likely diagnosis for the patient?", "choices_en": ["Ischemic enteritis", "Drug-induced enteritis", "Perianal abscess", "Eosinophilic gastroenteritis", "Superior mesenteric artery occlusion"], "answer": ["a"]}
{"problem_id": "113C31", "problem_text_en": "A 70-year-old man presents to the hospital due to renal dysfunction. He has been diagnosed with urinary protein and occult blood on annual health check-ups for the past 20 years. Renal dysfunction has been identified since 5 years ago. During a routine examination 2 months ago, his renal function had further deteriorated and he was advised to prepare for renal replacement therapy. At 55 years of age, he had a history of acute myocardial infarction and has left ventricular systolic dysfunction (left ventricular ejection fraction of 35%). He is taking aspirin and angiotensin-converting enzyme (ACE) inhibitors and beta-blockers. At 61 years of age, he had spleen removal and partial small bowel resection due to a traffic accident, and has had two surgical histories due to adhesive ileus since then. At 65 years of age, he was diagnosed with diabetes and has been taking oral hypoglycemic agents. He measures 160 cm in height and weighs 80 kg. His pulse rate is 72 beats per minute and regular. His blood pressure is 120/86 mmHg. His abdomen is flat and soft, and there are surgical scars from the epigastric region to the lower abdomen. Bilateral leg edema is noted. His cognitive function is normal, and there are no abnormalities in neurological examination. Urine analysis shows protein 3+, glucose negative, occult blood 2+, and various dysmorphic red blood cells and granular casts in the sediment. Daily urine output is 2,050 mL. Blood results show red blood cells 3.58 million, Hb 10.5 g/dL, Ht 31%, white blood cells 5,700, and platelets 280,000. Biochemical examination shows total protein 6.6 g/dL, albumin 3.5 g/dL, blood urea nitrogen 50 mg/dL, serum creatinine 5.1 mg/dL, estimated glomerular filtration rate (eGFR) 9 mL/min/1.73m2, HbA1c 7.0% (reference range 4.6-6.2%), Na 142 mEq/L, K 4.5 mEq/L, and Cl 103 mEq/L. Which is the appropriate explanation for renal replacement therapy?", "choices_en": ["\"Peritoneal dialysis is not suitable due to heart problems\"", "\"Peritoneal dialysis is not appropriate because you have diabetes.\"", "\"Hemodialysis is started when urine output ceases\"", "\"Blood dialysis is not suitable since the patient is taking aspirin.\"", "\"Peritoneal dialysis is not suitable because there is a history of major abdominal surgery\""], "answer": ["e"]}
{"problem_id": "113C32", "problem_text_en": "A 68-year-old man visited the hospital after being pointed out with serum protein abnormalities during a medical check-up. He has no particular symptoms or medical history. No superficial lymph nodes are palpable, and heart and breath sounds are normal. His abdomen is flat, soft, and the liver and spleen cannot be palpated, and there is no edema. Blood test results show: red blood cell count of 4.38 million, Hb of 13.8 g/dL, Ht of 45%, white blood cell count of 5,800, and platelet count of 250,000. Biochemical blood test results show: total protein of 8.2 g/dL, albumin of 4.7 g/dL, IgG of 2,628 mg/dL (reference range 960-1,960), IgA of 319 mg/dL (reference range 110-410), IgM of 211 mg/dL (reference range 65-350), total bilirubin of 0.7 mg/dL, AST of 26 U/L, ALT of 38 U/L, LD of 285 U/L (reference range 176-353), ALP of 295 U/L (reference range 115-359), blood urea nitrogen (BUN) of 18 mg/dL, creatinine of 0.9 mg/dL, and uric acid of 5.6 mg/dL. What is the most important blood test item for diagnosis?", "choices_en": ["Soluble IL-2 receptor", "Cold agglutination reaction", "Serum calcium level", "Serum immunoelectrophoresis", "Direct Coombs test"], "answer": ["d"]}
{"problem_id": "113C33", "problem_text_en": "A 28-year-old woman has visited the clinic with a desire to conceive. Her menstrual cycle is 30 days and lasts 5 days. She has not been using contraception for 3 months but has not become pregnant. Examination of the uterus and ovaries during a pelvic exam revealed no abnormalities, and there were no abnormalities in the Douglas pouch. Her basal body temperature chart shows a biphasic pattern. What is the appropriate explanation at this point?", "choices_en": ["\"Let's find the ovulation day\"", "\"We will perform a hysterosalpingogram (HSG) test.\"", "\"Please take ovulation inducing medication\"", "Let's do your chromosome examination.", "\"We will test for anti-cardiolipin antibodies.\""], "answer": ["a"]}
{"problem_id": "113C34", "problem_text_en": "A newborn infant with a postnatal age of 1 day was born at a gestational age of 40 weeks and 0 days with a birth weight of 2,594 g by normal delivery. Apgar scores were 8 points at 1 minute and 9 points at 5 minutes. Vomiting occurred 12 hours after birth, and no meconium was excreted even 24 hours after birth. The infant was admitted to the NICU due to bile-stained vomit. The weight was 2,400 g, body temperature was 37.6°C, heart rate was 140 bpm and regular, blood pressure was 70/40 mmHg, respiratory rate was 52 breaths/min, and SpO2 was 99% on room air. Abdominal examination (A) and chest/abdominal X-ray (supine view) (B) at this time are shown separately. Blood test results showed a hemoglobin level of 19.4 g/dL, white blood cell count of 11,600, and platelet count of 350,000. Blood biochemistry test results showed a blood urea nitrogen level of 17 mg/dL, serum creatinine level of 1.3 mg/dL, and total bilirubin level of 9.4 mg/dL. A nasogastric tube was inserted, and intravenous fluid was started. What should be done next?", "choices_en": ["Radiation therapy", "Oxygen therapy", "Administration of antibacterial agents", "Enteroclysis exam", "Echocardiogram (Heart ultrasound)"], "answer": ["d"]}
{"problem_id": "113C35", "problem_text_en": "A 45-year-old man is engaged in arc welding at a shipyard. At around 11am today, he took off his protective gear to wipe off sweat as the workplace was hot and was exposed to the light generated during welding. He had no particular symptoms and had no trouble with subsequent work, but a colleague in the same workshop was concerned and visited the medical office with him at 2pm after lunch. He is conscious and alert, with slightly congested conjunctiva. His visual field is good and he is not complaining of any eye or ear pain. There are no abnormalities in the pupils, oral mucosa, or skin. Which of the following is the appropriate response?", "choices_en": ["Tell them that there is no problem.", "Request an ambulance.", "Oral rehydration therapy.", "Recommend respiratory function test.", "Recommend referral and consultation with an ophthalmologist."], "answer": ["e"]}
{"problem_id": "113C36", "problem_text_en": "A 47-year-old woman visited the clinic with a chief complaint of facial rash. She had been prescribed topical medication for facial rash at a nearby clinic two months ago and new rashes appeared after she started using it. Papules and pustules are observed around the mouth and cheeks. A photo of her face is attached separately. Which of the following topical medications is suspected to have caused the rash?", "choices_en": ["Antibiotics", "Antifungal drug", "Benzoyl peroxide", "Active form of vitamin D$_3$", "Adrenal cortex steroids"], "answer": ["e"]}
{"problem_id": "113C37", "problem_text_en": "A 76-year-old man came to the hospital accompanied by his wife who was worried about his memory impairment. According to his wife, he had first experienced staring without response about 3 months ago. Since then, she has witnessed similar symptoms once or twice a month. At the time of symptom onset, he sometimes showed movements such as chewing his mouth or irregular movement of his fingers. He usually recovers within a few minutes, but he does not remember anything when asked afterwards. He stated that he was worried he had dementia because he did not remember anything his wife told him. He was prescribed an antihypertensive drug by his primary care physician, but he was not prescribed any sleeping pills or antipsychotics. His body temperature is 36.3°C. His pulse is 72 beats/minute and regular, and his blood pressure is 128/76 mmHg. No abnormalities were detected in heart sounds or respiratory sounds. Mini-Mental State Examination (MMSE) score is 29 out of 30. No abnormalities were detected in the neurological examination. No abnormalities were found in urinalysis, blood tests, or blood biochemistry tests. No abnormalities were detected in head MRI. What test should be performed next?", "choices_en": ["Brainwaves", "Surface electromyogram", "Auditory brainstem response", "Cerebrospinal fluid examination (CSF examination)", "MIBG cardiac scintigraphy"], "answer": ["a"]}
{"problem_id": "113C38", "problem_text_en": "A 9-year-old boy is brought in by his mother with complaints of pubic hair growth and a change in his voice. He has been the tallest in his class since kindergarten. He began developing pubic hair 6 months ago, and his voice has recently been noticed by those around him, causing concern for his parents. He has no notable medical history. His family's heights are as follows: father - 175cm, mother - 159cm (having her first period at 10 years old), brother (14 years old) - 175cm (his voice broke when he was 12 years old), sister (12 years old) - 152cm (had her first period at 10 years old). The patient has a height of 150cm and weight of 51kg. His temperature is 36.5℃, and there are no abnormalities detected in his oral cavity. No enlarged thyroid gland or lymph nodes are found in the neck. No abnormalities are detected in heart or respiratory sounds. The abdomen is flat, soft, and the liver and spleen are not palpable. No swelling is detected in the lower legs, and no café-au-lait spots are found. Which of the following should be done next?", "choices_en": ["Head MRI (Magnetic Resonance Imaging)", "Confirmation of growth curve", "Luteinizing hormone-releasing hormone (LHRH) stimulation test", "Abdominal ultrasound examination.", "Chest X-ray imaging"], "answer": ["b"]}
{"problem_id": "113C39", "problem_text_en": "A 35-year-old primigravida (gravida 1, para 0) visited the clinic at 11 weeks and 2 days of pregnancy for her first prenatal examination. She had a missed period and was diagnosed with 8-week pregnancy by ultrasound examination when she visited the clinic 3 weeks ago. Which of the following explanations is appropriate for the initial blood test?", "choices_en": ["\"Let's skip testing for syphilis\"", "\"Includes testing for Group B Streptococcus (GBS)\"", "\"If rubella antibodies are positive, congenital rubella syndrome will occur\"", "\"If the test for hepatitis C virus is positive, the baby will be vaccinated.\"", "\"If the hepatitis B virus test is positive, HBs human immunoglobulin will be administered to the baby.\""], "answer": ["e"]}
{"problem_id": "113C40", "problem_text_en": "A 69-year-old woman presents with a complaint of joint pain in all four limbs. She has had stiffness and migratory pain in her fingers for the past 5 years. Three years ago, she was diagnosed with irritable bowel syndrome due to repeated episodes of constipation and diarrhea. Her husband passed away 6 months ago due to lung cancer, and since then her joint pain and low back pain have worsened. She visited a nearby clinic 4 weeks ago and was prescribed NSAIDs, but there was no improvement. Her weight has not changed. Her body temperature is 36.2°C. Her pulse is regular at 80 beats/min, and her blood pressure is 120/76 mmHg. Bony spurs are palpable at the distal and proximal interphalangeal joints of her fingers. She has tenderness in multiple joints, such as fingers, wrists, and knees, without swelling. During palpation of the bilateral cervical paraspinal muscles, the central portion of the trapezius muscle, the costochondral junctions of the second ribs, the lateral supracondylar ridge of the humerus, the upper outer quadrant of the buttocks, and the posterior aspect of the greater trochanter of the femur, she experiences pain. Urinalysis is normal, and erythrocyte sedimentation rate is 10 mm/hour. Blood tests show the following: red blood cells 4.25 million/μL, hemoglobin 12.8 g/dL, hematocrit 40%, white blood cells 4,200/μL, and platelets 190,000/μL. Serum chemistry shows total protein 7.2 g/dL, aspartate aminotransferase 21 U/L, alanine aminotransferase 16 U/L, lactate dehydrogenase 188 U/L (reference range, 176 to 353), blood urea nitrogen 10 mg/dL, creatinine 0.4 mg/dL, and creatine kinase 48 U/L (reference range, 30 to 140). Serum cortisol level is 12.4 μg/dL (reference range, 5.2 to 12.6). Immunological tests show the following: C-reactive protein 0.1 mg/dL, negative rheumatoid factor and negative antinuclear antibodies. What is the most likely diagnosis?", "choices_en": ["Fibromyalgia", "Ankylosing spondylitis", "Rheumatoid arthritis", "Sjögren's syndrome", "Rheumatoid myalgia syndrome"], "answer": ["a"]}
{"problem_id": "113C41", "problem_text_en": "A 7-year-old boy was referred for evaluation of left ventricular hypertrophy detected by a cardiac screening at his first grade in elementary school. There has been no complaint of easy fatigability in his daily life or school activities. The blood pressure in the right upper limb is 142/88 mmHg and a murmur is heard in the left back during systole. Echocardiography shows left ventricular hypertrophy, but there is no abnormality in wall motion of the left ventricle. No definite intracardiac shunt is detected. What is the expected finding?", "choices_en": ["Hepatomegaly", "Increased intensity of the second heart sound", "Protrusion of the left anterior chest", "Differential blood pressure between upper and lower limbs", "Prolongation of capillary refill time"], "answer": ["d"]}
{"problem_id": "113C42", "problem_text_en": "A 62-year-old woman came to the hospital for a detailed examination of occult blood in her stool. She had undergone a screening test for occult blood in her stool, which was positive on the first day and negative on the second day, so she needed to undergo a detailed examination. She had heard from a friend that colonoscopy is painful and is hesitant to undergo the procedure. She has daily bowel movements and no narrowing of the stool. There has been no significant weight gain or loss in recent years. There is no significant medical history to note. She has never smoked and only drinks occasionally. She has no family history of colon cancer. She is 155 cm tall and weighs 56 kg. Her abdomen is flat, soft, and does not show any tenderness or palpable liver or spleen. What is the most appropriate response?", "choices_en": ["\"Let's perform an abdominal ultrasound examination.\"", "\"Let's do a blood test of tumor markers for colorectal cancer.\"", "\"Let's follow up and re-examine fecal occult blood after 6 months.\"", "\"Let's conduct a re-examination of fecal occult blood and make a decision based on the results.\"", "\"Please explain in detail about the necessity of a colonoscopy.\""], "answer": ["e"]}
{"problem_id": "113C43", "problem_text_en": "A 22-year-old male came to the clinic for follow-up after being notified of a positive urine glucose result during his employment health examination. No other abnormalities were found during the examination. He reported having the test after breakfast. There are no notable findings in his family history, and he has no history of smoking or alcohol consumption. He has a height of 170 cm and a weight of 62 kg, and his pulse rate is 72/min and regular. Blood pressure is 118/70 mmHg. The results of a 75 g oral glucose tolerance test (OGTT) are shown below.\n\nBlood glucose (mg/dL)\nUrine glucose (qualitative)\n\nBefore load\n86\n(-)\n\n30 min after load\n186\n2+\n\n1 hour after load\n142\n1+\n\n2 hours after load\n90\n(-)\n\nWhich of the following is appropriate?", "choices_en": ["No action needed.", "Instructions for self-monitoring of urine glucose at home", "Administration of α-glucosidase inhibitor", "Dietary instruction of 28kcal/standard body weight kg.", "Repeat test of oral glucose tolerance test (75g OGTT)"], "answer": ["a"]}
{"problem_id": "113C44", "problem_text_en": "A 25-year-old primiparous woman at 12 weeks of gestation experienced vaginal bleeding this morning and has had a complete miscarriage. In the initial pregnancy examination, blood type was O RhD (-) and the indirect Coombs' test was negative. What should be the top priority for today’s management?", "choices_en": ["Observation of the course of the condition", "Direct Coombs test", "Haptoglobin administration", "Administration of anti-human RhD antibodies", "Adrenal cortex steroid administration"], "answer": ["d"]}
{"problem_id": "113C45", "problem_text_en": "A 68-year-old man presented with skin yellowing and loss of appetite. Further investigation revealed obstructive jaundice caused by pancreatic head cancer. The patient's height is 168 cm, weight is 53 kg (a weight loss of 5 kg over 3 months). His temperature is 36.6°C, pulse rate is 76 beats/min and regular, blood pressure is 110/78 mmHg, and respiratory rate is 16 breaths/min. Blood test results showed a red blood cell count of 3.98 million, hemoglobin of 11.9 g/dL, hematocrit of 39%, white blood cell count of 7,400, and platelet count of 340,000. Biochemical test results showed total protein of 6.0 g/dL, albumin of 3.4 g/dL, total bilirubin of 2.7 mg/dL, AST of 56 U/L, ALT of 48 U/L, and γ-GTP of 76 U/L (normal range: 8-50), blood urea nitrogen of 13 mg/dL, creatinine of 0.4 mg/dL, blood glucose of 84 mg/dL, HbA1c of 6.0% (normal range: 4.6-6.2%), total cholesterol of 194 mg/dL, triglycerides of 78 mg/dL, amylase of 96 IU/L (normal range: 37-160), CEA of 7.5 ng/mL (normal range: <5), and CA19-9 of 107 U/mL (normal range: <37). Endoscopic stenting was performed to ease jaundice, and pancreaticoduodenectomy will be performed after improvement of the jaundice. Which of the following is true about the patient's perioperative management?", "choices_en": ["Preoperative sarcopenia does not affect postoperative outcomes.", "Fasting is necessary one week before surgery.", "Early postoperative period is prone to hyperglycemia.", "Early postoperative pain relief delays recovery.", "Enteral nutrition within 1 week after surgery is contraindicated."], "answer": ["c"]}
{"problem_id": "113C46", "problem_text_en": "A 71-year-old woman presents with worsening dyspnea on exertion as the chief complaint. She was diagnosed with COPD about 10 years ago. Due to type II respiratory failure that occurred 1 year ago, she has been receiving home oxygen therapy at a rate of 1 L/min. At her last outpatient visit, her respiratory rate was 20/min, and her SpO2 was 94% (with nasal cannula under 1 L/min oxygen administration). She came to the hospital with her family member because her dyspnea on exertion had worsened in the past few days. She had been dozing off in the outpatient waiting room for about 30 minutes. The family member noticed that she was not responding and asked the nurse for help. Her pulse rate was 104 beats/min and regular, and her blood pressure was 144/92 mmHg. Her respiratory rate was 8/min, and her SpO2 was 91%. Upon checking the oxygen intake, it was found to be 5 L/min. According to the family member, the patient increased the oxygen when she experienced shortness of breath walking from the taxi to the waiting room. Which of the following is not necessary at present?", "choices_en": ["Venous access", "Preparation for endotracheal intubation", "Arterial blood gas analysis", "Wearing a heart monitor", "Oxygen administration by a mask with a reservoir"], "answer": ["e"]}
{"problem_id": "113C47", "problem_text_en": "A 24-year-old woman presents with fever and neck mass. She had been aware of a left neck mass for two months. She visited a hospital two weeks ago because of persistent fever and night sweats. She had lost 7 kg in 6 months. Her temperature was 37.8°C, and her pulse was 96 beats per minute and regular. Four elastic and non-tender lymph nodes measuring 2-3 cm in diameter were palpable in the left neck, left supraclavicular, and both inguinal regions. The H-E stained sample of the biopsy tissue from the left neck lymph node is presented separately. Immunohistochemical staining reveals cells positive for CD30. Which drug should be included in the treatment of this patient?", "choices_en": ["Isoniazid", "Rituximab", "Vincristine", "Bleomycin", "All-trans retinoic acid"], "answer": ["d"]}
{"problem_id": "113C48", "problem_text_en": "A 34-year-old primiparous woman (G1P0) was admitted due to the onset of labor at 39 weeks and 4 days of gestation at 6:00 am. The pregnancy had been uneventful so far. At 4:00 pm, the cervix was fully dilated. At 6:50 pm, her water broke, and an internal examination showed that the fetal head descended to station +4 cm and was touchable at the ischial spines. The fetal heart rate and uterine contraction pattern at this point are shown separately. What is the most appropriate response?", "choices_en": ["Vacuum-assisted delivery", "Cesarean section", "Antibiotic administration", "Administration of labor-inducing drugs", "Administration of uterine contraction inhibitors"], "answer": ["a"]}
{"problem_id": "113C49", "problem_text_en": "A 70-year-old man is hospitalized for treatment of lung cancer. Right lower lobe resection and mediastinal lymph node dissection were performed for lung cancer. He started eating on the first day after surgery and on the second day after surgery, approximately 1,000 mL of white, cloudy pleural effusion was drained from the chest tube. The pleural fluid triglyceride level was 150 mg/dL. Which of the following are appropriate interventions? Select two.", "choices_en": ["High-fat diet", "Insertion of a gastric tube (nasogastric tube)", "Thoracic duct ligation surgery", "Total parenteral nutrition (TPN)", "Additional insertion of thoracic drain"], "answer": ["c", "d"]}
{"problem_id": "113C50", "problem_text_en": "A 51-year-old woman underwent curative left nephrectomy for left renal cell carcinoma. Ten months after surgery, multiple pulmonary metastases of less than 1 cm in size appeared in both lungs. Which of the following treatment options is appropriate initially for the pulmonary metastases? Select two.", "choices_en": ["Surgery", "Molecular targeted drug", "Radiation exposure", "Hormone therapy", "Interferon"], "answer": ["b", "e"]}
{"problem_id": "113C51", "problem_text_en": "Read the following passage and answer questions 51-53. \n\nA 36-year-old primigravida (gravida 1, para 0) presented at 33 weeks of gestation with fatigue and thirst. Medical history: Before pregnancy, her BMI was 20.8. She has never been diagnosed with any abnormalities in her annual check-ups. Urine sugar was positive at 18 weeks of gestation but she did not attend antenatal care visits thereafter. She reported general fatigue at 25 weeks of gestation, and this had worsened over the preceding 2 days with thirst. Past medical, social, and family history: Unremarkable. Blood pressure, 112/82 mmHg; pulse rate, 108 beats/minute; body temperature, 37.6℃; respiratory rate, 26 breaths/minute. Conjunctivae and sclerae were normal. Her oral mucosa was dry. Cardiovascular and respiratory system examinations were normal. Her fundal height was 35 cm and abdominal circumference was 95 cm. Deep tendon reflexes were normal. Funduscopy did not reveal diabetic retinopathy. Laboratory findings: Urine test: protein (−), glucose 2+ and ketone bodies (−); blood test: erythrocytes, 4.68 million/μL; hemoglobin, 13.9 g/dL; hematocrit, 42%; leukocytes, 10,300/μL (neutrophils, 75%; eosinophils, 1%; basophils, 1%; monocytes, 6%; lymphocytes, 17%); platelets, 210,000/μL. Serum chemistry: AST, 28 U/L; ALT, 16 U/L; blood urea nitrogen, 12 mg/dL; creatinine, 0.6 mg/dL; uric acid, 4.9 mg/dL; glucose, 255 mg/dL; HbA1c, 7.8% (reference range, 4.6-6.2%); sodium, 143 mEq/L; potassium, 4.9 mEq/L. Immunological tests: GAD antibody negative. Abdominal ultrasonography showed an estimated fetal weight of 2,450 g (+2.0 SD). No obvious cardiac abnormalities were found. Which of the following statements are correct regarding the mother and the fetus? Select two.\n\n51. The mother had gestational diabetes mellitus.\n52. The estimated fetal weight is appropriate for the gestational age.\n53. The fetus is likely to have congenital abnormalities. \n\nNote: The passage mentions no evidence of congenital abnormalities. Therefore, option 53 is incorrect.", "choices_en": ["I have diabetes and am pregnant.", "The fetus is prone to hypoglycemia.", "Glucose tolerance was normal 1 week ago.", "Insulin resistance is occurring due to pregnancy.", "There is a correlation between maternal hyperglycemia and fetal overweight."], "answer": ["d", "e"]}
{"problem_id": "113C52", "problem_text_en": "Which of the following is appropriate as drug therapy?", "choices_en": ["Non-Steroidal Anti-Inflammatory Drugs", "Beta-blocker", "Insulin", "Oral hypoglycemic agent", "Cation exchange resin preparation"], "answer": ["c"]}
{"problem_id": "113C53", "problem_text_en": "Subsequent course: The treatment was successful, and the infant was born at 39 weeks and 1 day of gestation with a birth weight of 3,796 g by vaginal delivery. Apgar scores were 9 at 1 minute and 9 at 5 minutes after birth. The infant's blood glucose was 58 mg/dL at 1 hour after birth. At 1 hour and 30 minutes after birth, the infant started to repeatedly tremble his limbs slightly. The body temperature was 37.3°C. The heart rate was 150 beats per minute and regular. The respiratory rate was 50 breaths per minute. The SpO2 was 99% on room air. No abnormal findings were noted on cardiac or respiratory examination. Muscle tone was normal, and the Moro reflex appeared normally. What is the immediate test that should be performed on the infant?", "choices_en": ["Head MRI (Magnetic Resonance Imaging)", "Blood glucose measurement", "Nerve conduction study", "Arterial blood gas analysis", "Chest and abdominal X-ray."], "answer": ["b"]}
{"problem_id": "113C54", "problem_text_en": "Read the following passage and answer questions 54-56. An 82-year-old woman is transported by ambulance after falling. Present illness: The patient was found collapsed in the hallway and ambulance was requested by family. She had been experiencing shortness of breath when climbing stairs for the past 6 months. Past medical history: She has been taking a calcium channel blocker for hypertension since the age of 68, biguanide for diabetes, warfarin for deep vein thrombosis since 75, benzodiazepine sleeping pill for insomnia since 76, and bisphosphonates for osteoporosis. Activities of daily living (ADL): Independent. Family history: Nothing significant to report. Present status: The patient can respond to questions and say her name. She is 152 cm tall and weighs 42 kg. Her body temperature is 36.6°C. Her heart rate is 72 beats/minute and regular. In the supine position, her blood pressure is 112/68 mmHg. She breathes at a rate of 18 breaths/minute. Her SpO2 is 98% (room air). Conjunctiva is anemic but no jaundice is observed in the sclera. A subcutaneous hematoma of 2 cm is observed on the forehead. No abnormality is detected in heart and breath sounds. No abnormality is detected in physical examination, including neurological examination, etc. Which of the following questions are not useful to evaluate the cause of the fall?", "choices_en": ["\"Do you remember what happened when you fell down?\"", "\"What is the most painful area when hit?\"", "\"Did you trip over anything when you fell?\" or \"Did you stumble over anything when you fell?\"", "\"Do you have any numbness or difficulty moving your hands and feet?\"", "\"Have you ever been told that you had convulsions in the past?\""], "answer": ["b"]}
{"problem_id": "113C55", "problem_text_en": "Head CT showed no abnormalities in the intracranial space except for subcutaneous hematoma. One minute after sitting up, the patient complained of dizziness and feeling like \"the front was turning black\". Her heart rate was 120 beats per minute, regular. Blood pressure was 82/40 mmHg, respiratory rate was 20 breaths per minute. Digital rectal examination showed the presence of black stool. A venous line was secured and fluid therapy was started, and blood pressure increased to 110/62 mmHg. Laboratory findings were: RBC 2.45 million, Hb 7.5 g/dL, Hct 24%, WBC 9,600, and platelets 180,000. Biochemical findings showed total protein 6.5 g/dL, albumin 3.2 g/dL, AST 20 U/L, ALT 30 U/L, blood urea nitrogen (BUN) 65 mg/dL, creatinine 0.6 mg/dL, Na 140 mEq/L, K 4.5 mEq/L, Cl 108 mEq/L. What is the next priority test to conduct?", "choices_en": ["MRI of the head", "Lumbar spine MRI", "Holter electrocardiogram", "Carotid artery ultrasound examination", "Upper gastrointestinal endoscopy"], "answer": ["e"]}
{"problem_id": "113C56", "problem_text_en": "What is the most important medication history to consider when predicting the future occurrence of intracranial hemorrhage in this patient?", "choices_en": ["Warfarin", "Biguanide medication", "Calcium channel blockers", "Bisphosphonate formulation", "Benzodiazepine type sleep aid"], "answer": ["a"]}
{"problem_id": "113C57", "problem_text_en": "Read the following passage and answer questions 57-59.\n\nA 58-year-old man was brought in by ambulance with complaints of difficulty breathing and left-sided chest pain. Present illness: He had sudden onset of difficulty breathing and pain throughout the left side of the chest while working at his desk 30 minutes ago. His symptoms were severe, and his co-workers called an ambulance. Medical history: There is nothing significant to note. Lifestyle: He has no smoking history and drinks 350 mL of beer per day. Family history: His father died of stomach cancer. Current condition: He is conscious and alert. His height is 160 cm, weight 86 kg. His body temperature is 36.2 ℃. His pulse rate is 108/min and regular. His blood pressure is 128/70 mmHg. His respiratory rate is 30/min. His SpO2 is 93% (with 10 L/min oxygen administered through a reservoir mask). There is nothing unusual in the conjunctiva and sclera of the eyes. He has accentuated second heart sounds. His breathing sounds are normal. His abdomen is flat, soft, and non-tender with no palpable liver or spleen. There is nothing unusual in the neurological examination. The portable chest X-ray shows no abnormalities. An ECG is shown separately. Which of the following correctly describes the ECG findings?\n\n(Note: The Japanese passage does not include the ECG findings, therefore the translation cannot provide the answer to this question.)", "choices_en": ["Atrial fibrillation", "Normal electrical axis (of the heart)", "Delta wave", "Complete left bundle branch block.", "Shortening of QT interval"], "answer": ["b"]}
{"problem_id": "113C58", "problem_text_en": "Laboratory findings: Hematology: Red blood cell count 4.5 million, Hb 13.3 g/dL, Hct 40%, WBC 6,200, platelets 180,000. Blood biochemistry: AST 32 U/L, ALT 45 U/L, LD 260 U/L (normal range 176-353), CK 98 U/L (normal range 30-140), blood urea nitrogen 11 mg/dL, creatinine 0.6 mg/dL, blood glucose 102 mg/dL. Echocardiography shows enlargement of the right heart and pressure image of the left ventricle. What test should be performed to confirm the diagnosis?", "choices_en": ["Chest MRI", "Coronary angiography", "Chest enhanced CT scan", "Respiratory function test", "Exercise stress ECG (Electrocardiogram)"], "answer": ["c"]}
{"problem_id": "113C59", "problem_text_en": "During preparation for an examination, the patient suddenly experienced worsening shortness of breath followed by a decrease in consciousness level to JCS II-10. Heart rate was 128 beats per minute, regular, and blood pressure was 70/40 mmHg. SpO2 was not measurable, and engorgement of the jugular vein was noted. What is the most likely diagnosis?", "choices_en": ["Hemorrhagic shock", "Cardiogenic shock", "Obstructive shock", "Septic shock", "Anaphylactic shock"], "answer": ["c"]}
{"problem_id": "113C60", "problem_text_en": "Read the following text and answer questions 60-62.\nA 52-year-old man visited the hospital with complaints of chest pain while walking. Medical history: He felt anterior chest pain when climbing stairs a week ago. The pain radiated to his jaw and disappeared within one minute of rest. Since four days ago, chest pain also appears on flat ground walking. This morning, he experienced chest pain for 2-3 minutes even at rest, so he visited the hospital with a family member. Past history: He has had hypertension for three years and is taking a calcium channel blocker and an angiotensin-converting enzyme (ACE) inhibitor. Living history: He has smoked 15 cigarettes a day for 30 years and drinks alcohol occasionally. Family history: His father has dyslipidemia. Present status: Height 168 cm, weight 88 kg. Pulse rate 72 beats per minute, regular. Blood pressure 136/78 mmHg. Respiratory rate 28 breaths per minute. No abnormalities were found in the conjunctiva or eyeballs. No abnormalities were found in the heart and respiratory sounds. The abdomen was flat, soft, and no liver or spleen was palpable. No edema was found in the lower leg. Test findings: Blood test: Red blood cell count 4.5 million, Hb 14.5 g/dL, Ht 42%, white blood cell count 6,800, platelets 250,000. Blood biochemistry: Total protein 7.5 g/dL, albumin 4.0 g/dL, AST 25 U/L, ALT 20 U/L, blood urea nitrogen 15 mg/dL, creatinine 1.0 mg/dL, total cholesterol 280 mg/dL, triglycerides 150 mg/dL, HDL cholesterol 54 mg/dL, CK 128 U/L (normal range 30-140), uric acid 6.6 mg/dL. What is Brinkman's index?\n\n(Note: Brinkman's index is a measure of smoking quantity, calculated as the number of cigarettes smoked per day multiplied by the number of smoking years.)", "choices_en": ["52 (there is no contextual information to determine a possible translation of this choice)", "154", "176", "There is no context to provide an accurate translation of \"350\". Please provide more information or context for the term.", "I'm sorry, but \"450\" alone doesn't give enough context to provide a translation. Please provide more information about the question or the choices for me to give an accurate translation."], "answer": ["e"]}
{"problem_id": "113C61", "problem_text_en": "Coronary angiography was performed. The image of the coronary angiography is shown separately. Which vessel is indicated by the arrow?", "choices_en": ["Left anterior descending coronary artery (LAD)", "Left main coronary artery", "Left circumflex coronary artery", "Right coronary artery", "Septal branch"], "answer": ["a"]}
{"problem_id": "113C62", "problem_text_en": "Coronary artery stenting was performed. Which drug(s) in addition to the previous oral medication will need to be administered? Select two.", "choices_en": ["Statin", "Anticoagulant drug", "Oral cardiac glycosides", "Antiplatelet agent", "Uric acid-lowering medication"], "answer": ["a", "d"]}
{"problem_id": "113C63", "problem_text_en": "Read the following passage and answer questions 63-65. \n\nA 62-year-old man came to the hospital complaining of bloody stool. Present illness: He noticed a large amount of dark red stool after dinner today and felt dizzy, so he visited the emergency department. He does not complain of any abdominal pain or diarrhea in particular. Past medical history: He has been receiving medication for hypertension and diabetes for 30 years. He was prescribed warfarin for atrial fibrillation 10 years ago. Recently, there has been no increase or change in his medication. Lifestyle history: He lives with his wife and smokes 20 cigarettes a day for 20 years until the age of 50. He drinks 350 mL of beer per day. Family history: His father had a stroke, and his mother had colorectal cancer. Current status: Consciousness is clear. Height 169 cm, weight 70 kg. Body temperature 36.7℃. Heart rate 88/min, irregular. Blood pressure 114/78 mmHg. Respiratory rate 18/min. SpO2 96% (room air). Conjunctivae are anemic but no jaundice is observed in the sclera. There are no abnormalities in heart and breath sounds. The abdomen is flat, soft, and the liver and spleen are not palpable. Bowel sounds are slightly increased. Digital rectal examination reveals adhesion of dark red stool. There is mild cold sweat on his limbs. Laboratory findings: Blood test: RBC 2.99 million, Hb 9.7 g/dL, Ht 32%, WBC 12,000, platelets 210,000. Blood biochemistry: Total protein 6.5 g/dL, albumin 3.6 g/dL, total bilirubin 0.9 mg/dL, AST 28 U/L, ALT 22 U/L, LD 277 U/L (reference range 176-353), γ-GTP 41 U/L (reference range 8-50), amylase 80 U/L (reference range 37-160), blood urea nitrogen 18 mg/dL, creatinine 1.1 mg/dL, uric acid 6.7 mg/dL, blood glucose 128 mg/dL, Na 140 mEq/L, K 4.5 mEq/L, and Cl 100 mEq/L. CRP 1.9 mg/dL. Abdominal plain CT (A) and abdominal contrast CT (B, C) are shown separately. What should be measured first?", "choices_en": ["PaO$_2$ (partial pressure of oxygen in arterial blood)", "PT-INR (Prothrombin Time - International Normalized Ratio)", "D-dimer", "Platelet adhesion", "Cardiac Troponin T"], "answer": ["b"]}
{"problem_id": "113C64", "problem_text_en": "What is the most likely?", "choices_en": ["Colonic diverticulosis", "Ischemic colitis", "Ulcerative colitis", "Non-occlusive mesenteric ischemia", "Enterohemorrhagic Escherichia coli (EHEC) infection"], "answer": ["a"]}
{"problem_id": "113C65", "problem_text_en": "Subsequent course: After admission, a transfusion of 6 units of packed red blood cells with lactated Ringer's solution was performed by the next morning, but the Hb level was 8.2 g/dL and bloody stools persisted. A lower gastrointestinal endoscopy was performed but could not implement hemostasis due to large clots. Which of the following should be considered at this point? Select two.", "choices_en": ["Intestinal resection surgery", "Arterial thrombectomy", "Thrombolytic therapy", "Plasma exchange therapy", "Hyperbaric oxygen therapy"], "answer": ["a", "b"]}
{"problem_id": "113C66", "problem_text_en": "Which of the following is the correct order of layers in the fetal membranes from the maternal side to the fetal side?", "choices_en": ["Chorion → Amnion → Decidua", "Chorion - Decidua - Amnion", "Chorion→Chorion frondosum→Amnion", "Desquamation membrane -> amnion -> chorion.", "Amnion→chorion→decidua", "Amnion → chorion → placenta"], "answer": ["c"]}
