{"problem_id": "113A1", "problem_text_en": "Which of the following is not important in determining the treatment strategy for a solitary hepatocellular carcinoma with a maximum diameter of 2 cm that has arisen from a background of liver cirrhosis?", "choices_en": ["Presence of ascites", "Bilirubin level", "Causes of cirrhosis", "Presence or absence of hepatic encephalopathy", "Prothrombin time"], "answer": ["c"]}
{"problem_id": "113A2", "problem_text_en": "Which of the following is observed in myotonic dystrophy?", "choices_en": ["Glaucoma", "Renal failure", "Dysphagia", "Hyperthyroidism (overactive thyroid)", "High gamma globulinemia"], "answer": ["c"]}
{"problem_id": "113A3", "problem_text_en": "Shown separately is the pathological photograph of the temporal bone of a patient who underwent cochlear implant surgery for bilateral severe hearing loss. Where is the site in which the electrode tip of the cochlear implant was inserted indicated by the arrow?", "choices_en": ["Vestibule.", "Cochlea", "Semicircular canal", "Auditory meatus (ear canal)", "Internal lymphatic cyst"], "answer": ["b"]}
{"problem_id": "113A4", "problem_text_en": "What is the most frequent side effect of molecular targeted therapy (tyrosine kinase inhibitors) in first-line treatment of advanced lung adenocarcinoma with EGFR gene mutation and distant metastasis?", "choices_en": ["Anemia", "Skin disorder", "Type 1 diabetes", "Neutropenia", "Thrombocytopenia"], "answer": ["b"]}
{"problem_id": "113A5", "problem_text_en": "Which statement is incorrect regarding complications of acute myocardial infarction?", "choices_en": ["Blow-out type myocardial rupture has a poor prognosis.", "Papillary muscle rupture is more common in the posterior papillary muscle than the anterior papillary muscle.", "Catheter therapy is considered for ventricular septal defects.", "AV block is more likely to occur in inferior wall infarction than in anterior wall infarction.", "Dressler syndrome is likely to occur 1 year after the onset of myocardial infarction."], "answer": ["e"]}
{"problem_id": "113A6", "problem_text_en": "Which of the following does not result in intellectual disability?", "choices_en": ["Trisomy 13", "Down Syndrome", "Marfan syndrome", "Angelman syndrome", "Prader-Willi syndrome"], "answer": ["c"]}
{"problem_id": "113A7", "problem_text_en": "Which of the following is less likely to be infiltrated by advanced gastric cancer?", "choices_en": ["Liver", "Pancreas", "Greater omentum", "Gallbladder", "Transverse colon"], "answer": ["d"]}
{"problem_id": "113A8", "problem_text_en": "What is the most appropriate treatment for a patient with psoriasis vulgaris at 10 weeks of gestation?", "choices_en": ["Oral PUVA therapy", "Biological preparation injection", "Oral administration of vitamin A derivative", "Topical active vitamin D$_3$", "Topical administration of adrenal cortex steroids"], "answer": ["e"]}
{"problem_id": "113A9", "problem_text_en": "Which of the following is not seen in intraductal papillary mucinous neoplasm (IPMN) of the pancreas?", "choices_en": ["Dilation of the Vaterian papilla", "Papillary proliferation within the pancreatic duct", "Diffuse stenosis of the main pancreatic duct", "Grapelike cluster dilatation of pancreatic duct branches", "Caviar-like protrusion in the main pancreatic duct"], "answer": ["c"]}
{"problem_id": "113A10", "problem_text_en": "Which of the following abnormal presentations occur during the second vertex rotation in vaginal delivery? Select two.", "choices_en": ["Position of forehead", "Lateral position", "High axial positioning", "Occiput posterior position", "Transverse lie"], "answer": ["d", "e"]}
{"problem_id": "113A11", "problem_text_en": "Which of the following should be monitored early after removal of a pheochromocytoma? Select two.", "choices_en": ["Tachycardia", "Headache", "Low blood pressure", "Hypoglycemia", "Hyperhidrosis"], "answer": ["c", "d"]}
{"problem_id": "113A12", "problem_text_en": "Which of the following are likely to be complaints reported by a patient with narcolepsy? Select two.", "choices_en": ["\"I suddenly fall asleep during meetings.\"", "\"I can't sleep until dawn every day.\"", "\"When laughing a lot, suddenly all body strength is lost\"", "\"I can't resist moving my legs because they feel restless.\"", "\"I become anxious that I might not be able to sleep every night.\""], "answer": ["a", "c"]}
{"problem_id": "113A13", "problem_text_en": "Which of the following conditions can cause hyponatremia with decreased urinary sodium excretion? Select two.", "choices_en": ["Liver cirrhosis", "Heart failure", "SIADH (syndrome of inappropriate antidiuretic hormone secretion)", "Addison's disease.", "Thiazide diuretics"], "answer": ["a", "b"]}
{"problem_id": "113A14", "problem_text_en": "What are the possible causes of ptosis? Please select two.", "choices_en": ["Aging", "Chalazion", "Graves' ophthalmopathy", "Radial nerve paralysis", "Long-term use of contact lenses"], "answer": ["a", "e"]}
{"problem_id": "113A15", "problem_text_en": "A 30-year-old woman presented to the clinic with amenorrhea and a positive home pregnancy test. Her menstrual cycle is irregular, ranging from 30 to 50 days. Based on her last menstrual period, she is estimated to be 10 weeks and 0 days pregnant. However, an ultrasound examination reveals a fetus with a heartbeat in the uterus, but the biparietal diameter corresponds to 8 weeks and 2 days of gestation. Which of the following is the appropriate management at this point?", "choices_en": ["Instruct to stay at home and rest.", "To adjust gestational age.", "To provide dietary therapy guidance.", "Measure the mother's blood glucose levels.", "Explaining the necessity of chorionic villus sampling."], "answer": ["b"]}
{"problem_id": "113A16", "problem_text_en": "A 68-year-old woman was diagnosed with sigmoid colon cancer (stage III) a year ago and underwent sigmoid colon resection and lymph node dissection. She was recommended adjuvant chemotherapy after surgery but did not receive treatment and did not visit the hospital. She visited the hospital a week ago because of abdominal pain that did not improve. She is conscious and alert. Her height is 158 cm, weight is 50 kg. Her abdomen is flat and liver and spleen are not palpable. Spontaneous pain and mild tenderness are present in the periumbilical area. Laboratory findings: red blood cells 3.85 million/µL, Hb 10.9 g/dL, Ht 37%, white blood cells 5,100/µL, platelets 140,000/µL. Blood chemistry findings: total protein 7.2 g/dL, total bilirubin 1.1 mg/dL, AST 54 U/L, ALT 48 U/L, ALP 722 U/L (reference range: 115-359), γ-GTP 264 U/L (reference range: 8-50), CEA 78 ng/mL (reference range: < 5), CA19-9 350 U/mL (reference range: < 37), CRP 2.8 mg/dL. Abdominal contrast-enhanced CT is also provided. What is the best treatment for this patient?", "choices_en": ["Liver transplantation", "Hepatectomy", "Radiation therapy", "Chemotherapy for cancer treatment", "Transcatheter arterial chemoembolization (TACE)"], "answer": ["d"]}
{"problem_id": "113A17", "problem_text_en": "A 29-year-old woman presents to the clinic complaining of headaches. Two years ago, she was diagnosed with systemic sclerosis after experiencing swelling and skin hardening in her fingers, and underwent examination at a medical institution near her home. Prednisolone 20 mg/day was prescribed, and the swelling and hardening of the fingers improved. Prednisolone was gradually reduced and maintained at 5 mg/day, but was increased to 10 mg/day three months ago due to worsening skin hardening. She visited the clinic because she started to experience headaches yesterday. Her body temperature is 36.7℃. Heart rate is 72 beats/min, regular. Blood pressure is 172/108 mmHg. There are no abnormalities in heart and lung sounds. The abdomen is flat and soft, without palpable liver or spleen. There is no tenderness. Skin hardening is observed in both fingers, forearms, and anterior chest. There is no edema in the lower legs. Laboratory findings show red blood cells of 3.43 million, Hb of 10.5 g/dL, Ht of 32%, white blood cells of 11,200 (neutrophils 32%, lymphocytes 17%, monocytes 5%, basophils 0%, and eosinophils 1%), and platelets of 430,000. Blood biochemistry shows a blood urea nitrogen level of 45 mg/dL, creatinine of 1.5 mg/dL, Na of 140 mEq/L, K of 4.2 mEq/L, and Cl of 108 mEq/L. Anti-RNA polymerase III antibody is positive. What should be the first step in management of this patient?", "choices_en": ["Emergency dialysis", "Skin biopsy", "Administration of alpha blocker drugs", "Steroid pulse therapy", "Administration of angiotensin-converting enzyme (ACE) inhibitor"], "answer": ["e"]}
{"problem_id": "113A18", "problem_text_en": "A newborn infant 12 hours after birth was delivered at a gestational age of 39 weeks with a birth weight of 3,820 g. After three rounds of suction on the head, the infant was born. The Apgar scores were 6 points (at 1 minute) and 9 points (at 5 minutes). A pulsatile swelling was palpated from both temporal regions to the occipital region at birth. The head swelling gradually increased in size, and the infant was repeatedly found to have cyanotic apnea from 9 hours after birth. Therefore, the infant was transported to the NICU. The infant's body temperature was 36.3℃, heart rate was 156/min, regular, blood pressure was 50/30 mmHg, respiratory rate was 60/min, and the SpO2 was 90% (room air). The skin on the forehead and upper eyelids on both sides showed a purplish color. The infant was somewhat lethargic, and muscle tone was decreased. Blood tests showed red blood cells of 2.57 million, an Hb of 9.0 g/dL, Ht of 32%, a white blood cell count of 27,400, platelets of 150,000, PT-INR of 1.3 (reference range 0.9-1.1), APTT of 46.6 seconds (reference range control 37.1 seconds), and fibrinogen in plasma of 150 mg/dL (reference range 200-400 mg/dL). Biochemical blood analysis showed a total protein of 4.5 g/dL, albumin of 2.8 g/dL, AST of 88 U/L, ALT of 26 U/L, LD of 874 U/L (reference range 198-404), blood urea nitrogen of 12 mg/dL, creatinine of 0.6 mg/dL, blood glucose of 146 mg/dL, Na of 133 mEq/L, K of 5.2 mEq/L, and Cl of 104 mEq/L. A T1-enhanced image of head simple MRI is shown separately. What is the appropriate management for this infant?", "choices_en": ["Administration of antibiotics", "Puncture of the affected area", "Transfusion of fresh frozen plasma", "Administration of xanthine derivatives", "Glucose and insulin intravenous drips"], "answer": ["c"]}
{"problem_id": "113A19", "problem_text_en": "A 26-year-old man visited the clinic complaining of a rash with a burning sensation. He had played tennis three days ago and developed sore throat and runny nose, for which he took over-the-counter cold medicine and went to bed. The next morning, he developed circular redness around his mouth, on his penis, and on the top of his feet, which gradually became more burning, so he sought medical attention. He has a history of recurrent oral herpes and hay fever. He had similar redness in the same area of his feet during a fever one year ago, but the rash improved in about a week. See separate photos of the rash around his mouth and on his right foot top. What is the most likely cause of the rash?", "choices_en": ["Pharyngitis", "Ultraviolet rays", "Japanese cedar pollen", "Over-the-counter cold medicine", "Herpes simplex virus"], "answer": ["d"]}
{"problem_id": "113A20", "problem_text_en": "A 64-year-old man complains of abdominal distension and is examined by a physician. He has had a sensation of abdominal distention on the left side for the past three months, which has not improved, and is visiting the hospital for the first time. He has no relevant medical history. On examination, a systolic ejection murmur is heard at the second right intercostal space of the sternal border. There are no abnormalities in his breathing sounds. The liver is palpable 3 cm below the right costal margin, and the spleen is palpable 3 cm below the left costal margin. He has no edema. His laboratory findings are as follows: red blood cells 2.68 million, Hb 7.9 g/dL, Hct 26%, reticulocyte count 1%, white blood cells 7,300, and platelets 140,000. His biochemical test results are: total protein 6.0 g/dL, albumin 3.2 g/dL, IgG 1,614 mg/dL (reference range: 960–1,960), IgA 369 mg/dL (reference range: 110–410), IgM 182 mg/dL (reference range: 65–350), total bilirubin 0.9 mg/dL, direct bilirubin 0.2 mg/dL, AST 27 U/L, ALT 26 U/L, LD 477 U/L (reference range: 176–353), and ALP 283 U/L (reference range: 115–359), blood urea nitrogen 18 mg/dL, creatinine 0.8 mg/dL, and uric acid 6.9 mg/dL. The H-E-stained bone marrow tissue sample (A) and the silver-stained sample (B) are shown separately. Which of the following is not found in this patient's peripheral blood?", "choices_en": ["Bone marrow cell", "Erythroblast", "Bone marrow blast", "Sickle-shaped red blood cells", "Erythroblastosis fetalis"], "answer": ["e"]}
{"problem_id": "113A21", "problem_text_en": "A 69-year-old woman visited the hospital after gradually noticing a loss of vision in her right eye over the past month. Her right eye was found to have a visual acuity of 0.2 (with correction of -0.5D) and her left eye 0.6 (with correction of -0.75D). Intraocular pressure was measured as 13 mmHg in the right eye and 14 mmHg in the left eye. Fundus photograph (A) and optical coherence tomography (OCT) image (B) of the right eye are shown separately. What symptom is likely to be observed?", "choices_en": ["Photophobia", "Night blindness", "Distorted vision", "Color vision deficiency", "Hemianopia (loss of half of the visual field)"], "answer": ["c"]}
{"problem_id": "113A22", "problem_text_en": "A 50-year-old man was rescued after being trapped under a collapsed building for half a day following an earthquake and was transported by ambulance. He has extensive contusions and edema in his left lower limb but is conscious and alert. His heart rate is 100 bpm and regular, and blood pressure is 102/50 mmHg. Blood test results are currently unknown. Which of the following treatments would be most appropriate to administer immediately?", "choices_en": ["Intravenous infusion of physiological saline", "Transfusion of red blood cells in LR solution", "Transfusion of fresh frozen plasma", "Intravenous infusion of 0.45% saline solution", "Transfusion of 5% glucose solution"], "answer": ["a"]}
{"problem_id": "113A23", "problem_text_en": "A 68-year-old man presented with hoarseness as his primary complaint. He was found to have a laryngeal tumor with fixation of the right vocal cord and lymph node metastasis in the right neck. Based on the biopsy results, he was diagnosed with squamous cell carcinoma, and subsequently underwent radiation therapy, total laryngectomy, and right neck dissection. The photographs of his neck after surgery are shown separately. Which of the following is correct?", "choices_en": ["There is no olfactory disturbance.", "The voice is normal.", "There are restrictions on bathing.", "Gastrostomy is necessary.", "Prone to aspiration pneumonia."], "answer": ["c"]}
{"problem_id": "113A24", "problem_text_en": "A 45-year-old woman complained of fever, cough, and dyspnea. She had a cough for a week since the beginning of July, had a fever of around 37 degrees Celsius three days ago, and came to the hospital yesterday because of dyspnea. She has had the same symptoms every year from early June to August for the past three years, and was also hospitalized last year. She has been living in an apartment built 25 years ago, and has many hobby plants indoors. Fine crackles were heard in both chest fields, and diffuse, scattered, granular shadows were seen on chest X-ray. Trichosporon asahii-specific antibodies were positive. Which of the following is unlikely to be found in this patient?", "choices_en": ["Elevated IgE levels", "Positive home test result", "Restrictive ventilation disorder", "Granuloma in lung pathology", "Decreased CD4/CD8 ratio in bronchoalveolar lavage fluid"], "answer": ["a"]}
{"problem_id": "113A25", "problem_text_en": "An 18-year-old girl was brought to the clinic by her mother, who was concerned about her daughter's unusual behavior. Yesterday, the girl returned home crying in distress after breaking up with her boyfriend, whom she had been dating for some time. Two hours after arriving home, she asked her mother in a child-like and whimsical manner, \"Mom, can you make the usual sweets?\" When her mother asked her about her distress earlier, she answered, \"What are you talking about?\" and had no memory of it. Physical examination, including a neurological exam, showed no abnormalities. Blood tests, brain imaging, and EEG found no abnormalities. Which of the following is true about this patient?", "choices_en": ["To be in a state of unconsciousness.", "Hospitalization is necessary.", "Cognitive behavioral therapy is effective.", "It is highly likely to be in the early stages of schizophrenia.", "It is a disorder of recurrent and intrusive recollection of a stressful event."], "answer": ["e"]}
{"problem_id": "113A26", "problem_text_en": "A 32-year-old woman complains of dizziness. This morning, while cleaning her ear, she was hugged from behind by her child, and the cotton swab entered her right ear. She experienced decreased hearing and spinning dizziness, and came to the hospital because the symptoms did not improve. She also has right ear ringing that continues. A small perforation is recognized in the right eardrum, and a mild hearing loss is observed on the right side on the hearing test with an air-bone gap of 10dB. There is no obvious abnormality seen in the temporal bone CT. Which of the following conditions requires urgent surgery if it occurs within a few days?", "choices_en": ["Onset of ear discharge", "Aggravation of dizziness", "Onset of taste disorder", "Enlargement of tympanic membrane perforation", "Reduction of air-conduction bone-conduction gap"], "answer": ["b"]}
{"problem_id": "113A27", "problem_text_en": "A 60-year-old man presents with chief complaint of hematuria. He has occasionally noticed blood in his urine for the past 3 months but did not seek medical attention as it spontaneously resolved. He now presents because of persistent hematuria for the past 2 days. He has a 40-year history of smoking 20 cigarettes per day and drinks one cup of Japanese sake per day. His height is 165 cm, weight is 62 kg, and blood pressure is 128/78 mmHg. His urine analysis showed many red blood cells per high power field in the sediment and 5-10 white blood cells per high power field. A cystoscopy image is also shown. What is the most appropriate treatment?", "choices_en": ["Molecular targeted drug", "Radiation exposure", "Radical cystectomy", "Partial cystectomy", "Transurethral resection of bladder tumor (TURBT)"], "answer": ["e"]}
{"problem_id": "113A28", "problem_text_en": "A 3-year-old boy was diagnosed with a heart murmur at around 1 month after birth and had been under observation. The oxygen saturation levels in the cardiac chambers measured during a cardiac catheterization for evaluation of shunt disease are as follows: Superior vena cava: 82.5%, Inferior vena cava: 87.8%, Right atrium: 92.9%, Right ventricle: 91.3%, Pulmonary artery: 92.8%, Left atrium: 98.9%, Left ventricle: 98.5%, and Aorta: 98.4%. What is the most likely diagnosis?", "choices_en": ["Ventricular septal defect", "Atrial septal defect", "Patent ductus arteriosus", "Coarctation of the aorta", "Ebstein anomaly"], "answer": ["b"]}
{"problem_id": "113A29", "problem_text_en": "A 73-year-old man was pointed out an abnormality on chest X-ray during medical checkup and came for consultation. He has been on antihypertensive medication since the age of 65 and has a smoking history of 20 cigarettes per day for 50 years. He was diagnosed with adenocarcinoma by bronchoscopy with brushing cytology. FDG-PET showed accumulation corresponding to the tumor, but no abnormal accumulation was seen in other sites. Chest X-ray (frontal) (A) and chest CT (B) are shown separately. Which examination should be performed to determine the treatment plan?", "choices_en": ["Pulmonary function test", "Tumor markers", "Swallowing function test", "Sputum culture test", "Abdominal ultrasound examination"], "answer": ["a"]}
{"problem_id": "113A30", "problem_text_en": "A 62-year-old man presents to the clinic with the chief complaint of hematuria. He was told by his family a week ago that his face looked yellow, and he noticed hematuria at the same time. He visited the clinic because his urine became increasingly red three days ago, and he also feels fatigued. He has no smoking history and drinks alcohol occasionally. His pulse is regular at 84 beats per minute, and his blood pressure is 132/80 mmHg. His conjunctiva is anemic, and his eye sclera is yellow. A systolic ejection murmur is heard at the second right intercostal space. His abdomen is flat and soft, with no palpable liver or spleen. Urinalysis: protein negative, glucose negative, 3+ occult blood, hemosiderin seen in sediment. Blood tests: red blood cells 1.76 million, Hb 7.0 g/dL, Ht 19%, reticulocytes 7%, white blood cells 7,800 (neutrophils 10%, segmented neutrophils 70%, eosinophils 1%, basophils 1%, monocytes 6%, lymphocytes 12%), platelets 220,000, PT-INR 1.3 (reference 0.9-1.1), APTT 37.7 seconds (reference 32.2), plasma fibrinogen 377 mg/dL (reference 200-400), FDP 26 μg/mL (reference 10 or less), D-dimer 9.7 μg/mL (reference 1.0 or less), antithrombin 65% (reference 80-130). Blood chemistry tests: total protein 6.5 g/dL, albumin 3.6 g/dL, total bilirubin 8.2 mg/dL, direct bilirubin 1.1 mg/dL, AST 35 U/L, ALT 28 U/L, LD 1,987 U/L (reference 176-353), ALP 234 U/L (reference 115-359), urea nitrogen 29 mg/dL, creatinine 0.9 mg/dL, glucose 84 mg/dL, Na 143 mEq/L, K 4.0 mEq/L, Cl 104 mEq/L. What is the most likely diagnosis for this patient?", "choices_en": ["Extravascular hemolysis", "Spherocytosis", "Reduction of erythroblasts in bone marrow", "Rise in haptoglobin level", "GPI anchor protein deficient red blood cells"], "answer": ["e"]}
{"problem_id": "113A31", "problem_text_en": "A 78-year-old man underwent a pre-admission examination for a nursing home and was found to have an abnormal syphilis serology, so he visited a doctor. He had a history of syphilis and had received treatment for it. RPR was less than 1-fold (less than the standard value), and TPHA was 640-fold (less than the standard value of 80-fold). No obvious rash was observed. Which of the following is the appropriate response?", "choices_en": ["\"No treatment is necessary.\"", "\"We will conduct an antinuclear antibody (ANA) test.\"", "\"We will perform treatment with penicillin orally.\"", "\"You must report to the public health center within 7 days\"", "\"We will perform a repeat blood serum antibody titer test after 3 months.\""], "answer": ["a"]}
{"problem_id": "113A32", "problem_text_en": "An 11-day-old female neonate was brought to the hospital by her parents because she had been vomiting repeatedly and had decreased breastfeeding capacity for 2 days. She was born at 39 weeks of gestation, weighed 3,180 g at birth and had Apgar scores of 9 points at both 1 and 5 minutes after birth. Although she was exclusively breastfed, her feeding was good until 3 days ago and she had been excreting yellow granular stools twice daily. The family received notice from the birthing center that the newborn screening test showed abnormalities. At the time of the hospital visit, the baby was unenergetic, and her crying was weak. She was 52 cm in length, weighed 3,230 g, had a body temperature of 36.3℃, a heart rate of 160 beats/min which was regular, a blood pressure of 60/30 mmHg, a respiratory rate of 50 breaths/min, and an SpO2 of 96% on room air. Her capillary refill time was 4 seconds which was delayed. She showed general pigmentation and mild jaundice. No abnormalities were detected in heart sounds and breathing sounds. Her abdomen was flat and soft with a palpable liver of 1.5 cm below the right costal arch, but no palpable spleen. There were no unusual bowel sounds. The diameter of the anus was 1.5 cm and slightly concave. Clitoromegaly was present. Blood tests were ordered for diagnosis. Which of the following blood test results is likely to be significantly elevated?", "choices_en": ["Blood sugar (glucose)", "Potassium", "Venous blood pH", "Ammonia", "Direct bilirubin"], "answer": ["b"]}
{"problem_id": "113A33", "problem_text_en": "A 38-year-old woman complains of a sense of fullness in the anterior thorax and is seeking medical attention. She has been aware of this sensation for the past 2 years during ingestion of food, but her symptoms have worsened over the past month, making adequate food intake difficult. She has no significant medical history. She is conscious and alert, with a height of 155 cm and a weight of 44 kg. Blood test results: erythrocytes 3.98 million, Hb 12.9 g/dL, leukocytes 6,300, platelets 190,000. Blood biochemistry test results: total protein 7.1 g/dL, albumin 4.2 g/dL, total bilirubin 0.9 mg/dL, AST 22 U/L, ALT 19 U/L, LD 195 U/L (reference range 176-353), creatinine 0.8 mg/dL, glucose 88 mg/dL, Na 140 mEq/L, K 4.3 mEq/L, Cl 100 mEq/L. Upper gastrointestinal endoscopy (A) and esophageal contrast imaging (B) are shown separately. What is unlikely to be seen in this patient?", "choices_en": ["Dysphagia", "Chest pain", "Cough", "Acid ingestion", "Weight loss"], "answer": ["d"]}
{"problem_id": "113A34", "problem_text_en": "A 57-year-old man visited the hospital with complaints of dizziness. He had started taking disopyramide for paroxysmal atrial fibrillation two weeks ago. Although the frequency of palpitation attacks had decreased, he occasionally felt dizzy and visited the hospital yesterday. He subsequently underwent a Holter electrocardiogram test, and the attending physician contacted him to encourage further examination after receiving a report of an abnormal finding from the analysis department. The patient arrived at the hospital with clear consciousness, a pulse rate of 76 beats/min with arrhythmia, blood pressure of 112/62 mmHg, a respiratory rate of 16 breaths/min, and no abnormalities in heart sounds or breathing sounds. There were no visible abnormalities in the neurological examination. Another Holter electrocardiogram is shown. Which of the following is the appropriate response at this point?", "choices_en": ["Atropine administration", "Discontinuation of Disopyramide", "Cardioversion", "Catheter ablation", "Implantation of a permanent pacemaker"], "answer": ["b"]}
{"problem_id": "113A35", "problem_text_en": "A 25-year-old woman is transported by ambulance due to impaired consciousness. This morning, she suddenly complained of a headache at home and then lost consciousness without responding to calls, so her family requested an ambulance. The patient's consciousness level is JCS III-100, body temperature is 36.8℃, heart rate is 92 beats/min, regular, blood pressure is 160/92 mmHg, and respiratory rate is 16 breaths/min. Tracheal intubation was performed due to tongue base dropping. The SpO2 is 98% (with a reservoir mask under 10 L/min oxygen administration). The pupil diameter is 3 mm in the right eye and 4 mm in the left eye, and the left eye has lost the light reflex. Head CT (A) and cerebral angiography (B) on admission are shown separately. What should be done first?", "choices_en": ["Revascularization surgery", "Thrombolytic therapy", "Coil embolization therapy", "Stent placement surgery", "Ventriculoperitoneal shunt surgery"], "answer": ["e"]}
{"problem_id": "113A36", "problem_text_en": "A 42-year-old man presented with a chief complaint of loss of consciousness on an empty stomach. He has experienced a feeling of faintness on an empty stomach since he was 30 years old and had experienced symptom improvement after consuming juice or candy. He had a syncope attack during fasting prior to endoscopic examination, and blood examination revealed low blood sugar (46 mg/dL). His mother had a history of urinary stone fragmentation surgery and his maternal grandmother had a history of pituitary adenoma surgery. His height is 170 cm, weight is 89 kg. His pulse rate is 88 beats/min and regular. Blood pressure is 140/92 mmHg. There are no abnormalities in heart sounds and breath sounds. Tenderness is found on percussion on the left lumbar region. Blood chemistry results were: Total protein 8.2 g/dL, Albumin 4.4 g/dL, AST 42 U/L, ALT 62 U/L, Blood urea nitrogen 19 mg/dL, Creatinine 0.9 mg/dL, Na 142 mEq/L, K 4.2 mEq/L, Cl 102 mEq/L, Ca 13.2 mg/dL, P 2.3 mg/dL, and Fasting blood sugar was 54 mg/dL. Insulin was 42 U/L (reference value: 17 or less). Which of the following is not useful for diagnosis?", "choices_en": ["Abdominal contrast-enhanced CT scan", "Neck ultrasound examination", "Pituitary contrast-enhanced MRI", "Measurement of catecholamines in blood", "Measurement of anterior pituitary hormones in the blood"], "answer": ["d"]}
{"problem_id": "113A37", "problem_text_en": "An 8-month-old boy was brought to the clinic by his parents who were concerned that he has stopped smiling. He was born at 39 weeks and 3 days of gestation, weighed 3,240 g at birth, and had Apgar scores of 8 at 1 minute and 10 at 5 minutes. He acquired social smiles at 2 months, head control at 3 months, and sitting position at 7 months. Since 1 month ago, he has been smiling less often and his facial expression has become dull. His sitting position has gradually become unstable. Two weeks ago, he started to repeatedly flex his limbs for about 10 seconds at intervals of about 20 times a day when he bends his head forward, and he often cries after this movement. What is the most likely cause of this condition?", "choices_en": ["West syndrome", "Absence epilepsy", "Angry seizure", "Lennox-Gastaut syndrome", "Benign childhood epilepsy with centrotemporal spikes (BCECTS)"], "answer": ["a"]}
{"problem_id": "113A38", "problem_text_en": "A 62-year-old man complains of difficulty moving the entire right side of his face. He had experienced right ear pain three days prior. This morning, he noticed water getting into his eye during face washing and food spilling out of his mouth during meals, which prompted him to seek medical attention. Small blisters are observed on the right auricle and ear canal. There are no apparent abnormalities in the oral cavity or pharynx. There is no fever, and blood test results are normal. Which of the following is the most likely concomitant condition?", "choices_en": ["Hoarseness", "Loss of sense of smell", "Visual impairment (or Visual deterioration)", "Conductive hearing loss", "Balance disorder"], "answer": ["e"]}
{"problem_id": "113A39", "problem_text_en": "A 17-year-old girl presents with a chief complaint of syncope. Two weeks ago, she felt unwell while jogging and squatted down. Later, she lost consciousness for about a minute. A week ago, she lost consciousness for about two minutes during a softball game. The next day, she became worried and visited a nearby clinic, where she was referred due to an abnormal electrocardiogram. The patient is alert and oriented. She is 147 cm tall and weighs 48 kg. Her temperature is 36.0°C, pulse rate is 76 beats/minute and regular, blood pressure is 126/64 mmHg, and respiratory rate is 18 breaths/minute. There are no abnormalities in the conjunctiva or cornea. A bruit is not audible in the carotid arteries, and there is no distension of the jugular vein. A grade III/VI systolic ejection murmur is heard at the third right sternal border. No abnormal breathing sounds are heard. The abdomen is flat, soft, and non-tender. No edema is visible in the lower legs. The dorsalis pedis pulses are palpable bilaterally. No neurological abnormalities are observed. Laboratory data shows a red blood cell count of 4.56 million/μL, Hb of 14.5 g/dL, white blood cell count of 8,900/μL, and platelet count of 170,000/μL. Transthoracic echocardiogram images (A-C) are shown separately. Which of the following explanations is not appropriate for the patient?", "choices_en": ["\"The walls of the heart are thickening\"", "\"Please avoid vigorous exercise\"", "\"An examination is necessary to determine the presence of arrhythmia.\"", "\"There is a large amount of water accumulated around the heart\".", "\"There are cases in which blood relatives develop the same disease.\""], "answer": ["d"]}
{"problem_id": "113A40", "problem_text_en": "A 78-year-old man presents with the chief complaint of hemoptysis. He came in due to blood in sputum occurring several times a day for the past month. He does not report fever or cough. He had a health checkup 6 months ago and no abnormalities were noted. He has a smoking history of 20 cigarettes/day for 58 years. His temperature is 36.7°C, pulse rate is 64 beats/min and regular, blood pressure is 122/78 mmHg, respiratory rate is 16 breaths/min, and SpO2 is 97% on room air. There is no abnormality observed in the conjunctiva and eyeball. There are no abnormalities detected in heart sounds and lung sounds. There are no abnormalities observed in blood tests or chest CT. The Papanicolaou-stained specimen for sputum cytology is shown separately. What is the next test to be conducted?", "choices_en": ["Bronchoscopy examination", "Thoracoscopy examination.", "Mediastinoscopy", "Chest MRI", "Positron emission tomography/computed tomography (PET/CT)"], "answer": ["a"]}
{"problem_id": "113A41", "problem_text_en": "A 57-year-old woman presents with a complaint of lower limb rash. She has been experiencing frequent outbreaks of small to large papules and nodules associated with severe pruritus over the past six months. She was prescribed topical corticosteroid cream by a clinic close to her home, which provided temporary relief but did not completely resolve her symptoms. On examination, multiple small to large nodules and papules are found on her lower limb. The surface of the rash appears shiny and purple-red in color with white lines. She has no significant medical history and is not taking any medications. A skin biopsy reveals liquefaction degeneration of the basal cells of the epidermis and infiltration of band-shaped cells beneath the epidermis. The image of the skin on the lower limb (A) and the H-E stained sample of the biopsy tissue (B) are shown separately. What other site should be further examined?", "choices_en": ["Scalp", "Oral mucosa", "Axilla (armpit)", "Back", "Umbilicus (navel or belly button)"], "answer": ["b"]}
{"problem_id": "113A42", "problem_text_en": "A 70-year-old woman presents with fever and pain in the right hypochondriac region. Six months ago, she underwent percutaneous coronary intervention (stent placement) for acute coronary syndrome and is taking two types of antiplatelet agents. She had been aware of dull pain in the right hypochondriac region for a week. She visited the emergency department because she developed high fever and severe pain in the right hypochondriac region before going to bed last night. Her consciousness was clear, body temperature was 38.4℃, pulse rate was 88/min, regular, blood pressure was 142/92 mmHg, respiratory rate was 20/min, and SpO2 was 96% (room air). No conjunctival anemia was observed, but conjunctival icterus was observed. There were no abnormal heart sounds or breath sounds. The abdomen was flat and no liver or spleen were palpable. Tenderness was observed from the right hypochondriac region to the epigastric region without muscle defense. Blood tests showed RBC of 3.98 million/μL, Hb of 12.5 g/dL, Ht of 40%, WBC of 15,300/μL, and platelet of 210,000/μL. Biochemical blood tests showed total protein of 6.9 g/dL, albumin of 3.7 g/dL, total bilirubin of 4.9 mg/dL, direct bilirubin of 3.9 mg/dL, AST of 282 U/L, ALT of 164 U/L, LD of 478 U/L (standard range: 176-353), ALP of 849 U/L (standard range: 115-359), γ-GTP of 632 U/L (standard range: 8-50), amylase of 210 U/L (standard range: 37-160), creatinine of 0.8 mg/dL, blood sugar of 99 mg/dL, Na of 140 mEq/L, K of 4.4 mEq/L, and Cl of 99 mEq/L. CRP was 10 mg/dL. The horizontal CT images (A, B) and coronary CT image (C) after contrast-enhancement of the abdomen are shown. What should be done first?", "choices_en": ["Cholecystectomy", "Percutaneous transhepatic biliary drainage", "Endoscopic biliary drainage.", "Endoscopic sphincterotomy", "Extracorporeal shock wave lithotripsy (ESWL)"], "answer": ["c"]}
{"problem_id": "113A43", "problem_text_en": "A 66-year-old woman presents with the chief complaint of swelling in the lower legs. She was diagnosed with rheumatoid arthritis 2 years ago. At the time of diagnosis, she had stiffness in the morning that lasted until afternoon and interfered with housework, but her symptoms have been mostly controlled with the oral administration of prednisolone and bucillamine. She visited the clinic because she had noticed swelling in her face and both lower legs for 1 month, with a 2 kg increase in body weight. She has never had any abnormalities in urine tests. Her family history includes rheumatoid arthritis in her paternal grandmother, but no kidney disease. She is 160 cm tall and weighs 55 kg. Her pulse rate is regular at 72 bpm. Her blood pressure is 154/80 mmHg, and her respiratory rate is 12 breaths/min. No abnormalities are observed in the head and neck or the chest and abdomen. Soft pitting edema is found in the lower legs, but there is no tenderness, swelling or deformity in the joints. Urinalysis shows 3+ proteinuria, (-) glucose, (±) occult blood, and 2-3 dysmorphic red blood cells per HPF in the sediment. The urinary protein/creatinine ratio on spot urine is 1.5 g/g creatinine (normal <0.15). Blood tests show a red blood cell count of 3.95 million, hemoglobin of 13.2 g/dL, hematocrit of 40%, white blood cell count of 7,800, and platelets of 100,000. Serum biochemistry shows a total protein of 6.2 g/dL, albumin of 3.5 g/dL, blood urea nitrogen of 13 mg/dL, and creatinine of 0.5 mg/dL. Her CRP is 0.2 mg/dL. Abdominal ultrasound examination shows no abnormalities in the kidneys. What is the most appropriate management for this patient?", "choices_en": ["Perform a renal biopsy.", "Start NSAIDs.", "Increase the dosage of bushiramin.", "Start biological preparations.", "Reduce the dosage of prednisolone."], "answer": ["a"]}
{"problem_id": "113A44", "problem_text_en": "An 81-year-old man presented with difficulty swallowing. He has been aware of difficulty swallowing for one month and visited the hospital because eating became difficult 2 weeks ago. He is undergoing hormone therapy for prostate cancer. He is 160 cm in height and weighs 56 kg. His body temperature is 36.1℃, pulse rate 72 bpm and regular, blood pressure 136/88 mmHg, and respiratory rate 14 bpm. There is no enlargement of the thyroid gland and no palpable cervical lymph nodes. There are no abnormalities in heart and breath sounds. His abdomen is flat and soft, and no liver or spleen enlargement is palpable. An upper digestive tract endoscopic image is shown separately. What is the most likely diagnosis?", "choices_en": ["Barrett's esophagus", "Reflux esophagitis", "Eosinophilic esophagitis", "Esophageal achalasia", "Esophageal candidiasis"], "answer": ["e"]}
{"problem_id": "113A45", "problem_text_en": "Which of the following explanations given to a 32-year-old woman who presented with amenorrhea and a positive pregnancy test, and was diagnosed with a complete mole at 10 weeks' gestation based on a cluster of small cystic structures measuring 12 cm within the uterus on ultrasound examination, is inappropriate?", "choices_en": ["\"The fetus is not growing\"", "\"A hysterectomy (removal of the uterus contents) is necessary\"", "\"20% will become invasive mole\"", "\"You should not get pregnant in the future\"", "\"We will measure human chorionic gonadotropin (hCG) to monitor the post-treatment progress.\""], "answer": ["d"]}
{"problem_id": "113A46", "problem_text_en": "A 65-year-old man presented with a gradually increasing mass in the left neck and dysphasia as the main complaints. A 2.5 cm elastic-hard lymph node was palpable in the left neck. No tenderness was observed. Squamous cell carcinoma was diagnosed on a cytological examination of the lymph node by fine-needle aspiration biopsy. He has smoked 20 cigarettes per day for 30 years and consumed 4 Japanse cups of sake (approximately 720 ml) per day for 45 years. An endoscopic image of another body part is also shown. What is the possible diagnosis?", "choices_en": ["Laryngeal cancer", "Nasopharyngeal cancer", "Nasopharyngeal cancer", "Hypopharyngeal cancer", "Cervical esophageal cancer"], "answer": ["d"]}
{"problem_id": "113A47", "problem_text_en": "A 64-year-old man complains of difficulty speaking and weight loss. He has been aware of speech difficulties for the past six months and has been told by colleagues that his voice is too quiet to hear. For the past two months, he has taken longer to eat, and has lost 5 kg in weight during this period. One month ago, he found it difficult to use chopsticks because of weakness in both hands, and also had difficulty going up and down stairs, so he visited the hospital. He is conscious, with no restriction of eye movement, and no abnormality in facial sensation, but has weakness of the masseter and orbicularis oris muscles, as well as atrophy and fasciculation of the tongue. There is mild limb muscle atrophy, moderate muscle weakness in the distal parts of the limbs, as well as fasciculation and atrophy of the fibrous bundles in the anterior thorax, left upper arm, and both thighs. Tendon reflexes are generally hyperactive, with a false ankle clonus present bilaterally, and the Babinski sign is positive bilaterally. There is no sensory impairment in the limbs or trunk. Blood chemistry tests show total protein of 5.8 g/dL, albumin of 3.5 g/dL, blood urea nitrogen of 11 mg/dL, creatinine of 0.4 mg/dL, blood sugar of 85 mg/dL, HbA1c of 4.5% (normal range 4.6-6.2), and CK of 182 U/L (normal range 30-140). Arterial blood gas analysis (room air) reveals pH of 7.38, PaCO2 of 45 Torr, PaO2 of 78 Torr, and HCO3- of 23 mEq/L. Respiratory function tests show %VC of 62%. No abnormalities are detected in the peripheral nerve conduction test. The needle electromyogram shows spontaneous potentials and positive sharp waves at rest, and high-amplitude potentials during muscle contraction in the trapezius, first dorsal interosseous muscle, and quadriceps femoris muscles. No abnormalities are detected in cervical X-rays or head MRI. Swallowing contrast study reveals retention of the contrast agent in the pyriform sinus and mild airway inflow. What should be considered at this point?", "choices_en": ["Gastrostomy", "Tracheostomy", "Oral administration of morphine", "Edaravone injection", "Oral administration of Riluzole"], "answer": ["a"]}
{"problem_id": "113A48", "problem_text_en": "An 82-year-old man presents with the chief complaint of fatigue. He noticed his face turning pale three months ago and began experiencing shortness of breath and fatigue. Two months ago, he began to feel a change in taste and numbness in his hands and feet. He came to the hospital because his fatigue has worsened over the past three weeks. He had a total gastrectomy for gastric cancer 20 years ago. He is 172 cm tall and weighs 56 kg. His body temperature is 36.2°C. His pulse is 92 beats/min and regular, and his blood pressure is 102/66 mmHg. His respiratory rate is 18 breaths/min. His conjunctiva is anemic in appearance, and there is no yellowing of the sclera. His abdomen is flat, soft, and non-tender with no palpable liver or spleen. There is a surgical scar in the midline of his upper abdomen. There is slight edema in both lower legs, and there is peripheral dominant sensory disturbance in both lower limbs. Blood test results: Red blood cell count 1.62 million, Hb 6.2 g/dL, Ht 21%, white blood cell count 3,300, platelet count 110,000. Blood chemistry: Total protein 5.8 g/dL, albumin 2.8 g/dL, total bilirubin 1.6 mg/dL, AST 24 U/L, ALT 32 U/L, LD 648 U/L (reference range 176-353), blood urea nitrogen 11 mg/dL, creatinine 0.7 mg/dL, and blood glucose 106 mg/dL. What should be administered first?", "choices_en": ["Iron supplement", "Zinc preparations", "Nicotinic acid preparations", "Calcium supplement", "Vitamin B$_{12}$ preparation"], "answer": ["e"]}
{"problem_id": "113A49", "problem_text_en": "A 24-year-old woman presents with a complaint of abnormal vaginal bleeding. She began experiencing small amounts of bleeding two days after the end of menstruation, which persisted for ten days, leading her to seek medical attention. Her menstrual cycle is irregular, lasting for 5 days and occurring every 40-90 days. She is 162 cm tall, weighs 74 kg and her body temperature is 36.5℃. Her pulse rate is 72 beats/min and her blood pressure is 122/68 mmHg. Her respiratory rate is 18 breaths/min. On pelvic examination, the uterus is of normal size, soft and non-tender, and a small amount of blood is seen at the external os of the cervix. No abnormalities are noted in the adnexa bilaterally. Which of the following tests is inappropriate at this point in time?", "choices_en": ["Pregnancy reaction", "Abdominal contrast-enhanced CT", "Transvaginal ultrasound examination", "Sex hormone test", "Cervical cytology"], "answer": ["b"]}
{"problem_id": "113A50", "problem_text_en": "A 75-year-old woman complains of discomfort in the external genital area and abnormal genital bleeding. She has no fever, itching, or pain. Menopause occurred at the age of 52. A tumor is observed with elevated margins and an ulcer in the center, located on the outer side of the left labia majora. An enlarged lymph node is palpated on the left side of the groin. A photograph of the external genitalia is provided separately. What is the most likely diagnosis?", "choices_en": ["Vulvar cancer", "Genital herpes", "Candida vulvovaginitis", "Genital warts", "Bartholin gland cyst"], "answer": ["a"]}
{"problem_id": "113A51", "problem_text_en": "A 56-year-old woman presented with complaints of headache and fever. Two weeks prior, she went mountain vegetable picking and several days later, blisters appeared on the posterior part of her right ear. Four days ago, she developed headache and fever followed by a rash all over her body yesterday. She visited a nearby clinic three days ago and was prescribed cephalosporin antibiotics, but her symptoms did not improve. She has no significant medical history, no smoking history, no travel history, and no history of pet ownership. Her level of consciousness is clear. She has a body temperature of 40.1°C, a pulse rate of 108/min, regular, a blood pressure of 150/82mmHg, a respiratory rate of 24/min, and 96% SpO2 (room air). There are no abnormalities in the eyelid conjunctiva or oral mucosa, and no palpable lymphadenopathy or neck stiffness. There are no abnormal heart or breath sounds. The abdomen is flat, soft, and not palpable for liver or spleen. There are red papules scattered in the trunk without a tendency to close. A photo of the posterior lower part of the right earlobe is shown separately. Blood test showed RBC 4.97 million, Hb 14.8 g/dL, Ht 46%, WBC 2,400 (polymorphonuclear granulocyte 75%, eosinophil 0%, basophil 1%, monocyte 3%, lymphocyte 21%, atypical lymphocytes 0%), and platelets 110,000. Blood biochemistry showed total protein 6.5 g/dL, albumin 3.8 g/dL, total bilirubin 1.6 mg/dL, AST 500 U/L, ALT 275 U/L, LD 881 U/L (range 176-353), ALP 1,477 U/L (range 115-359), γ-GTP 326 U/L (range 8-50), amylase 73 U/L (range 37-160), CK 86 U/L (range 30-140), blood urea nitrogen 10 mg/dL, and creatinine 0.7 mg/dL. CRP was 5.3 mg/dL. What is the most likely diagnosis?", "choices_en": ["Dengue fever", "Malaria", "Scabies disease", "Infectious mononucleosis", "Leptospirosis"], "answer": ["c"]}
{"problem_id": "113A52", "problem_text_en": "A 74-year-old man complains of dyspnea. He has been aware of shortness of breath when climbing stairs for the past six months. Symptoms worsened two days ago, and he now experiences dyspnea even at rest, so he visited the hospital. His temperature is 36.4°C. His pulse rate is 112 beats/min and regular. Blood pressure is 152/82 mmHg. Respiratory rate is 20 breaths/min. SpO2 is 95% (room air). Coarse crackles are heard on both lower chest auscultation. Chest X-ray (A) is shown separately. Electrocardiogram shows atrial fibrillation without ST-T changes, and echocardiograms (B and C) are shown separately. The following is a conversation between a resident and a supervising physician regarding this case. Resident: \"A patient with heart failure has presented to the hospital.\" Supervisor: \"I met him earlier. How were his heart sounds?\" Resident: \"He had an (A) sound.\" Supervisor: \"What about heart murmurs?\" Resident: \"I heard a (B) systolic murmur of Levine III/VI.\" Supervisor: \"Will the intensity of the heart murmur change with position or breathing?\" Resident: \"(C).\" Supervisor: \"What about the findings on the jugular vein?\" Resident: \"Jugular vein pulsation is observed up to the height of the sternal angle with raising the upper body at 45 degrees. I think the estimated central venous pressure is (E) mmHg.\" Supervisor: \"What about palpation?\" Resident: \"Cardiac apex beat was palpable at (O).\" Which combination of (A) to (O) is correct for the conversation content regarding this case?", "choices_en": ["Sorry, the given choice of the question seems incomplete or contains an error. It is difficult to provide an accurate translation without the complete sentence. Please provide the complete text of the question or the choice.", "It radiates to the neck", "Auscultation in the upright (W) position increases the noise with a forward lean", "Option is incomplete. It has only one character 'エ'. Please provide the complete option for accurate translation.", "Inside the O-Clavicular (O is used as a symbol and not a word)"], "answer": ["a"]}
{"problem_id": "113A53", "problem_text_en": "A 66-year-old man was admitted for treatment of common bile duct stones and underwent endoscopic stone removal. Two hours after completion of the procedure, he complained of persistent epigastric and back pain. His temperature was 37.5 ℃, blood pressure was 94/66 mmHg, and pulse rate was 108 beats/min, regular. His respiratory rate was 24 breaths/min and his oxygen saturation was 94% on room air. His abdomen was flat and diffusely tender, with tenderness centered on the epigastric region. Laboratory findings were as follows: red blood cells 5.02 million/μL, hemoglobin 15.3 g/dL, hematocrit 45%, white blood cells 12,700/μL, platelets 260,000/μL, prothrombin time-international normalized ratio (PT-INR) 1.1 (reference range 0.9-1.1), total bilirubin 4.4 mg/dL, aspartate aminotransferase (AST) 370 IU/L, alanine aminotransferase (ALT) 177 IU/L, lactate dehydrogenase (LD) 491 IU/L (reference range 176-353), gamma-glutamyl transferase (γ-GTP) 337 IU/L (reference range 8-50), amylase 1,288 IU/L (reference range 37-160), blood urea nitrogen (BUN) 23 mg/dL, creatinine 1.2 mg/dL, and C-reactive protein (CRP) 9.3 mg/dL. Abdominal contrast-enhanced computed tomography (CT) scan was performed and is shown separately. Which of the following is not an appropriate treatment option for this patient?", "choices_en": ["Fasting", "Large-volume fluid resuscitation", "Administration of painkillers", "Administration of antibiotics", "Emergency cholecystectomy"], "answer": ["e"]}
{"problem_id": "113A54", "problem_text_en": "A 65-year-old woman was pointed out abnormal shadow during a medical checkup mammogram and visited a hospital. A mass with a long diameter of 2 cm is palpable in her right breast. The tumor is circular, has good mobility and is elastic-hard. No discharge is observed from the nipple. A separate mammogram is shown, with an irregular low-echoic tumor image on breast ultrasonography. What test should be conducted next?", "choices_en": ["Ductography", "Fine needle aspiration cytology (FNAC)", "Abdominal Contrast-enhanced CT", "Tumor marker measurement", "Measurement of blood estradiol levels"], "answer": ["b"]}
{"problem_id": "113A55", "problem_text_en": "A 29-year-old woman complains of fever and fatigue in the left upper limb. She has had a fever of around 37°C for the past 2 weeks, and taking over-the-counter cold medications did not improve her condition. She began to feel fatigue in her left upper limb 7 days ago. She visited the hospital because her fever recently rose to the 38°C range. On examination, her temperature was 38.1°C, pulse rate was 88 beats/min and regular, blood pressure was 92/46 mmHg in the right upper limb and 64/34 mmHg in the left upper limb, and respiratory rate was 16 breaths/min. A bruit was heard in the left neck vasculature. The radial arteries were palpable, but there was a difference in palpation between the right and left sides, with the left being weakened. Heart and breath sounds were normal. The abdomen was flat, soft and there was no palpable liver or spleen, and no tenderness. There was no rash. Urinalysis was normal. Laboratory results showed a red blood cell count of 4.03 million/μL, hemoglobin of 10.0 g/dL, hematocrit of 30%, white blood cell count of 10,900/μL (neutrophils 75%, eosinophils 1%, basophils 1%, monocytes 7%, lymphocytes 16%), and platelet count of 460,000/μL. Blood biochemistry showed a blood urea nitrogen level of 13 mg/dL and creatinine level of 0.5 mg/dL. Immunological serum findings showed a C-reactive protein level of 11 mg/dL, negative antinuclear antibodies, and negative rheumatoid factor. The horizontal image (A) and coronal image (B) of chest computed tomography are separately shown. What is the most likely diagnosis?", "choices_en": ["Behçet's Disease.", "Rheumatoid arthritis", "Polyarteritis nodosa", "Microscopic polyangiitis", "Takayasu arteritis (a type of vasculitis)"], "answer": ["e"]}
{"problem_id": "113A56", "problem_text_en": "An 81-year-old female is admitted to the hospital for rehabilitation after a cerebral infarction. She had been receiving antibiotics for bacterial pneumonia which complicated her condition from two weeks ago. Since a week ago, she has started to complain of abdominal pain and diarrhea, and the diarrhea became frequent from yesterday. She is alert and responsive. She is 156 cm tall, weighs 41 kg, has a body temperature of 37.9℃, a pulse rate of 80 bpm which is irregular, a blood pressure of 146/90 mmHg, and a respiratory rate of 16/min. She is receiving oxygen at 3 L/min via nasal cannula, and her SpO2 is 96%. No abnormal heart sounds are observed, but coarse crackles are heard in both lung fields. Her abdomen is flat and neither liver nor spleen is palpable, but tenderness is noted in the left lower quadrant. She exhibits incomplete paralysis in her left upper and lower extremities. Laboratory findings include red blood cells 3.58 million/μL, Hb 10.9 g/dL, white blood cells 13,300/μL, and platelets 190,000/μL. Her blood chemistry tests show total protein 5.7 g/dL, albumin 2.9 g/dL, total bilirubin 0.9 mg/dL, AST 26 U/L, ALT 19 U/L, LD 245 U/L (normal range 176-353), creatinine 1.1 mg/dL, blood glucose level 98 mg/dL, HbA1c 7.1% (normal range 4.6-6.2%), Na 138 mEq/L, K 3.4 mEq/L, and Cl 101 mEq/L. CRP level is 3.1 mg/dL. What is the next appropriate examination to be performed?", "choices_en": ["Botulinum toxin", "Beta-D-Glucan", "Helicobacter pylori antigen in stool", "C. difficile toxin in the stool", "Interferon-gamma release assay (IGRA) for tuberculosis-specific mycobacterium"], "answer": ["d"]}
{"problem_id": "113A57", "problem_text_en": "A 24-year-old man presents complaining of hematuria. He reports no previous history of urinary issues. Four days ago, he had a sore throat and a fever of 38°C. Hematuria began yesterday, so he sought medical care. His temperature is 37.8°C and pulse is 72 beats per minute, regular. Blood pressure is 120/78 mmHg. The tonsils are enlarged, but there is no facial or lower extremity edema or rash. Urinalysis shows +++ protein, +++ occult blood, and >100 red blood cells per high-power field. The spot urine protein/creatinine ratio is 2.0 g/g creatinine (normal range <0.15). Laboratory findings include a total protein level of 6.7 g/dL, albumin level of 3.8 g/dL, IgG level of 1400 mg/dL (normal range 960-1960), IgA level of 450 mg/dL (normal range 110-420), and IgM level of 100 mg/dL (normal range 65-350). Creatine kinase level is 50 U/L (normal range 30-140), serum urea nitrogen level is 18 mg/dL, and serum creatinine level is 0.8 mg/dL. Immunological serology findings include negative antinuclear antibody, CH50 level of 30 mg/dL (normal range 30-40), C3 level of 88 mg/dL (normal range 52-112), C4 level of 20 mg/dL (normal range 16-51), and anti-streptolysin O titer of 200 units (normal range <250). The MPO-ANCA and PR3-ANCA are both negative. What is the most likely condition?", "choices_en": ["IgA nephropathy", "Membranous nephropathy", "ANCA-associated nephritis", "Minimal change nephrotic syndrome", "Acute post-streptococcal glomerulonephritis"], "answer": ["a"]}
{"problem_id": "113A58", "problem_text_en": "A 72-year-old man presents with the chief complaint of hallucinations. He has been pointed out by his wife over the past year for shouting, kicking his blanket, and fluttering his feet during sleep. Around this time, he occasionally noticed dizziness. Six months ago, his movements gradually slowed when eating or changing clothes. One month ago, he began to complain to his family that \"an unfamiliar person is dancing in the room\" at nighttime, so he was accompanied to the hospital. He smokes 10 cigarettes/day and drinks 350 mL of beer/day. His consciousness is clear. He is 163 cm tall and weighs 56 kg. His body temperature is 36.4 ℃. His pulse is 68 beats/min and regular, his blood pressure is 158/86 mmHg, and his respiratory rate is 16 breaths/min. No abnormalities are noted in heart sounds and respiratory sounds. His abdomen is flat and soft with no palpable liver or spleen. The Revised Hasegawa Dementia Scale score is 23 out of 30, and the Mini-Mental State Examination (MMSE) score is 25 out of 30. No abnormalities are noted in the cranial nerves. Mild muscle rigidity is recognized homogeneously on both sides of the extremities. His tendon reflexes are normal, and there are no motor paralysis, sensory disorders, or cerebellar ataxia. His posture is stooped, and his gait is shuffling. No abnormalities are noted in urinalysis. His laboratory results are as follows: red blood cells 3.42 million, Hb 10.7 g/dL, Ht 32%, white blood cells 8,300, and platelets 140,000. Blood biochemical test results: total protein 7.4 g/dL, albumin 3.8 g/dL, total bilirubin 0.9 mg/dL, AST 42 U/L, ALT 48 U/L, LD 354 U/L (reference range 176-353), γ-GTP 56 U/L (reference range 8-50), ammonia 32 μg/dL (reference range 18-48), blood urea nitrogen 17 mg/dL, creatinine 0.9 mg/dL, blood glucose 112 mg/dL, Na 140 mEq/L, K 4.4 mEq/L, and Cl 104 mEq/L. CRP is 0.3 mg/dL. Which of the following is the most useful for diagnosis?", "choices_en": ["Serum creatine kinase (CK)", "Head MRI", "Cerebrospinal fluid (CSF) examination", "Brain blood flow SPECT (Single Photon Emission Computed Tomography)", "Abdominal ultrasound examination"], "answer": ["d"]}
{"problem_id": "113A59", "problem_text_en": "A 62-year-old man came to the hospital for poor blood sugar control and deterioration of renal function. He has been receiving oral sulfonylurea therapy for type 2 diabetes at a clinic near his home for 20 years. He was referred for consultation five years ago as his blood sugar control gradually worsened and his serum creatinine level also increased. He is 165 cm tall and weighs 76 kg, with a pulse rate of 84 beats/min and regular rhythm, and blood pressure of 168/62 mmHg. Proliferative diabetic retinopathy is noted in both eyes, and mild edema is seen in both lower legs. Achilles tendon reflexes are absent bilaterally. Urinary examination shows 2+ protein, 2+ glucose, and (-) ketones. Blood tests reveal 3.95 million red blood cells, Hb 11.2 g/dL, Ht 32%, 5,500 white blood cells, and 220,000 platelets. Biochemical blood tests reveal 40 mg/dL of blood urea nitrogen, 3.2 mg/dL of serum creatinine, a fasting blood glucose of 226 mg/dL, and an HbA1c of 10.8% (reference range 4.6-6.2). What is the most appropriate management for his diabetes?", "choices_en": ["To intensify dietary therapy.", "Add biguanide.", "Introduce insulin preparations.", "Increase the dosage of sulfonylurea drugs.", "Add alpha-glucosidase inhibitor"], "answer": ["c"]}
{"problem_id": "113A60", "problem_text_en": "A one-year-old boy was brought to the hospital by his parents due to fever and swelling in the neck. He has had fever in the 39°C range for the past 5 days and the swelling in the neck was noticed this morning. His body temperature is 39.2°C, heart rate is 144/min and regular, and respiratory rate is 40/min. There is conjunctival hyperemia. Multiple lymph nodes are palpable in both sides of the neck. There are erythematous rashes on the anterior chest, palms, and soles. Heart and lung sounds are normal. The liver is palpable 2cm below the right costal margin and the spleen is palpable 1cm below the left costal margin. Blood test results show red blood cells at 3.94 million, hemoglobin at 10.5 g/dL, hematocrit at 33%, white blood cells at 17,400 (8% segmented neutrophils, 71% band neutrophils, 2% eosinophils, 0% basophils, 4% monocytes, 15% lymphocytes), and platelets at 430,000. Serum biochemistry showed total protein at 6.2 g/dL, AST at 35 U/L, ALT at 23 U/L, and LDH at 450 U/L (normal range, 202-437 U/L). CRP is 6.7 mg/dL. A photo of the lips is shown separately. Which of the following is a possible diagnosis?", "choices_en": ["Kawasaki disease", "Malignant lymphoma", "Infectious mononucleosis", "Tuberculous lymphadenitis", "Langerhans cell histiocytosis"], "answer": ["a"]}
{"problem_id": "113A61", "problem_text_en": "A 70-year-old woman complains of chest heaviness and shortness of breath. She has experienced these symptoms for a week, noting them during morning walks with her dog, but they typically disappeared after 2-3 minutes of rest. However, today, the symptoms persisted after onset at 9 AM so she and her family sought medical attention at 10 AM. She was diagnosed with hypertension and dyslipidemia at age 65 but has not received regular medical care. There is no significant family medical history or smoking history. Her height is 156 cm, weight 60 kg, temperature 36.2°C, pulse 84 beats/min, regular, blood pressure 116/78 mmHg, respiratory rate 16 breaths/min, and SpO2 99% on room air. No abnormalities were observed in the conjunctiva or eyeballs. No distension was observed in the jugular vein. No abnormalities were noted in cardiac or respiratory sounds. The abdomen was flat, soft, and non-tender. Chest X-ray examination revealed no abnormality. ST depression was noted in leads V2, V3, and V4 on a 12-lead electrocardiogram. Echocardiography revealed wall motion abnormalities in the anterior wall of the left ventricle but no pericardial effusion was observed. What is the most likely cause of her symptoms?", "choices_en": ["Acute pericarditis", "Acute coronary syndrome", "Takotsubo cardiomyopathy", "Viral myocarditis", "Acute pulmonary embolism"], "answer": ["b"]}
{"problem_id": "113A62", "problem_text_en": "A 25-year-old woman presents with chief complaints of pruritus and increased vaginal discharge. She has experienced intense itching and increased discharge for three days. Her last menstrual period was six days long, 15 days ago. Her menstrual cycle is 29 days, regular. There are no oral lesions. No swollen inguinal lymph nodes. Her abdomen is flat, soft and the liver and spleen are not palpable. The external genitalia are reddened and the discharge is curd-like and abundant. A microscopy picture (unstained) of the discharge is shown separately. What is the appropriate treatment?", "choices_en": ["Antibiotics", "Antifungal drugs", "Antiviral drugs for herpes", "Antitrichomonal drug", "Adrenal cortex steroids"], "answer": ["b"]}
{"problem_id": "113A63", "problem_text_en": "A 40-year-old primiparous woman (gravida 1, para 0) was referred from a maternity clinic near her home for a positive urine glucose test. She is currently at 30 weeks of gestation with no significant family or medical history. Her height is 160 cm, weight is 62 kg (pre-pregnancy weight was 55 kg), and temperature is 36.7°C. Her pulse is 88 beats/min and regular, and her blood pressure is 110/80 mmHg. Oral glucose tolerance test with 75 g glucose load showed: fasting glucose level 90 mg/dL, glucose level at 1 hour 190 mg/dL, glucose level at 2 hours 160 mg/dL. HbA1c is 5.4% (reference range: 4.6-6.2%). What is the most appropriate response?", "choices_en": ["No action is necessary.", "It is recommended to divide meals into 4-6 smaller portions.", "The target is a blood glucose level of 150 mg/dL 2 hours after a meal.", "Restrict daily intake energy to 1,200kcal.", "If dietary therapy is ineffective, oral hypoglycemic agents are used."], "answer": ["b"]}
{"problem_id": "113A64", "problem_text_en": "A 38-year-old woman presents with chief complaints of limb weakness. She noticed a numbness in both lower legs about 5 months ago without any particular cause, but as the symptoms were variable and occasionally reduced, she decided to wait and see. Two months ago, she began to experience similar symptoms in both upper limbs. Two weeks ago, she gradually became much weaker in both upper and lower limbs, and had difficulty opening bottle caps or tripped over her toes, so she sought medical attention. She is conscious and alert. Her temperature is 36.0°C, heart rate is 64/min and regular, and blood pressure is 114/60 mmHg. There are no abnormalities identified in heart and breath sounds. The abdomen is flat and soft, and the liver and spleen are not palpable. There are no pitting edema, rashes, or hirsutism observed in her extremities. There are no abnormalities found in her neurological examination. Her stretch reflexes are absent in all extremities, and the Babinski sign is negative. Manual muscle test scores are 4 for bilateral proximal upper extremities. Grip strength is 8 kg on the right and 10 kg on the left. Bilateral proximal lower extremity muscle scores are 4, while anterior tibialis and triceps surae score 3, and she can barely stand on tiptoes. She recognized abnormal sensations, but tactile and thermal sensations were normal. Vibratory sensation was decreased in both upper and lower extremities. There are no abnormalities found in her urine and blood tests, as well as electrocardiography and chest X-ray examinations. Lumbar puncture tests yielded a first pressure of 80 mmH2O (normal range 70-170), a white blood cell count of 1/μL (normal range 0-2), protein levels (quantitative) at 126 mg/dL (normal range 15-45), and glucose (quantitative) at 56 mg/dL (normal range 50-75). The results of her motor nerve conduction tests are shown separately. What are the two appropriate treatments?", "choices_en": ["Intravenous acyclovir", "Thalidomide ingestion", "Oral intake of ascorbic acid (also known as Vitamin C)", "Oral administration of adrenal cortical steroid", "High-dose immunoglobulin therapy"], "answer": ["d", "e"]}
{"problem_id": "113A65", "problem_text_en": "An 82-year-old man visited with the chief complaints of cough and low grade fever. He had developed a cough and low grade fever 4 months ago and had visited a clinic near his home 3 months ago. He was prescribed quinolone antibiotics for a week and his fever resolved. Two weeks ago, his symptoms relapsed, so he visited the clinic again and improved with the same quinolone antibiotics. Three days ago, he developed cough, low grade fever, and sputum, but the clinic near his home was closed, so he came to see you. Tuberculosis bacteria were detected in his sputum. Which of the following is an appropriate response? Select two.\n\n(Note: This translation assumes that the second sentence in the original text is just setting up background information and is not a question to be translated. If it is meant to be a question, the translation would be slightly different.)", "choices_en": ["Immediately report to the public health center.", "To make the patient wear an N95 mask.", "Switch to a broad-spectrum cephalosporin antibiotic.", "Resume intravenous administration of quinolone antimicrobial agent.", "Ask about people who have been in contact within the past 4 months."], "answer": ["a", "e"]}
{"problem_id": "113A66", "problem_text_en": "A 23-year-old woman was referred for further examination by an occupational physician due to abnormal shadows on her chest X-ray during a health checkup at the time of employment. She has no symptoms and no history of smoking. Chest X-ray images (A and B) are shown separately. What is the next test to be performed? Select two.", "choices_en": ["Lung perfusion scintigraphy", "Transesophageal echocardiography", "Chest contrast-enhanced CT", "Chest MRI", "Thoracic spine MRI"], "answer": ["c", "d"]}
{"problem_id": "113A67", "problem_text_en": "A 64-year-old woman was brought in by ambulance due to difficulty walking. She had been aware of gait disturbance for the past week and became unable to walk after waking up today, prompting a call for an ambulance. She underwent right mastectomy for breast cancer at the age of 60, and there are no noteworthy diseases or family history. On arrival, she was conscious and alert with a body temperature of 36.3℃. Her heart rate was 72 beats/min and regular, blood pressure was 114/62 mmHg, respiratory rate was 16 breaths/min, and SpO2 was 97% on room air. Manual muscle testing revealed a muscle strength of 0-1 in both lower extremities, and there was sensory disturbance in the torso below the axilla and in both lower extremities. Tenderness was observed on percussion of the spinous processes of the upper thoracic vertebrae. Laboratory findings were as follows: red blood cells, 4.13 million cells/µL; hemoglobin, 12.0 g/dL; white blood cells, 7,200/µL; and platelets, 270,000/µL. Blood biochemistry results showed: total protein, 7.3 g/dL; albumin, 4.2 g/dL; blood urea nitrogen, 13 mg/dL; creatinine, 0.8 mg/dL; AST, 40 U/L; ALT, 24 U/L; LD, 768 U/L; ALP, 997 U/L; sodium, 144 mEq/L; potassium, 4.8 mEq/L; chlorine, 105 mEq/L; and CRP, 1.4 mg/dL. Chest X-ray (A), T2-weighted sagittal image (B), and transverse image at the third thoracic vertebra level (C) on cervical-thoracic MRI are shown separately. Which two of the following should be considered first?", "choices_en": ["Decompression fixation surgery", "Radiation exposure", "Chemotherapy for cancer", "Remaining capacity training", "Trunk (body) cast fixation"], "answer": ["a", "b"]}
{"problem_id": "113A68", "problem_text_en": "A 3-month-old infant with high-grade fever since the previous night has been brought to the hospital by parents. The infant appears irritable and is taking less feed than usual. The infant has a height of 55 cm, weight of 5,700 g, and a body temperature of 38.7℃. The heart rate is 142/min and regular, the respiratory rate is 44/min, and SpO2 is 97% on room air. The skin color is good. The abdomen is soft and non-distended with a liver edge palpable 1 cm below the right costal margin. Urine analysis shows 2+ ketones, 1-4 RBCs/HPF, >100 WBCs/HPF, and negative protein and glucose tests. CBC shows WBC count of 21,300/μL with 24% neutrophils, 44% band cells, 2% eosinophils, 1% basophils, 6% monocytes, and 23% lymphocytes, hemoglobin of 10.0 g/dL, hematocrit of 31%, and platelet count of 120,000/μL. The PT-INR is 1.1, and CRP is 5.1 mg/dL. Which of the following investigations should be done to assess and manage the infant? Select two.", "choices_en": ["Brain waves", "Urine culture test", "Urinalysis", "Blood culture test", "Voiding cystourethrography (VCUG)"], "answer": ["b", "d"]}
{"problem_id": "113A69", "problem_text_en": "A 40-year-old woman was referred to the hospital after being pointed out the abnormal findings in a head MRI. She had been experiencing occasional dull pain in the frontal area for about a month. She became worried after a colleague was hospitalized for subarachnoid hemorrhage a week ago and visited a nearby medical facility, where she was referred for further examination after being shown abnormalities in the head MRI. She is 162 cm tall, weighs 45 kg, and has a body temperature of 36.2°C. Her pulse is 76 beats per minute and regular, and her blood pressure is 124/78 mmHg. There are no apparent abnormalities on physical examination. Which of the following examinations are expected to show abnormalities? Select two. \n\n(Note: The question mentions an additional head contrast MRI, but the image cannot be provided here.)", "choices_en": ["Visual field examination", "Electroencephalogram (EEG) examination", "Hearing test", "Cerebrospinal fluid examination", "Balance function test"], "answer": ["c", "e"]}
{"problem_id": "113A70", "problem_text_en": "A 13-year-old female presents with the chief complaint of easy fatigability. She is a member of a track and field team and has been aware of her easy fatigability for a year, noting a decline in her short-distance running performance. She came for examination recently because of increased fatigue. She has a good appetite. She experienced palpitation and chest discomfort while climbing the stairs in the hospital. Her heart rate is 120 beats per minute and blood pressure is 136/72 mmHg. Examination of the neck reveals swelling of the thyroid gland. A III/IV systolic murmur is heard at the left sternal border at the second intercostal space during cardiac auscultation but no respiratory sound abnormalities are noted. She has hand tremors. Laboratory findings include: RBC 4.52 million, Hb 12.3 g/dL, Hct 36%, WBC 8,900, and platelets 230,000. Biochemical laboratory findings include: total protein 6.1 g/dL, albumin 3.6 g/dL, AST 33 U/L, ALT 31 U/L, blood urea nitrogen 13 mg/dL, creatinine 0.6 mg/dL, TSH less than 0.1 μU/dL (reference range 0.5-5.0), FT3 greater than 30 pg/mL (reference range 2.2-4.3), FT4 greater than 10 ng/dL (reference range 0.9-1.7) and positive TSH receptor antibody. What are the most appropriate measures to be taken at present? Select two.", "choices_en": ["Dietary restrictions", "Thyroidectomy", "Suspend club activities", "Administration of anti-thyroid medication", "Administration of radioactive iodine"], "answer": ["c", "d"]}
{"problem_id": "113A71", "problem_text_en": "A 35-year-old woman with a history of 3 pregnancies and 2 deliveries presented at 33 weeks of gestation for perinatal management, referred from a nearby obstetrics clinic. She had undergone elective cesarean sections for breech presentation and a history of prior cesarean section at 30 and 32 years old, respectively. She had a height of 156 cm and a weight of 56 kg (pre-pregnancy weight 48 kg), and her vital signs were stable with a body temperature of 36.8°C, a pulse rate of 84 beats per minute, and a blood pressure of 108/76 mmHg. At present, she had no symptoms and no abnormalities were detected in the fetal heart rate contraction pattern. An axial T2-weighted MRI image of the pelvis is shown separately. Which of the following is the most likely diagnosis? Select two.", "choices_en": ["Pre ductal coarctation of aorta", "Placenta previa", "Placenta accreta", "Postpartum hematoma", "Abruptio placentae"], "answer": ["b", "c"]}
{"problem_id": "113A72", "problem_text_en": "A 67-year-old man visited the clinic with chief complaints of persistent epigastric and back pain that had been ongoing for two months. He had lost 10 kg of body weight in three months. He has clear consciousness. His abdomen is flat with a firm 5 cm mass palpable in the epigastrium. Laboratory findings: RBC count 3.95 million, Hb 12.9 g/dL, Ht 38%, WBC count 8,100. Biochemistry: total protein 6.7 g/dL, total bilirubin 0.7 mg/dL, AST 44 U/L, ALT 41 U/L, ALP 522 U/L (reference range 115-359), γ-GTP 164 U/L (reference range 8-50), amylase 51 U/L (reference range 37-160), blood urea nitrogen 13 mg/dL, creatinine 0.8 mg/dL. CEA 758 ng/mL (reference range under 5), CA19-9 950 U/mL (reference range under 37). Abdominal contrast-enhanced CT is separately shown. Which of the following treatment options is appropriate? Select two.", "choices_en": ["Arterial embolization", "Radiation exposure", "Chemotherapy for cancer", "Distal pancreatectomy", "Pancreatoduodenectomy"], "answer": ["b", "c"]}
{"problem_id": "113A73", "problem_text_en": "A 44-year-old woman presents with erythema, general fatigue, and loss of appetite. She had visited a dermatologist a month ago for pruritic erythema on her limbs, which was treated with antihistamines and topical corticosteroids, but the erythema did not improve and spread to her trunk. She also experienced general fatigue and loss of appetite, which prompted her to seek medical attention. Her father died of a blood disorder. Her vital signs include a temperature of 38.5°C and a pulse of 96 beats per minute. Erythema is observed throughout her body, and 6 lymph nodes measuring 1-2 cm in diameter are palpable in both necks, axillae, and inguinal regions. Laboratory tests reveal a red blood cell count of 4.66 million/µL, hemoglobin level of 14.4 g/dL, hematocrit level of 44%, white blood cell count of 12,900/µL with 25% abnormal lymphocytes, and a platelet count of 230,000/µL. Biochemical tests reveal a total protein level of 6.0 g/dL, an albumin level of 3.0 g/dL, a total bilirubin level of 0.3 mg/dL, an AST level of 28 U/L, an ALT level of 15 U/L, an LD level of 1600 U/L (normal range 176-353), a blood urea nitrogen level of 24 mg/dL, a creatinine level of 1.3 mg/dL, a fasting blood glucose level of 90 mg/dL, a sodium level of 140 mEq/L, a potassium level of 4.1 mEq/L, a chloride level of 102 mEq/L, and a calcium level of 12.3 mg/dL. Images of the rash on her back (A) and a peripheral blood smear stained with May-Giemsa stain (B) are shown separately. Which of the following treatments should be done? Select three.", "choices_en": ["Chemotherapy", "Intravenous infusion of physiological saline solution", "Antiviral drug administration", "Bisphosphonate administration", "Administration of active vitamin D$_3$ formulation"], "answer": ["a", "b", "d"]}
{"problem_id": "113A74", "problem_text_en": "A 6-year-old girl consulted with the chief complaints of abdominal pain and bloody stools. She complained of abdominal pain since yesterday and was brought to the hospital by her mother today as bloody stools were observed. Two days ago, she ate grilled meat at a nearby shop. She is conscious. Her weight is 20 kg. Her body temperature is 37.5 ℃. Her pulse rate is 90 beats/min, regular. Blood pressure is 110/60 mmHg. Her respiratory rate is 20 breaths/min. There is no abnormality in the conjunctiva and cornea. No abnormality is found in heart sounds and breath sounds. Her abdomen is flat, and she feels slight tenderness around the umbilicus. No liver or spleen enlargement is palpable, and bowel sounds are hyperactive. Urine test results: protein (-), glucose (-), ketone 2+, occult blood (-). Blood test results: red blood cell count 4.20 × 106/μL, hemoglobin 13.2 g/dL, hematocrit 42%, white blood cell count 12,300/μL (neutrophils 85%, eosinophils 1%, basophils 1%, lymphocytes 7%, and monocytes 6%), platelet count 210,000/μL, PT-INR 1.2 (reference range: 0.9-1.1), APTT 32 sec (reference range: 32.2 sec), total protein 7.5 g/dL, albumin 3.9 g/dL, total bilirubin 0.9 mg/dL, AST 28 U/L, ALT 16 U/L, LD 300 U/L (reference range: 175-320), CK 60 U/L (reference range: 46-230), blood urea nitrogen 20 mg/dL, creatinine 0.6 mg/dL, glucose 98 mg/dL, Na 131 mEq/L, K 4.4 mEq/L, and Cl 97 mEq/L. CRP is 4.5 mg/dL. Clostridium difficile toxin was detected in the stool. Which three blood test items are useful to be aware of for the development of hemolytic uremic syndrome (HUS) in this patient?\n\n", "choices_en": ["Creatine kinase (CK)", "CRP stands for C-reactive protein.", "Red blood cell count", "Platelet count", "Creatinine"], "answer": ["c", "d", "e"]}
{"problem_id": "113A75", "problem_text_en": "After a 12-hour fast, blood was taken in the early morning on an individual, and the test results showed total cholesterol at 250 mg/dL, triglycerides at 120 mg/dL, and HDL cholesterol at 80 mg/dL. Calculate the estimated LDL cholesterol value using the Friedewald formula. If a decimal value is obtained, round it to one decimal place. Answer: ①②③ mg/dL.", "choices_en": [], "answer": ["146"]}
