{"problem_id": "116B1", "problem_text_en": "Which of the following is appropriate for reporting a patient's case in a research paper?", "choices_en": ["Record the patient's nationality.", "Accurately record the duration of time passed.", "Publish a photo that shows the entire face.", "Obtain patient consent for disclosure.", "Convert patient name to initials."], "answer": ["d"]}
{"problem_id": "116B2", "problem_text_en": "Which of the following combinations of findings and causes in patients with complaints of abnormal breathing or shortness of breath is correct?", "choices_en": ["Coarse crackles --------- Wheezing", "Dullness on percussion of the chest suggestive of pneumothorax", "Dilated jugular veins --------- right-side heart failure", "SpO2 95% (room air)----- respiratory failure", "Cheyne-Stokes respiration --------- Upper airway obstruction"], "answer": ["c"]}
{"problem_id": "116B3", "problem_text_en": "Which of the following statements made by the patient is least likely to be a hallucination?", "choices_en": ["\"A man speaks out 'study more' even though there is nobody in the room.\"", "\"I think it's strange myself, but I hear the sound of a train even though there are no railroad tracks nearby.\"", "\"My family says they can't hear it, but I can hear the sound of a car engine starting at night.\"", "\"You can hear a woman's voice saying 'stupid, stupid' overlapping with the sound of an actual machine making a 'clack clack' noise.\"", "\"You can tell from the gestures of a friend standing on the opposite platform of a train station that they are talking behind your back.\""], "answer": ["e"]}
{"problem_id": "116B4", "problem_text_en": "Which of the following is incorrect regarding the appropriate use of antibiotics?", "choices_en": ["To be started after submitting a cultivation test.", "Adjust the dosage according to the pharmacokinetics.", "Determine the duration of administration based on the CRP value at the start.", "Consider the organ distribution of antibiotics when selecting.", "Change to appropriate antimicrobial agent based on the results of susceptibility testing."], "answer": ["c"]}
{"problem_id": "116B5", "problem_text_en": "What physical examination is difficult to perform on patients with impaired consciousness?", "choices_en": ["Tendon reflex", "Nuchal rigidity", "Pupillary light reflex", "Finger-to-nose test", "Knee extension test (lower limb drop test)"], "answer": ["d"]}
{"problem_id": "116B6", "problem_text_en": "What is the institution that provides advice and information when seeking consultation about the post-treatment progress, other than the attending physician?", "choices_en": ["Public health center", "Welfare office", "Municipal health center", "Center for Medical Safety Support", "Regional comprehensive support center"], "answer": ["d"]}
{"problem_id": "116B7", "problem_text_en": "Which of the following shows higher levels in early pregnancy compared to late pregnancy?", "choices_en": ["Estrogen", "Prolactin", "Progesterone", "Human Placental Lactogen (hPL)", "Human chorionic gonadotropin (hCG)"], "answer": ["e"]}
{"problem_id": "116B8", "problem_text_en": "Which of the following is true regarding changes that occur with aging?", "choices_en": ["Increase in renal blood flow", "Decreased urine concentrating ability", "Elevation of glomerular filtration rate", "Decrease in glomerular sclerosis", "Increase in functional nephron number"], "answer": ["b"]}
{"problem_id": "116B9", "problem_text_en": "Which of the following is appropriate for establishing good communication with a patient in a medical interview?", "choices_en": ["Explain the medical condition using medical terminology.", "I will not repeat what the other person said.", "Using closed-ended questions from the beginning.", "To listen to the patient while looking at the electronic medical record screen.", "Ask about the impact of the symptoms on the patient's daily life."], "answer": ["e"]}
{"problem_id": "116B10", "problem_text_en": "Which of the following statements is true regarding social security systems?", "choices_en": ["The obligation to preserve medical records lasts for 2 years from the last examination.", "The number of insured persons in the National Health Insurance Association is more than 60 million people.", "National medical expenses have tripled over a 20-year period since 2000.", "The number of insured persons under Long-term Care Insurance System Type 1 is greater than the number of insured persons under Type 2.", "Public expenses for the medical care of tuberculosis patients are provided for by the Infectious Disease Control Law."], "answer": ["e"]}
{"problem_id": "116B11", "problem_text_en": "What are the urgent accompanying symptoms that should be confirmed in a patient complaining of sore throat?", "choices_en": ["Sputum", "Purulent nasal discharge", "Excessive salivation (sialorrhea)", "Pain in submandibular lymph nodes", "High fever of 38℃ or more"], "answer": ["c"]}
{"problem_id": "116B12", "problem_text_en": "Which of the following conditions is characterized by muscle weakness that becomes apparent after infancy?", "choices_en": ["Werdnig-Hoffmann disease", "Transient neonatal myasthenia gravis", "Duchenne muscular dystrophy", "Fukuyama type congenital muscular dystrophy.", "Congenital myotonic dystrophy"], "answer": ["c"]}
{"problem_id": "116B13", "problem_text_en": "Which of the following is appropriate for respecting the individuality and dignity of elderly persons in caregiving?", "choices_en": ["Call elderly people by adding the honorific \"chan\" to their name in an affectionate way.", "Secure the trunk to the bed with a band to prevent falling and ensure safety.", "Shouting at elderly individuals who have difficulty with self-excretion to direct them to the location of the toilet.", "Provide care tailored to the habits and lifestyle pace of each elderly person.", "Recommendation for admission to a nursing home for elderly individuals who have difficulty moving independently."], "answer": ["d"]}
{"problem_id": "116B14", "problem_text_en": "Which of the following combinations of diseases/conditions and risk behaviors is incorrect?", "choices_en": ["Breast cancer - Drinking habits", "Obesity ----------- fast eating speed", "Esophageal cancer ------- Hot food and drink preferences", "Frailty - Strong masticatory force in elderly people", "Osteoporosis - Excessive dietary restriction in young women"], "answer": ["d"]}
{"problem_id": "116B15", "problem_text_en": "Which of the following is abnormal at rest in an adult?", "choices_en": ["Axillary temperature of 36.2℃", "Heart rate 96/min, regular", "Blood pressure 112/70 mmHg", "Respiratory rate of 24 per minute", "SpO2 97% (breathing normal air in the room)"], "answer": ["d"]}
{"problem_id": "116B16", "problem_text_en": "Which of the following is appropriate for the insertion of a nasogastric tube in a supine position for enteral nutrition?", "choices_en": ["Apply lidocaine to the nasal cavity before insertion.", "Flex patient's neck during insertion.", "Insertion should be up to a depth of 35cm in the nostril of a typical adult.", "After insertion, inject physiological saline and confirm the sound of inflow.", "Confirm the tube tip position with an X-ray image."], "answer": ["e"]}
{"problem_id": "116B17", "problem_text_en": "When performing pediatric CPR with two rescuers, which is the correct ratio of ventilation to chest compressions?", "choices_en": ["1:3", "1:15 (This is a numerical ratio, so it does not need to be translated.)", "2:15 (time)", "2:30 (This choice is already in English. It is a time in a 24-hour clock format.)", "3:30. (There is no difference between English and Japanese in the representation of time.)"], "answer": ["c"]}
{"problem_id": "116B18", "problem_text_en": "A 57-year-old man has been smoking 20 cigarettes per day since he was 21 years old. He quit smoking between the ages of 45 and 49, but resumed smoking 20 cigarettes per day. What is his smoking index?", "choices_en": ["480 (there is no additional context or information to provide a more specific translation)", "It is not possible to translate \"540\" accurately without further context. It could refer to a measurement, a code or a number in a specific sequence, among other possibilities.", "Sorry, without further context it is impossible to provide an accurate translation. \"640\" does not have a clear meaning in Japanese medical terminology.", "720 (This appears to be a numerical value and does not require translation. It could refer to a score, a dosage, a degree measurement or any other value relevant to the context of the question.)", "One thousand and eighty"], "answer": ["c"]}
{"problem_id": "116B19", "problem_text_en": "Which of the following is an unlikely finding suggesting malignancy in breast disease?", "choices_en": ["Dimpling sign", "Peau d'orange (orange peel-like skin)", "Nipple fissure", "Bloody nipple discharge", "Areola pigmentation"], "answer": ["e"]}
{"problem_id": "116B20", "problem_text_en": "During manual muscle testing for ankle dorsiflexion, no movement of the ankle joint was observed, and only contraction of the anterior tibialis muscle was felt. What is the evaluation of this test result?", "choices_en": ["0 (It appears to be a possible answer or an option in a question, but it does not require translation.)", "1", "Sorry, the choice \"2\" doesn't provide enough context for me to accurately translate it. Please provide more information or the full question.", "3 (there is no context or information provided on what this pertains to)", "4 (There is no context provided to determine the meaning or translation of this numerical choice.)"], "answer": ["b"]}
{"problem_id": "116B21", "problem_text_en": "When evaluating the results of cerebrospinal fluid tests, which of the following should be compared with blood test results?", "choices_en": ["Albumin.", "Glucose", "Neutrophil count", "Protein", "White blood cell count"], "answer": ["b"]}
{"problem_id": "116B22", "problem_text_en": "Which of the following is the most recent development in the medical history of insulin?", "choices_en": ["Discovery of the Islets of Langerhans in the Pancreas", "Purification of insulin extracted from animal pancreas", "Production of human insulin preparation by genetic engineering", "Elucidation of amino acid sequence and three-dimensional structure of insulin", "Discovery of polyuria with glucosuria in dogs after removal of the pancreas"], "answer": ["c"]}
{"problem_id": "116B23", "problem_text_en": "You are conducting a medical interview with a patient who presents with shortness of breath and lower extremity edema, and heart failure is suspected. Which of the following is an open-ended question?\n\n(Note: There is no specific text provided for me to translate as \"open-ended question\" is an English phrase commonly used in medical interviews in Japan as well.)", "choices_en": ["\"Please tell me your age.\"", "\"Is there any difference in swelling between the left and right foot?\"", "\"When did you first notice swelling in your legs?\"", "\"Do you wake up feeling short of breath after going to bed?\"", "\"Can you please tell me more about what you're having trouble with right now?\""], "answer": ["e"]}
{"problem_id": "116B24", "problem_text_en": "Which of the following statements about the hospital discharge summary is incorrect?", "choices_en": ["In the hospital for examination, descriptions can be omitted.", "It is a summary of the patient's information during hospitalization.", "Prompt documentation is required for post-discharge medical care.", "Recording within 14 days after discharge is eligible for additional billing points.", "What is created by medical office assistants and approved by physicians is valid."], "answer": ["a"]}
{"problem_id": "116B25", "problem_text_en": "A 48-year-old woman presents with the main complaint of motor disability in her right upper limb. She drank alcohol last night and fell asleep leaning on the right armrest of a dining chair. When she woke up, she could not dorsiflex her right wrist and sought medical attention. Her past medical history is unremarkable. She is conscious and alert. Her height is 165 cm, weight is 53 kg, and body temperature is 36.3°C. There are no external injuries on her body. The radial artery is palpable on both sides. There is no neck pain. There is a decreased sensation on the back of the right hand. She is unable to dorsiflex her right wrist and extend the MP joint of her right hand. Other muscle strengths in the upper and lower limbs are normal. What is the suspected cause of her disability?", "choices_en": ["Brachial plexus", "Musculocutaneous nerve", "Ulnar nerve", "Median nerve", "Radial nerve"], "answer": ["e"]}
{"problem_id": "116B26", "problem_text_en": "A 54-year-old woman is hospitalized after undergoing a hysterectomy for uterine fibroids three days ago. Today, while washing her face in the restroom, she suddenly developed dyspnea, which has continued since then. She has no cough and no chest pain, and has never smoked. She is conscious and alert with a body temperature of 36.4°C, a pulse rate of 112/minute, regular, and a blood pressure of 102/62 mmHg. Her respiratory rate is 24/minute, and her SpO2 is 89% on room air. There are no abnormalities in the breath sounds. Which of the following is the most likely cause of her symptoms?", "choices_en": ["Foreign body in the airway", "Bronchial asthma", "Acute left heart failure", "Pulmonary thromboembolism", "Idiopathic pulmonary fibrosis"], "answer": ["d"]}
{"problem_id": "116B27", "problem_text_en": "An 83-year-old woman presented with a chief complaint of right lower back pain and fever with chills for the past 4 days. She was alert and oriented on arrival with no signs of cognitive impairment. Her temperature was 38.6°C, pulse rate was 102 beats per minute, regular, blood pressure was 138/88 mmHg, respiratory rate was 24 breaths per minute, and oxygen saturation was 97% on room air. No abnormal findings were observed in the head and neck. A Levine 3/6 systolic murmur heard loudest at the apex was detected on cardiac auscultation. No abnormal breath sounds were detected, and the abdomen was flat, soft, and non-tender without palpable liver or spleen. No rash was detected in the extremities or periphery. Gram-positive cocci clustered in a cluster from 2 sets (4 bottles) of blood cultures taken on admission were identified. What test should be done next?", "choices_en": ["Chest plain CT scan", "Carotid artery ultrasound", "Transthoracic echocardiography", "Upper gastrointestinal endoscopy", "Abdominal plain X-ray"], "answer": ["c"]}
{"problem_id": "116B28", "problem_text_en": "An 84-year-old man presented with weight loss as the chief complaint. He lives with his wife and eldest son. Examination revealed a malignant tumor originating in the colon with distant metastases. Neither the primary nor the metastatic tumors are resectable by surgery. Although the patient wishes to be informed of his diagnosis, he does not want anti-cancer treatment with medication. His son also does not want to be informed of the diagnosis or have aggressive treatment pursued. However, the attending physician wishes to provide anti-cancer treatment with medication. The patient's cognitive function is evaluated as 22 out of 30 points by the Revised Hasegawa Dementia Scale. What is the most important factor in determining the treatment policy for this patient?", "choices_en": ["Patient's age", "Patient's intention/wish", "The intention of the first-born son", "Wishes of the attending physician", "Patient's cognitive function"], "answer": ["b"]}
{"problem_id": "116B29", "problem_text_en": "A 40-year-old woman, who presented one month ago with abdominal distention, was diagnosed with an ovarian tumor and admitted two weeks ago for surgery to remove the tumor. Her height is 104 cm and weight is 25 kg. She has osteogenesis imperfecta and regularly visits an orthopedic clinic once a year. She has difficulty walking and uses an electric wheelchair in daily life. She lives with her husband and a 5-year-old son and runs an online shop. Several volunteers take turns to support her daily life. Postoperative progress was good, and intraoperative pathological diagnosis was benign. No new functional disorders were observed during hospitalization. As the attending physician during hospitalization, what is necessary for discharge?", "choices_en": ["Instructions for resting and recovery after discharge from the hospital", "Arrangement of a helper holding a certificate for care and welfare work", "Providing information to the regular orthopedic surgeon in charge.", "Arrangement for lending assistive devices for activities of daily living support \n\n(Note: \"福祉器具\" refers to assistive devices or equipment for people with disabilities or elderly individuals who need support for daily living activities.)", "Arranging physical therapists to conduct home-based rehabilitation"], "answer": ["c"]}
{"problem_id": "116B30", "problem_text_en": "An 80-year-old woman was hospitalized for pneumonia three days ago. Her pneumonia is improving. She fell inside her hospital room while trying to go to the toilet during the night. She did not have any head injury and did not complain of any pain. She was told to notify the nurse by pressing the call bell when going to the restroom, but the call bell was not pressed. She was taking a benzodiazepine for insomnia after hospitalization. Her activities of daily living (ADL) before hospitalization were independent. Which of the following suggestions made at the conference held the next day is appropriate?", "choices_en": ["Addition of sleeping pills", "Nighttime physical restraints", "Use of bed exit sensors", "Reporting to the family at a later date", "Indwelling urinary catheterization"], "answer": ["c"]}
{"problem_id": "116B31", "problem_text_en": "A 54-year-old female patient came to the clinic complaining of discomfort in her chest when climbing stairs at the station for the past 6 months. Upon examination, the attending physician informed her that she needs coronary artery bypass surgery. The patient requested that her parents, siblings, and workplace not be informed about her condition. She has been working at the same company for 10 years and lives alone. There were no abnormalities detected in her company's health checkup. Which of the following is an appropriate explanation for the physician to give to the patient?", "choices_en": ["\"There is an obligation for the attending physician to report to the company.\"", "\"We will communicate your medical condition to the person you have authorized\"", "\"In that case, we have no choice but to go with drug therapy alone.\"", "\"You cannot refuse a request for medical explanation of a blood relative's condition.\"", "\"Consent from family members is required for any kind of treatment\""], "answer": ["b"]}
{"problem_id": "116B32", "problem_text_en": "A 78-year-old female patient visits with the chief complaint of decreased vision in her left eye. She accidentally spilled miso soup on her left side during breakfast this morning because she wasn't aware of it, and later collided with the door frame with her left shoulder. She has a medical history of hypertension and atrial fibrillation, which are being treated with medication. The patient is alert and conscious with a body temperature of 36.5℃, heart rate of 80 beats per minute and regularly irregular, blood pressure of 154/94 mmHg, respiratory rate of 16 breaths per minute, and an SpO2 of 96% (room air). On confrontation testing, the patient has a left visual field defect. No apparent limb paralysis is observed. Laboratory results show red blood cells of 4.52 million/μL, hemoglobin of 13.1 g/dL, hematocrit of 41%, white blood cells of 8,000/μL, platelets of 200,000/μL, PT-INR of 1.0 (reference range 0.9-1.1), urea nitrogen of 15 mg/dL, creatinine of 0.8 mg/dL, fasting blood sugar of 102 mg/dL, sodium of 139 mEq/L, potassium of 3.8 mEq/L, and chloride of 99 mEq/L. Where is the site of the damage?", "choices_en": ["Optic chiasm", "Right optic nerve", "Left optic nerve", "Right parietal lobe", "Left occipital lobe"], "answer": ["d"]}
{"problem_id": "116B33", "problem_text_en": "A 26-year-old primigravida presents for prenatal care at 24 weeks of gestation. She has no significant medical history. She is 160 cm tall and weighs 66 kg (pre-pregnancy weight 58 kg). Her temperature is 37.0℃. Her pulse is 72 beats per minute and regular, with blood pressure of 134/72 mmHg. Her fundal height is 21 cm with abdominal circumference of 85 cm. Mild edema is noted in her lower legs. Urinalysis shows negative for protein and positive for 2+ glucose. Fasting blood glucose level is 132mg/dL. What is the most appropriate initial action to take?", "choices_en": ["24-hour urine collection", "Start oral antidiabetic medication", "Measuring the diurnal variation of blood glucose levels", "Start intensive insulin therapy", "Performing 75g oral glucose tolerance test"], "answer": ["c"]}
{"problem_id": "116B34", "problem_text_en": "A 19-year-old man was transported by ambulance following a traffic accident. He was riding a motorcycle on a road along a riverbank when he collided with an oncoming car, causing him to fall and tumble down a cliff. He can respond to verbal questioning and knows his name. His heart rate is 122/minute, blood pressure is 72/50 mmHg, respiratory rate is 28/minute, and SpO2 is 96% on room air. There is tenderness on the right anterior chest, and breath sounds are decreased on the right side. The abdomen is distended. The right lower limb is externally rotated and there is a deformity and open wound on the right lower leg. Despite large-volume infusion, blood pressure did not improve significantly. Because ongoing bleeding and coagulation disorders are of concern, transfusion therapy was initiated using blood products available at the hospital without waiting for confirmation of blood type. Which combination of concentrated red blood cells and fresh frozen plasma can be given safely?\n\n(Note: This is a medical scenario and does not represent or encourage reckless driving.)", "choices_en": ["Concentrated red blood cell solution = O type Rh (+), Fresh frozen plasma = O type Rh (+)", "Concentrated red blood cells = Type O Rh (+), Fresh Frozen Plasma = Type AB Rh (+)", "Dense red blood cells = AB type Rh (+), Fresh frozen plasma = O type Rh (+)", "Concentrated red blood cells = AB type Rh (+), Fresh frozen plasma = AB type Rh (+)", "Concentrated red blood cell fluid = AB type Rh (+), Fresh frozen plasma = AB type Rh (-)"], "answer": ["b"]}
{"problem_id": "116B35", "problem_text_en": "An 88-year-old man was admitted due to severe respiratory failure and heart failure caused by chronic obstructive pulmonary disease and valvular heart disease that have developed over years of smoking. It is difficult to improve his condition itself, and he complains of severe pain such as difficulty breathing and general malaise. He wishes to receive palliative care. He lives with his wife, and his eldest son lives nearby. Which of the following is an inappropriate approach for providing palliative care to this patient?", "choices_en": ["Continuation of oxygen administration", "Adjustment of the hospital room environment", "Opioid administration", "Restriction of family visits", "Massage of the site that complains of pain"], "answer": ["d"]}
{"problem_id": "116B36", "problem_text_en": "A 35-year-old man was found unable to move by the side of a mountain trail. A doctor who was dispatched by a doctor car was waiting at the entrance to the trail. The local weather was rainy and the temperature was 10°C. When the doctor made contact with the man, his consciousness level was JCS II-30. His body temperature (measured rectally) was 31.4°C. His pulse was 58 beats per minute and regular, blood pressure was 102/62 mmHg, and respiratory rate was 30 breaths per minute. SpO2 could not be measured and was suspected to be due to peripheral circulatory failure. Which of the following is incorrect as pre-hospital treatment?", "choices_en": ["Covering the whole body with a blanket.", "Remove wet clothing.", "Administer adrenaline by intravenous injection.", "Administer warmed intravenous fluids.", "Cleanse and inspect the injury."], "answer": ["c"]}
{"problem_id": "116B37", "problem_text_en": "A 28-year-old primigravid woman presents at 23 weeks and 4 days of gestation with the chief complaint of genital bleeding. She had undergone routine antenatal checkups since early in the pregnancy and there were no notable abnormalities. She began to experience lower abdominal pain since last night and noticed genital bleeding this morning, which prompted her to seek medical attention. Her height is 154 cm, pre-pregnancy weight is 52 kg, and current weight is 56 kg. Her body temperature is 37.1°C, pulse rate is 88 beats/min and regular, blood pressure is 126/74 mmHg, and respiratory rate is 18 breaths/min. Her abdomen is protuberant due to pregnancy and soft. A vaginal speculum examination reveals mucous secretion with a small amount of blood. Transabdominal ultrasonography indicates a normally pulsating fetus in a vertex presentation. A transvaginal ultrasonographic image is shown separately. What should be done first?", "choices_en": ["Lateral rotation operation", "Emergency cesarean section", "Cervical cerclage surgery", "Intravenous infusion of β2 agonist", "Intramuscular injection of corticosteroids in the adrenal cortex"], "answer": ["d"]}
{"problem_id": "116B38", "problem_text_en": "A 64-year-old man presents with anterior chest pain. He has been experiencing a sensation of pressure in the anterior chest when climbing hills or stairs for three months. Symptoms improved after resting for about 5 minutes. At dinner today, he developed burning chest pain. He rested in a supine position but after 45 minutes, the symptoms did not improve, so he went to the emergency department with his family. He is alert and oriented. His height is 162 cm, weight 47 kg. His body temperature is 36.7℃. Blood pressure is 156/88 mmHg, pulse rate is 96/minute and regular, respiratory rate is 24/minute, and SpO2 is 95% (room air). Heart muscle troponin T rapid test is positive. ECG (A) and chest X-ray (B) are shown separately. What is the most likely diagnosis?", "choices_en": ["Spontaneous pneumothorax", "Acute myocardial infarction", "Reflux esophagitis", "Takotsubo cardiomyopathy", "Acute pulmonary thromboembolism"], "answer": ["b"]}
{"problem_id": "116B39", "problem_text_en": "A 26-year-old woman presented with palpitations and shortness of breath. She had been experiencing increased menstrual bleeding for the past year and had begun to notice palpitations and shortness of breath when climbing stairs three months ago. She has a 28-day menstrual cycle with a duration of eight days, and her menstrual periods are regular in timing and amount. She is 160cm tall, weighs 52kg, and her temperature is 36.4°C. Her pulse rate is 84 beats/minute and regular, and her blood pressure is 106/66mmHg. She has a respiratory rate of 22 breaths/minute. On pelvic exam, her uterus was of normal size, with no adnexal mass palpated. Laboratory results revealed a red blood cell count of 3.78 million/μL, hemoglobin level of 7.2 g/dL, hematocrit of 22%, and a white blood cell count of 6,400/μL, and platelet count of 270,000/μL. A solid tumor measuring 2 cm in diameter protruding into the uterine cavity was detected by ultrasonography. An MRI of the pelvic region was performed, revealing sagittal (A) and coronal (B) T2W images. The patient plans to become pregnant in the future. What is the appropriate treatment option to be performed after improvement of anemia with iron supplementation?", "choices_en": ["Total hysterectomy", "Hysteroscopic surgery", "Uterine artery embolization", "Endometrial ablation surgery", "Progestogen administration."], "answer": ["b"]}
{"problem_id": "116B40", "problem_text_en": "Read the following passage and answer the questions below. A 76-year-old man presents with poor appetite and general malaise. Medical history reveals a diagnosis of hypertension at age 58, for which he received antihypertensive therapy. Five years ago, he developed proteinuria that persisted at levels greater than 1g/day, and kidney function gradually deteriorated. One week ago, due to decreased appetite and increasing malaise, he visited an outpatient clinic at another hospital. The patient has a history of hospitalization for angina at age 72. He has smoked 40 cigarettes/day for 56 years and drinks one cup (180ml) of sake per day. His mother has a history of hypertension. On examination, he is alert and oriented. His height is 162 cm, weight is 47 kg, body temperature is 36.4 degrees Celsius, blood pressure is 146/92 mmHg, pulse rate is 64 beats/minute, respiratory rate is 16/minute, and his oxygen saturation is 96% on room air. There are no abnormalities in the conjunctiva. No distension of the jugular veins is observed. There are no abnormalities in the heart or breath sounds. The abdomen is flat, soft, and non-tender, and there is no palpable liver or spleen. There is pitting edema in both lower legs. Laboratory findings show 3+ proteinuria, 3.3g/day of urine protein, and hematuria. Blood tests show 2.92 million RBCs/uL, Hemoglobin 8.8 g/dL, hematocrit 28%, WBC 5,800/μL, Platelets 180,000/μL. Blood biochemistry shows a total protein of 6.3g/dL, albumin of 3.4g/dL, blood urea nitrogen of 86 mg/dL, creatinine of 8.4 mg/dL, eGFR of 6 mL/min/1.73 m², uric acid of 9.8 mg/dL, blood glucose of 113 mg/dL, sodium level of 131 mEq/L, potassium level of 7.2 mEq/L, and chloride of 104 mEq/L. CRP is 0.8 mg/dL. Chest x-ray shows a cardiothoracic ratio of 51%. During insertion of a hemodialysis catheter via the right internal jugular vein under ultrasound guidance, the patient moves his body and complains of chest tightness. What should be done first, along with verifying the patient's consciousness and breathing status?", "choices_en": ["Confirmation of SpO2", "Chest contrast-enhanced CT", "D-dimer measurement", "Intravenous furosemide", "Diazepam injection"], "answer": ["a"]}
{"problem_id": "116B41", "problem_text_en": "Which of the following is unlikely to have occurred during the treatment of this patient?", "choices_en": ["Pneumothorax", "Hemothorax", "Air embolism", "Acute aortic dissection", "Airway obstruction due to hematoma"], "answer": ["d"]}
{"problem_id": "116B42", "problem_text_en": "Read the following passage and answer the question below. \n\nA 32-year-old man was transported to the hospital by ambulance after being injured in his left forearm. His medical history includes childhood asthma, and his lifestyle includes smoking 20 cigarettes per day for 12 years and consuming 1,000 ml of beer per day. His father has diabetes. He was intoxicated at the time of the injury, having fallen onto a glass door while bathing after drinking. The patient was conscious and able to speak, and his vital signs were within normal limits. The upper arm was tightly tied with a towel to stop bleeding by a family member who heard noises and notified the ambulance. Upon arrival at the hospital, bleeding from the wound had stopped, and 80 minutes had passed since the injury. There were no abnormalities in the conjunctiva. What is the appropriate timing to remove the towel from the upper arm?\n\n(Note: This passage describes a case in Japanese emergency medical services, where it is common practice to use manual upper arm occlusion with a towel in order to achieve temporary hemostasis.)", "choices_en": ["Immediately after moving in.", "After evaluating the imaging findings.", "After confirming the results of the blood test.", "After completion of antibiotic treatment.", "At the beginning of the surgery."], "answer": ["a"]}
{"problem_id": "116B43", "problem_text_en": "A separate photograph of the wound after wiping away the blood is shown. What is the finding that suggests a nerve laceration?", "choices_en": ["Severe pain at the site of the wound", "Loss of sensation in fingertips", "Decreased brachioradialis reflex", "Inability of automatic extension of wrist joint", "Peripheral edema distal to the site of injury."], "answer": ["b"]}
{"problem_id": "116B44", "problem_text_en": "Read the following passage and answer the question below. \n\nA 78-year-old woman came to the hospital with dyspnea as the chief complaint. Past medical history: She received a health examination every year until retiring from her office job at age 65, but no abnormalities were found. Four years ago, she visited a clinic near her home when she had cold-like symptoms and was told about a heart murmur, but no investigation was conducted. She enjoyed playing table tennis as a hobby, but about one year ago, she became aware of a sense of chest compression during matches. About a month ago, she started to feel short of breath while walking to a nearby supermarket for shopping, a 15-minute walk. Life history: She smoked 20 cigarettes a day from the age of 20 to 65. She drank alcohol on occasion. Family history: Her father died of cerebral hemorrhage at the age of 73. Her mother received a stent graft insertion surgery for abdominal aortic aneurysm at the age of 82. Current situation: She was fully conscious. Her height was 154 cm, her weight was 54 kg, her body temperature was 36.8℃. Her pulse rate was 60/min and regular. Her blood pressure was 154/92 mmHg. Her breathing rate was 18/min. Her SpO2 was 97% (room air). There were no abnormalities in the conjunctiva of her eyelids. There was no engorgement of the jugular vein. No abnormal respiratory sounds were detected. A Levine 3/6 systolic ejection murmur was heard at the right sternal border of the second rib, which radiated to the neck. Her abdomen was flat and soft, with no palpable liver or spleen. What is the most likely disease?", "choices_en": ["Hypertrophic cardiomyopathy", "Patent ductus arteriosus", "Aortic valve stenosis", "Atrial septal defect", "Mitral regurgitation"], "answer": ["c"]}
{"problem_id": "116B45", "problem_text_en": "Which of the following is not included in the information that helps determine the treatment strategy?", "choices_en": ["Subjective symptoms", "Presence of comorbidities", "Findings of echocardiography test", "Findings of cardiac catheterization", "Findings on MIBG cardiac scintigraphy"], "answer": ["e"]}
{"problem_id": "116B46", "problem_text_en": "Read the following passage and answer the question below. \n\nA 20-year-old man presents to the clinic with complaints of palpitations and headaches. His medical history includes occasional episodes of palpitations and headaches since the age of 17. On the day of presentation, he experienced palpitations and severe headaches while helping a friend move furniture, and was subsequently referred to the internal medicine clinic. His past medical history is significant for a diagnosis of high blood pressure during his college entrance examination. He is currently a college student and denies smoking and alcohol use. His father has a history of hypertension and is under treatment for the same. Upon examination, he is alert and oriented, with a height of 172 cm, weight of 55 kg, and a body temperature of 36.3℃. Vital signs include a pulse rate of 132 bpm, regular, blood pressure of 192/110 mmHg, respiratory rate of 24 breaths per minute, and profuse sweating. His face is flushed, and he exhibits coolness in his extremities. The chest and abdomen appear unremarkable. Urinalysis reveals negative protein and glucose. Blood tests reveal red blood cell count of 4.63 million, Hb 13.2g/dL, Hct of 40%, WBC of 5,800, and platelet count of 220,000. Biochemical tests reveal total protein of 8.8g/dL, AST 24U/L, ALT 14U/L, LDH 183U/L (normal range 120-245), blood urea nitrogen (BUN) 17mg/dL, creatinine 0.8mg/dL, uric acid of 7.2mg/dL, blood glucose of 101mg/dL, Na of 136mEq/L, K of 4.2mEq/L, and Cl of 100mEq/L. CRP is 1.2mg/dL. The patient is admitted for further tests and treatment. What information can the physician omit during explanation to the patient at this point?\n\n(Note: The passage contains medical terms that may not be familiar to a general audience.)", "choices_en": ["Current medical condition.", "Current diagnosis name", "Overview of experimental medical care.", "Overview and risks of emergency measures to be taken.", "Overview and risks of upcoming tests"], "answer": ["c"]}
{"problem_id": "116B47", "problem_text_en": "The following test results were obtained after admission: TSH 1.76 μU/mL (reference range 0.2-4.0), FT3 3.6 pg/mL (reference range 2.3-4.3), FT4 1.4 ng/dL (reference range 0.8-2.2), aldosterone 6 ng/dL (reference range 5-10), plasma renin activity 2.0 ng/mL/hour (reference range 1.2-2.5), adrenaline 120 pg/mL (reference range below 100), noradrenaline 1,200 pg/mL (reference range 100-450). Urine VMA was 18 mg/day (reference range 1.3-5.1). Abdominal ultrasound examination revealed a 2 cm diameter mass in the left abdomen. After antihypertensive therapy was administered intravenously and blood pressure was reduced, which oral antihypertensive drug should be initially prescribed?", "choices_en": ["Alpha blocker medication.", "Angiotensin-converting enzyme (ACE) inhibitor", "Calcium channel blocker", "Beta-blockers", "Loop diuretic"], "answer": ["a"]}
{"problem_id": "116B48", "problem_text_en": "Read the following passage and answer the question below. \n\nA 64-year-old woman was transported by ambulance due to a disturbance of consciousness. Medical history: Her husband called for emergency assistance after finding her unconscious in the dressing room of their home. She had gone to the dressing room to bathe, and approximately one hour later, her husband found her, noticing that she had vomited, but there was no significant head injury. Upon arrival of the ambulance, she was in cardiac arrest, but self-pulse was restored by chest compressions and bag-mask ventilation, and she was transported to the hospital by ambulance. Past history: She has been on antihypertensive medication since the age of 54 for hypertension. Lifestyle: She has smoked 15 cigarettes per day for 44 years and drinks 350 mL of beer six days a week. She lives with her husband. Family history: Her mother died of cerebral hemorrhage at the age of 85. Present condition: Consciousness level is JCS III-300. Height 160 cm, weight 54 kg. Body temperature is 36.0℃. Heart rate is 64 beats per minute and regular. Blood pressure is 98/50 mmHg. Ventilation rate is 10 breaths per minute. SpO2 is 92% (adjusted breathing with a bag-mask ventilation). Her tongue base is down. Pupil diameter is 4 mm on both sides, and light reflex is delayed on both sides. Electrocardiogram monitoring shows sinus rhythm, but with giant negative T waves. What should be done as a priority upon admission?\n\nThe correct answer is not provided in the passage.", "choices_en": ["Tracheal intubation", "Adrenaline injection", "Intravenous prednisolone", "Calcium gluconate intravenous injection", "Electric defibrillation (electric shock)"], "answer": ["a"]}
{"problem_id": "116B49", "problem_text_en": "Here is the English translation: \n\nA CT scan of the head taken at the initial examination is separately shown. After hospitalization, the patient was placed in the ICU for observation with conservative treatment. The following day, the findings were as follows. The level of consciousness was JCS III-300. The body temperature was 37.2 ℃. The pulse rate was 120/min and regular. Blood pressure was 94/60 mmHg (under administration of a vasopressor). SpO2 was 98% (with mechanical ventilation at FIO2 0.5). The pupils were fixed and dilated with a diameter of 6 mm in both eyes. No corneal reflex, gag reflex, or cough reflex was observed. There was no body movement and no pupil response to facial pain stimulation. What should be done next for the determination of brain death?", "choices_en": ["Head MRI", "Electroencephalogram (EEG) examination", "Visual evoked potential (VEP)", "Needle electromyography test.", "Peripheral nerve conduction test"], "answer": ["b"]}
{"problem_id": "116B50", "problem_text_en": "A 24-hour urine collection test was performed on a patient with chronic kidney disease. The patient had a urine output of 2,500mL/day, urine protein of 82mg/dL, and urine creatinine of 40mg/dL. Calculate the amount of protein excreted in urine in one day (in grams). Round off to two decimal places. Answer: ①.② g/day.", "choices_en": [], "answer": ["21"]}
