{"problem_id": "116F1", "problem_text_en": "When a patient is recommended to use daycare rehabilitation services under the long-term care insurance system, what is the most appropriate profession that the patient should request support from?", "choices_en": ["Care manager", "Dental hygienist", "Visiting nurse", "Home helper or caregiver", "Physical therapist"], "answer": ["a"]}
{"problem_id": "116F2", "problem_text_en": "A patient who was hospitalized wishes to return to work after discharge. What is an appropriate response from the attending physician in terms of supporting the patient's treatment and job retention?", "choices_en": ["To determine whether reinstatement is possible.", "Have the superior receive medical examination together.", "Provide guidance on points to be noted regarding employment.", "Convey the treatment plan to the employer.", "Instruct to prioritize treatment and refrain from work."], "answer": ["c"]}
{"problem_id": "116F3", "problem_text_en": "Which has the lowest radiation sensitivity?", "choices_en": ["Thyroid gland", "Bone marrow", "Nerve", "Skin", "Ovary"], "answer": ["c"]}
{"problem_id": "116F4", "problem_text_en": "Which of the following is correct regarding respiratory function in chronic obstructive pulmonary disease (COPD)?", "choices_en": ["Reduced residual volume", "Pulse oximetry reading greater than 70% for one second.", "Increase in lung diffusion capacity", "Increased static lung compliance", "Convex flow-volume curve"], "answer": ["d"]}
{"problem_id": "116F5", "problem_text_en": "Which of the following is not a cause of elevated triglycerides?", "choices_en": ["Acromegaly", "Visceral fat accumulation", "Excessive alcohol consumption", "Hyperthyroidism", "Increase in insulin resistance"], "answer": ["d"]}
{"problem_id": "116F6", "problem_text_en": "Separate from the Maternal and Child Health Handbook, the stool color card indicates that if a one-month-old infant's stool color is ranked as \"1,\" what disease is likely?", "choices_en": ["Breast milk jaundice", "Biliary atresia", "Lactose intolerance", "Vitamin K deficiency", "Pediatric gastrointestinal allergy in newborns and infants"], "answer": ["b"]}
{"problem_id": "116F7", "problem_text_en": "Which is the correct combination of heart murmurs/heart sounds and their related diseases?", "choices_en": ["Continuous murmur - aortic valve stenosis with insufficiency", "Pericardial knock sound --------- Cardiac tamponade", "Systolic murmur enhanced by inspiration ---------- Pulmonary valve regurgitation", "Increased systolic murmur with forward bending of the upper body --- Tricuspid stenosis", "Squatting decreased systolic murmur - Obstructive hypertrophic cardiomyopathy"], "answer": ["e"]}
{"problem_id": "116F8", "problem_text_en": "What is the cause of menorrhagia?", "choices_en": ["Adenomyosis", "Intrauterine adhesion syndrome", "Sheehan's syndrome.", "Polycystic ovary syndrome", "Hyperprolactinemia"], "answer": ["a"]}
{"problem_id": "116F9", "problem_text_en": "Which of the following conditions has the lowest frequency of mucosal rash?", "choices_en": ["Lichen planus", "Plaque psoriasis", "Pustular psoriasis", "Pemphigus vulgaris", "Erythema multiforme"], "answer": ["b"]}
{"problem_id": "116F10", "problem_text_en": "Which of the following is of low priority when practicing medicine at the only clinic on an isolated island?", "choices_en": ["Providing advanced medical care", "Collaboration with local governments", "Collaboration with other medical institutions", "Development of a remote reading system", "Development of emergency transportation system"], "answer": ["a"]}
{"problem_id": "116F11", "problem_text_en": "What is the English term for the international health initiative aimed at achieving a state where everyone can receive appropriate healthcare services at an affordable cost when needed?", "choices_en": ["Universal Health Coverage (UHC)", "Sustainable Development Goals (SDGs)", "Official Development Assistance (ODA)", "International Health Regulations (IHR)", "International Classification of Diseases (ICD)"], "answer": ["a"]}
{"problem_id": "116F12", "problem_text_en": "Which of the following is not included in the principles of universal design?", "choices_en": ["Can be used fairly/equally.", "Physically less burdensome.", "Usage is limited.", "Simple and intuitive to use.", "Even if used incorrectly, it is unlikely to have serious consequences."], "answer": ["c"]}
{"problem_id": "116F13", "problem_text_en": "Which of the following statements about hospital-acquired pneumonia (HAP) is correct?", "choices_en": ["The main detected bacteria is pneumococcus.", "Does not include ventilator-associated pneumonia.", "It includes pneumonia that occurred on the day of hospitalization.", "The mortality rate is lower than that of healthcare-associated pneumonia.", "It often occurs in patients with weakened immune systems."], "answer": ["e"]}
{"problem_id": "116F14", "problem_text_en": "Which of the following is the latest period for achieving the development of psychomotor skills?", "choices_en": ["Draw a circle.", "Use scissors.", "Able to distinguish left and right.", "Standing on one foot.", "Play pretend."], "answer": ["c"]}
{"problem_id": "116F15", "problem_text_en": "Which disease is diagnosed by autoantibodies against the components of neutrophils?", "choices_en": ["Kawasaki disease", "Takayasu's arteritis", "Giant cell arteritis", "Polyarteritis nodosa", "Microscopic polyangiitis"], "answer": ["e"]}
{"problem_id": "116F16", "problem_text_en": "Which of the following combinations of visual field abnormality and disease is incorrect?", "choices_en": ["Bjerrum scotoma --------- glaucoma", "Blind spot at the center of vision --------- Optic neuritis", "Bilateral hemianopsia - Pituitary adenoma", "Horizontal hemianopia --------- Age-related macular degeneration", "Choroideremia"], "answer": ["d"]}
{"problem_id": "116F17", "problem_text_en": "Which of the following statements is correct regarding livelihood protection (seikatsu hogo)?", "choices_en": ["The standard for livelihood protection is determined by each prefecture.", "The number of protected households has been decreasing in recent years.", "The number of protected households is highest among households with elderly members.", "The start of livelihood protection has the highest number of people requiring nursing care.", "Welfare recipients are enrolled in the National Health Insurance."], "answer": ["c"]}
{"problem_id": "116F18", "problem_text_en": "What type of dietary form is useful for preventing aspiration in elderly individuals with impaired swallowing function?", "choices_en": ["High cohesiveness (clumping of food bolus)", "Low homogeneity (smoothness)", "Highly adhesive", "High hardness", "High temperature"], "answer": ["a"]}
{"problem_id": "116F19", "problem_text_en": "Which of the following is not an appropriate response to the issue of polypharmacy in elderly patients?", "choices_en": ["Decide on a regular pharmacy.", "Check for duplication of similar drugs.", "Instruct to carry medication notebook.", "Prescribe without considering drug interactions.", "Consider tapering the medication if the condition is stable."], "answer": ["d"]}
{"problem_id": "116F20", "problem_text_en": "Which statement is incorrect about the Act on Promotion of the Next Generation Support Measures?", "choices_en": ["Child welfare facilities are regulated.", "Citizens have a responsibility to cooperate in supporting child-rearing.", "Aims to ensure that children are born and raised healthily.", "Both national and local governments have a responsibility to promote child-rearing support.", "Employers with more than 100 employees must establish a next-generation development action plan."], "answer": ["a"]}
{"problem_id": "116F21", "problem_text_en": "Which of the following is an appropriate inquiry regarding language development during a 1 year and 6 month old health checkup?", "choices_en": ["Can you say your name?", "Do you say two-word phrases such as \"wanwan kita\" and \"mamachōdai\"?", "Mom, do you speak several meaningful words like \"boo-boo\"?", "Do you speak in a voice that would allow you to communicate with your family when you are together?", "Do you understand simple words spoken by adults, such as \"come here\" or \"give me\"?"], "answer": ["c"]}
{"problem_id": "116F22", "problem_text_en": "Which of the following phenomena is correct when an interaction exists between a genetic factor and smoking habit with respect to the risk of a certain disease?", "choices_en": ["There are differences in smoking habits depending on the presence or absence of genetic factors.", "The relationship between smoking habits and disease varies depending on the presence or absence of genetic factors.", "When adjusting for genetic factors, the association between smoking habits and diseases disappears.", "The relationship between genetic factors and disease disappears when adjusted for smoking habits.", "Regardless of genetic factors, the preventive effect of smoking cessation on disease is observed to be the same degree."], "answer": ["b"]}
{"problem_id": "116F23", "problem_text_en": "What neurological findings would be seen on the left side of a patient with a hemisection of the right side of the spinal cord at the level of the nipple?", "choices_en": ["Loss of abdominal reflex", "Positive Babinski sign", "Hoffmann's reflex positive", "Impaired vibratory sensation in lower limbs", "Umbilical-level thermal hyperalgesia"], "answer": ["e"]}
{"problem_id": "116F24", "problem_text_en": "Which job positions or organizations are not related to suicide prevention measures in the workplace?", "choices_en": ["Occupational physician", "Health management administrator", "Occupational health physician/nurse", "Industrial Health Promotion Center", "Mental health and welfare center"], "answer": ["e"]}
{"problem_id": "116F25", "problem_text_en": "Which of the following is the least filtered by a normal glomerulus?", "choices_en": ["IgG (Immunoglobulin G)", "Inulin", "Glucose", "Sodium", "Creatinine"], "answer": ["a"]}
{"problem_id": "116F26", "problem_text_en": "Which of the following combinations of bleeding symptoms and diseases is incorrect?", "choices_en": ["Nosebleed --------- Hereditary hemorrhagic telangiectasia (Osler's disease)", "Gingival bleeding - IgA vasculitis (also known as Schönlein-Henoch purpura)", "Petechiae - Immune thrombocytopenic purpura", "Joint bleeding --------- Hemophilia A", "Oral bleeding --------- Aplastic anemia"], "answer": ["b"]}
{"problem_id": "116F27", "problem_text_en": "Which of the following are definitive tests for prenatal genetic testing? Select two.", "choices_en": ["Chorionic villus sampling (CVS)", "Amniocentesis", "Ultrasound examination", "Maternal serum marker test", "Non-invasive prenatal testing (NIPT)"], "answer": ["a", "b"]}
{"problem_id": "116F28", "problem_text_en": "Which of the following are criteria that are higher in newborn babies than in adults? Select two.", "choices_en": ["Immunoglobulin M (IgM)", "Total protein", "Total bilirubin", "Creatinine", "Alkaline phosphatase"], "answer": ["c", "e"]}
{"problem_id": "116F29", "problem_text_en": "Which of the following indices can be obtained from the National Survey on Lifestyle Preferences? Select two.", "choices_en": ["Marriage rate", "Treatment rate (or rate of receiving medical treatment)", "Prevalence", "Rate of individuals with complaints/symptoms", "Outpatient rate"], "answer": ["d", "e"]}
{"problem_id": "116F30", "problem_text_en": "Which of the following increase during late pregnancy as compared to before pregnancy in a normal pregnancy? Select two.", "choices_en": ["Platelets", "Creatinine", "Hemoglobin", "Fibrinogen", "Total cholesterol"], "answer": ["d", "e"]}
{"problem_id": "116F31", "problem_text_en": "Which combinations of congenital anomalies and inheritance pattern are correct? Choose two.", "choices_en": ["Hemophilia --------- X-linked recessive inheritance", "Achondroplasia - cytoplasmic inheritance", "Marfan syndrome - autosomal dominant inheritance", "Neurofibromatosis type 1 - X-linked dominant inheritance", "Duchenne muscular dystrophy ------- Autosomal recessive inheritance"], "answer": ["a", "c"]}
{"problem_id": "116F32", "problem_text_en": "Which of the following are common primary sites of origin for metastatic ovarian tumors? Select two.", "choices_en": ["Lung cancer", "Gastric cancer", "Colorectal cancer", "Bladder cancer", "Thyroid cancer"], "answer": ["b", "c"]}
{"problem_id": "116F33", "problem_text_en": "Which of the following are important for preventing care needs in elderly people? Select three.", "choices_en": ["Frailty", "Sarcopenia", "Toxidrome", "Anaphylaxis", "Locomotive syndrome"], "answer": ["a", "b", "e"]}
{"problem_id": "116F34", "problem_text_en": "Which of the following can cause weight loss? Select three.", "choices_en": ["Addison's disease", "Pheochromocytoma", "Hyperthyroidism", "Primary aldosteronism", "Primary hyperparathyroidism"], "answer": ["a", "b", "c"]}
{"problem_id": "116F35", "problem_text_en": "A 73-year-old man presents with complaints of pain in both calves when walking. He reports that the pain is relieved by rest after walking for about 5 minutes. As a result, he always uses a bicycle when going outside. He has no abnormality in the upper limbs, no sensory impairment or muscle weakness in both lower limbs, and good palpation of the dorsalis pedis artery on both sides with no abnormality in ankle-brachial index (ABI). A separate X-ray of his lumbar spine is presented. What is the useful test for diagnosis?", "choices_en": ["Muscle biopsy", "Head MRI", "MRI of the lumbar spine", "Intramuscular pressure measurement", "Bilateral lower limb angiography"], "answer": ["c"]}
{"problem_id": "116F36", "problem_text_en": "A 7-year-old boy was brought to the clinic by his mother, complaining of a rash that had started since yesterday. He has been healthy since birth and his general condition is good. His body temperature is 37.3℃, and a rash is observed all over his body, including the scalp. Which of the following is correct regarding his school attendance?", "choices_en": ["If overall condition is good, attendance at school is possible.", "Absence from attendance for 5 days after onset of symptoms", "Suspension of attendance until the rash disappears", "Suspension of attendance until 3 days after the fever subsides", "Suspension of attendance until all rashes become crusted"], "answer": ["e"]}
{"problem_id": "116F37", "problem_text_en": "A 45-year-old woman presents to the clinic with bilateral hearing loss and tinnitus. She has been aware of the hearing loss since she was about 25 years old, and it has gradually worsened. She started to develop tinnitus around the age of 35. There is no abnormality in either tympanic membrane. A separate audiogram is provided. What is the most likely diagnosis?", "choices_en": ["Otosclerosis", "Acoustic neuroma", "Otitis media with effusion", "Meniere's disease", "Bilateral sensorineural hearing loss with early onset"], "answer": ["a"]}
{"problem_id": "116F38", "problem_text_en": "A 25-year-old man was brought to the emergency room because bleeding from his ear would not stop. He stated that during a fight, a knife grazed his right ear, causing bleeding, and compression did not stop the bleeding. A photo of the wound is provided separately. What disinfectant can be used before the wound is sutured?", "choices_en": ["Acetic acid", "Ethanol", "Benzalkonium chloride", "Glutaraldehyde", "Sodium hypochlorite"], "answer": ["c"]}
{"problem_id": "116F39", "problem_text_en": "A 66-year-old man was found dead in the burned remains of his apartment, which caught fire. An autopsy was performed for identification of the cause of death. Which of the following findings during the autopsy indicates that the man was alive at the time of the fire?", "choices_en": ["Intracranial hematoma", "Third-degree burn of the neck skin", "Soot deposition in the trachea", "Heat shrinkage of the elbow flexor muscles", "Decubitus ulcer on the back"], "answer": ["c"]}
{"problem_id": "116F40", "problem_text_en": "A 7-year-old girl was brought to the emergency department because of a deformity in her right lower leg. She became unable to walk after landing incorrectly from a one-meter fall in a park. She is alert and conscious with a body temperature of 36.7℃, blood pressure of 128/84mmHg, heart rate of 112 bpm (regular), respiratory rate of 25/min, and SpO2 of 99% (room air). She has no significant medical history. Although her right lower leg is deformed externally, there is no open wound. The dorsalis pedis and posterior tibial pulses are palpable bilaterally. She has no sensory abnormalities or abnormal toe movement in the affected limb. A diaphyseal fracture of the right tibia and fibula is diagnosed, and closed reduction and immobilization with a cast are performed. X-rays before (A) and after (B) immobilization are shown separately. Which of the following instructions to the patient and her family after returning home are incorrect?\n\n(Note: The rest of the text describing the patient's care has been omitted as it is not relevant to the translation task.)", "choices_en": ["\"It's okay to put weight on the right foot.\"", "\"Please perform dorsiflexion and plantarflexion of your right toes firmly.\"", "\"Please regularly check the color tone of your right toe.\"", "\"Please spend your time with your right leg lifted up as high as possible.\"", "\"If you experience abnormal sensation or pain in your right toe, please see a doctor immediately.\""], "answer": ["a"]}
{"problem_id": "116F41", "problem_text_en": "A 40-year-old man presents with numbness and coldness in his hands. He came to the hospital because he had these symptoms in both hands in the morning. The symptoms had appeared 3 weeks ago and sometimes his fingers turned white. A photo taken at that time is shown separately. He has been working for 10 years mainly in excavation work using tools at construction sites. There is no history of working with chemicals. He has never smoked and drinks only occasionally. He is alert and oriented. His height is 166 cm, weight 65 kg. His body temperature is 36.4°C. His pulse is 72 beats/min and regular. Blood pressure is 120/70 mmHg. Heart and lung sounds are normal. There are no abnormalities in his lower extremities. Laboratory findings (fasting) reveal: red blood cells 5.1 million, Hb 13.7 g/dL, Hct 44%, reticulocytes 3.0%, and white blood cells 5,900. Biochemistry: platelets 250,000, total protein 7.5 g/dL, albumin 4.2 g/dL, total bilirubin 1.1 mg/dL, direct bilirubin 0.2 mg/dL, AST 26 U/L, ALT 14 U/L, LD 167 U/L (normal range: 120-245), ALP 83 U/L (normal range: 38-113), γ-GT 30 U/L (normal range: 8-50), CK 75 U/L (normal range: 30-140), urea nitrogen 11 mg/dL, creatinine 0.5 mg/dL, glucose 97 mg/dL, HbA1c 4.8% (normal range: 4.6-6.2), Na 139 mEq/L, K 4.5 mEq/L, and Cl 98 mEq/L. What is necessary for this patient?", "choices_en": ["Weight loss", "Thorough abstinence from alcohol", "Review of tools", "Outdoor exercise during vacation/holiday", "Moderate intake of water containing salt during work"], "answer": ["c"]}
{"problem_id": "116F42", "problem_text_en": "A 38-year-old man complains of swelling in his face and legs. He noticed swelling in both upper eyelids when he woke up two weeks ago and came to the hospital because he cannot wear shoes that he usually wears because of the tightness. He has no pain in his legs. He has gained 8 kg in weight in a month. He has no medical history and no smoking or drinking history. His level of consciousness is clear. His body temperature is 36.8℃. His pulse rate is 72 beats per minute and regular. His blood pressure is 132/76 mmHg. His respiratory rate is 16 breaths per minute. His SpO2 is 98% on room air. There are no abnormalities in the conjunctiva or sclera. His thyroid gland and cervical lymph nodes cannot be palpated. There is no distension in the jugular vein. No abnormalities are observed in heart sounds or breath sounds. His abdomen is flat, soft, and there is no palpable liver or spleen. When the anterior surface of the tibia was compressed with the thumb for 5 seconds, pitting edema with pressure marks was observed bilaterally. What is the most likely diagnosis at this point?", "choices_en": ["Pulmonary hypertension", "Lower limb deep vein thrombosis", "Nephrotic syndrome", "Hypothyroidism", "Budd-Chiari syndrome"], "answer": ["c"]}
{"problem_id": "116F43", "problem_text_en": "A 34-year-old woman (G2P1) was admitted to the hospital at 39 weeks and 5 days of gestation due to the onset of labor pains. The pregnancy has been uneventful. The woman had a normal vaginal delivery of her first child 2 years ago. Fetal heartbeats were detected at the mother's lower left abdomen on arrival at the hospital. On internal examination, the cervical dilation was 5 cm, effacement was 70%, descent was −2 cm to the spines, the presenting part was the occiput at the 3 o'clock position, and the sagittal suture corresponded to the transverse diameter of the pelvis. Five hours after admission to the hospital, the cervix was fully dilated and 10 minutes later, the membranes ruptured spontaneously. There was no meconium-stained liquor. At this stage, the presenting part was the occiput at the 12 o'clock position, and the sagittal suture corresponded to the longitudinal diameter of the pelvis. Which of the following is true?", "choices_en": ["It is an abnormality of the second rotation.", "The tumor is located in the posterior portion of the right parietal bone.", "The bone mineral density shows that the right parietal bone is under the left parietal bone.", "In the fourth week of gestation, the face of the embryo turns towards the left side of the mother's body.", "The left scapula is delivered first during trunk delivery."], "answer": ["b"]}
{"problem_id": "116F44", "problem_text_en": "An 85-year-old man was hospitalized 3 weeks ago for pneumonia. He was diagnosed with advanced lung cancer 2 years ago but did not receive cancer treatment. With sufficient discussion with the patient and his wife, he is currently receiving only antibiotic therapy and 500 mL of fluid per day. This morning, he showed (1) unresponsiveness to calls, (2) inability to swallow liquids, (3) jaw breathing, (4) peripheral edema, and (5) had no bowel movements. The elderly wife is at home and hopes to be present at the time of death. Which of the underlined findings is the most likely to lead to death within 24 hours?", "choices_en": ["① is not a word or phrase, but rather a numerical symbol indicating the number one in Japanese. It is not translatable as a choice in a multiple-choice question without additional context.", "This is not a word or term, but a number. As such, it cannot be translated, but it typically indicates a choice or an answer in a multiple-choice question.", "Unfortunately, as it is only a number without context or options, it is impossible to accurately translate. Please provide more information so I can assist you better.", "Sorry, I cannot translate \"④\" as it is a symbol used for representing a choice or an option in a multiple-choice question. It should be accompanied by text indicating the actual answer choice.", "Sorry, ⑤ cannot be translated without context. It is a number or a reference to a specific question or option."], "answer": ["c"]}
{"problem_id": "116F45", "problem_text_en": "A 71-year-old man presents with chief complaint of jaundice. He has been experiencing general fatigue for a month and noticed yellowing of the skin three days ago, thus he decided to visit the hospital. He has been under treatment for type 2 diabetes for 20 years and continues to take oral hypoglycemic agents. He has no history of blood transfusion or alcohol consumption. He is conscious and alert. His body temperature is 36.8°C. His pulse is regular at 72 beats per minute. His blood pressure is 128/80 mmHg. No anemia is detected on the conjunctiva of the eyelids. Yellowing of the conjunctiva of the eyeball is observed. His abdomen is flat and soft, and the liver and spleen are not palpable. He shows jaundice all over his body. Urinalysis: Protein (-), glucose (-), occult blood (+), bilirubin 2+. Blood test: RBC 4.68 million, Hb 13.9 g/dL, Ht 42%, WBC 8,300, Platelets 210,000. Blood biochemistry: Total bilirubin 9.8 mg/dL, direct bilirubin 6.2 mg/dL, AST 52 U/L, ALT 63 U/L, ALP 323 U/L (reference range 38 to 113), LD 242 U/L (reference range 120 to 245), and γ-GT 282 U/L (reference range 8 to 50). Immunological test: CRP 1.0 mg/dL, HBs antigen negative, HCV antibody negative. A separate image of the abdominal ultrasonography is shown. What is the likely condition?", "choices_en": ["Constitutional jaundice", "Obstructive jaundice", "Hemolytic anemia", "Drug-induced liver injury", "Viral hepatitis"], "answer": ["b"]}
{"problem_id": "116F46", "problem_text_en": "A 32-year-old primigravida presents to the hospital with complaints of labor pains. She has had an uneventful pregnancy thus far. She reports regular uterine contractions at 10-minute intervals since 1 am on 41 weeks of gestation, which gradually became more frequent and led her to present at 9 am. She is 156 cm in height and weighs 71 kg (63 kg prior to pregnancy). Her temperature is 37.1°C, pulse rate is 92 beats/min and regular, blood pressure is 128/74 mmHg, and respiratory rate is 20 breaths/min. On vaginal examination, there is bloody discharge, the cervix is dilated at 5 cm, effacement is 60%, the consistency is moderate, and the presenting part is the fetal head, which is at station –1 cm. Fetal heart rate is normal, and contraction frequency is 5 minutes, lasting 1 minute and 20 seconds. At 3 pm, the cervix is fully dilated, effaced, and the fetal head descends with station +3 cm. The fetal head is aligned with the mother's pelvic axis and touches the ischial spines in an occipito-anterior position. A fetal heart rate tracing taken at this point is shown separately. What is the appropriate management at this point?", "choices_en": ["Vacuum extraction delivery", "Observation/follow-up (with no treatment)", "Pelvic measurement", "Cesarean section", "Administration of oxytocin"], "answer": ["b"]}
{"problem_id": "116F47", "problem_text_en": "A 79-year-old man came to the hospital after being pointed out for chest abnormal shadows during lung cancer screening. There were no abnormalities or symptoms last year during screening. Further examination revealed a diagnosis of clinical stage IA left lower lobe lung adenocarcinoma. The maximum tumor diameter was 2.0 cm. The patient chose to undergo radiotherapy. What complication can occur due to this treatment? A chest CT scan is shown separately.", "choices_en": ["Pneumonia", "Cardiomegaly", "Emulsion thorax", "Upper limb edema", "Facial nerve paralysis (or Bell's palsy)"], "answer": ["a"]}
{"problem_id": "116F48", "problem_text_en": "A 69-year-old man came to the hospital complaining of chest pain. He has been receiving hemodialysis once a week for 4 hours for chronic kidney disease caused by diabetic nephropathy for the past six months. Today, he finished his hemodialysis session as usual and went home. While watching television at home, he suddenly experienced left anterior chest pain and began sweating profusely. The symptoms did not improve, so he went to the emergency room by car, driven by his family. He continues to experience similar symptoms as when he arrived. He is conscious and alert but has a distressed-looking facial expression. His height is 168 cm, and his weight is 67 kg (65.8 kg after dialysis). His pulse is 100 beats per minute and regular, and his blood pressure is 156/88 mmHg. His oxygen saturation is 96% on room air. His daily urine output is about 500 mL. There are no abnormalities in his heart or respiratory function, but a vascular murmur is heard on his left anterior forearm. He has 2 mm ST elevation in leads II, III, and aVF on the electrocardiogram. What is the most appropriate course of action?", "choices_en": ["Administer a diuretic drug.", "Perform coronary angiography.", "Perform an emergency hemodialysis.", "Instruct to observe the progress at home.", "Perform an ultrasound examination of the upper limbs."], "answer": ["b"]}
{"problem_id": "116F49", "problem_text_en": "A 66-year-old woman presented with complaints of chest discomfort during exertion. She has been receiving regular treatment for hypertension and diabetes for 10 years. She came to the hospital because she had experienced chest discomfort several times when taking out the garbage around 6 am for the past 2 months. The electrocardiogram (ECG) at the time of admission showed complete right bundle branch block and there was no change from before. Although she reached the target heart rate during the treadmill exercise ECG test, there were no findings that could be evaluated enough. Coronary angiography showed stenosis of about 50-75% in the left anterior descending coronary artery, as indicated by the arrow. It was considered appropriate to perform revascularization surgery. What is the appropriate test to evaluate the presence of myocardial ischemia?", "choices_en": ["Holter ECG (electrocardiogram)", "FDG-PET scan", "Master 2-step technique", "MIBG myocardial scintigraphy", "Exercise stress thallium myocardial scintigraphy"], "answer": ["e"]}
{"problem_id": "116F50", "problem_text_en": "A 33-year-old man has had increased absences from work and was recently told by his coworkers that he smells like alcohol. He visited an industrial physician who recommended that he visit a psychiatrist. At the psychiatric examination, he was diagnosed with alcohol dependence. During the examination, he stated that he had been drinking more due to work-related stress and feeling depressed. He also reported that he quit drinking alcohol three days ago when he was advised to cut down on his drinking. He exhibits hand tremors and sweating. What is the correct diagnosis for this patient?", "choices_en": ["Physical dependence is observed.", "Recommendation of resignation from physician.", "The possibility of accompanying depression is low.", "The first choice of treatment is drug therapy.", "Often seeks treatment actively."], "answer": ["a"]}
{"problem_id": "116F51", "problem_text_en": "A 32-year-old man was brought in by an ambulance with a complaint of nausea. He reported that a sealed radioactive material line source was damaged in an accident, and it adhered to his clothes and skin. He has no medical history. He is conscious and alert. He is 172 cm tall and weighs 60 kg. His body temperature is 36.2℃. His heart rate is 80/min and regular, blood pressure is 122/68 mmHg, and respiratory rate is 12/min. Oxygen saturation is 100% on room air. There are no abnormalities in the conjunctiva or eyeball. There is no jugular vein distension. No abnormal heart or lung sounds are heard. The abdomen is flat, soft, and there is no palpable liver or spleen. Prior to arrival at the hospital, he underwent decontamination of his clothes and the area where the line source adhered to the skin. It has been 40 minutes since the injury. Which of the following is NOT an appropriate response to this patient?", "choices_en": ["Medical professionals wear personal dosimeters.", "Medical personnel shall wear sleeveless aprons.", "Confirm the type of radioactive material that has been exposed.", "Perform zoning while considering the patient's transportation route.", "Measure the contamination on the surface of the patient using a radiation detector."], "answer": ["b"]}
{"problem_id": "116F52", "problem_text_en": "A 20-year-old man presented with pain on the lateral aspect of the right ankle. He twisted his right ankle while practicing soccer yesterday. Swelling with subcutaneous bleeding was observed around the outside of the right ankle. X-rays of the right ankle (A) and stress X-rays in the injured position (B) are shown separately. Which of the following is the appropriate status of the right ankle?", "choices_en": ["Rigidity/muscle stiffness", "Contracture", "Destruction", "Deformity", "Instability"], "answer": ["e"]}
{"problem_id": "116F53", "problem_text_en": "A 46-year-old woman presented with severe pain from the left side of the abdomen to the back in the early morning. Three years earlier, she had similar symptoms that resolved naturally. She has no relevant family history. She is alert and oriented. Her height is 158 cm, weight is 58 kg, and temperature is 36.3 °C. Her pulse is 80 bpm and regular, while her blood pressure is 122/86 mmHg, and respiratory rate is 20 breaths/min. She appears pale and complains of nausea. Her abdomen is flat and does not have rebound tenderness. Tenderness is noted at the left costovertebral angle. Urine test reveals negative protein, glucose, ketone, positive occult blood, 10-19/high power field (HPF) of red blood cells, and 1-4/HPF of leukocytes. Blood tests show a red blood cell count of 4.34 million/µL, hemoglobin of 13.8 g/dL, hematocrit of 42%, white blood cell count of 9,600/µL, and platelet count of 210,000/µL. Biochemical analysis shows total protein of 7.0 g/dL, albumin of 3.8 g/dL, total bilirubin of 0.9 mg/dL, AST of 30 U/L, ALT of 28 U/L, LD of 179 U/L (reference range: 120-245), blood urea nitrogen of 20 mg/dL, creatinine of 1.0 mg/dL, uric acid of 6.6 mg/dL, blood glucose of 98 mg/dL, Na of 139 mEq/L, K of 4.2 mEq/L, Cl of 98 mEq/L, and Ca of 9.1 mg/dL. An abdominal X-ray is shown separately in supine position. Which of the following is an appropriate explanation regarding prevention of recurrence for this patient?", "choices_en": ["\"Salt intake is effective\"", "\"Fat intake is effective\"", "\"Citric acid intake is effective\"", "\"Alcohol ingestion is effective\"", "\"Vitamin D intake is effective.\""], "answer": ["c"]}
{"problem_id": "116F54", "problem_text_en": "A 6-year-old boy was pointed out to have severe hearing loss on one side during a health check-up before starting school, and was brought in by his mother. He had no history of neonatal asphyxia or developmental abnormalities. The hearing screening test in the neonatal period did not show any abnormalities in both ears. He had a history of subacute adenoiditis at the age of 2. What is the most likely cause of the hearing loss?", "choices_en": ["Chronic otitis media", "Epidemic parotitis (mumps)", "Congenital rubella syndrome", "Hypoxic-ischemic encephalopathy", "Treacher Collins syndrome"], "answer": ["b"]}
{"problem_id": "116F55", "problem_text_en": "A 76-year-old man was brought in by ambulance due to respiratory distress. He had developed a fever and dry cough eight days ago, and complained of difficulty breathing even at rest since this evening. His wife noticed he was confused and called an ambulance. She had experienced sore throat and low-grade fever two weeks ago, but has since recovered. He has a smoking history of 20 cigarettes per day from the age of 20 to 63. He is drowsy with a Japan Coma Scale (JCS) of III-100. His height is 163 cm and weight is 65 kg. His body temperature is 37.7°C, heart rate 80/min and regular, blood pressure 104/64 mmHg, and respiratory rate 24/min. His oxygen saturation (SpO2) is 93% with a reservoir mask and oxygen flow of 10 L/min. His heart sounds are normal, and coarse crackles are heard in both lower lung fields at the back. Laboratory findings show: red blood cells 4.7 million/µL, hemoglobin 14.2 g/dL, white blood cells 4,800/µL, platelets 10,000/µL, prothrombin time-international normalized ratio (PT-INR) 2.4 (reference range 0.9-1.1), lactate dehydrogenase (LD) 629 U/L (reference range 120-245), blood urea nitrogen (BUN) 23 mg/dL, creatinine 0.9 mg/dL, glucose 128 mg/dL, and C-reactive protein (CRP) 10 mg/dL. Arterial blood gas analysis with a reservoir mask and oxygen flow of 10 L/min shows pH 7.40, PaCO2 42 Torr, PaO2 64 Torr, and HCO3- 24 mEq/dL. His electrocardiogram shows sinus rhythm, and chest X-ray (A) and chest CT (B) are shown separately. The PCR test for SARS-CoV-2 using saliva was positive. What is the appropriate treatment at present? Select two.", "choices_en": ["Artificial respiration management", "Administration of antifibrotic drugs", "Performing a bronchoscopy-guided lung biopsy", "Corticosteroid therapy", "Oral administration of Cyclophosphamide"], "answer": ["a", "d"]}
{"problem_id": "116F56", "problem_text_en": "A 34-year-old woman was brought to the hospital by her mother because she has been persistently making phone calls in the middle of the night to whoever, regardless of who they are. For the past two weeks, she has been exhibiting unusual behavior such as incoherent speech and bursts of laughter triggered by trivial things. She hardly sleeps, but doesn't feel tired. She talks to relatives and friends about plans to buy an apartment or a car, and becomes violently angry if they oppose her. Blood tests, brain imaging, EEG, and cerebrospinal fluid tests all show no abnormalities, and there is no evidence of illegal drug use. Which of the following symptoms are present in this patient? Select two. \n\n", "choices_en": ["Ideational apraxia", "Echoic language", "Grandiose delusion", "Forced experience", "Cataplexy"], "answer": ["a", "c"]}
{"problem_id": "116F57", "problem_text_en": "An 18-year-old boy presents with diplopia. Ten days ago, he was hit in the left eye with a baseball during a game. Although the eyelid swelling and subcutaneous hemorrhage have resolved, he complains of double vision. His visual acuity is good in both eyes and no abnormalities are observed within the eyes. However, abnormal findings are observed when looking up. Which of the following is the most likely affected area of the left eye? Select two.", "choices_en": ["Rectus superior muscle", "Rectus abdominis", "Infraspinatus muscle", "Superior orbital wall", "Inferior orbital wall"], "answer": ["b", "e"]}
{"problem_id": "116F58", "problem_text_en": "A 73-year-old woman has been receiving NSAID prescriptions for her lower back pain at a local clinic for two months, but the symptoms did not improve. She was referred for high proteinemia found on a blood test. Due to lower back pain, she is having difficulty moving around and walking by herself. Her height is 158 cm, weight is 48 kg (a loss of 3 kg over two months), body temperature is 36.5°C, pulse rate is 84/min and regular, and blood pressure is 138/86 mmHg. Her palpebral conjunctiva appears anemic. Blood tests show: red blood cells, 2.45 million; Hb, 8.2 g/dL; Ht, 23%; white blood cells, 2,800; platelets, 150,000. Blood biochemistry tests show: total protein, 10.0 g/dL; albumin, 3.3 g/dL; IgG, 3,800 mg/dL (reference range, 960-1,960), IgA, 12 mg/dL (reference range, 110-410), IgM, 11 mg/dL (reference range, 65-350), total bilirubin, 0.4mg/dL; AST, 12 U/L; ALT, 14 U/L; LD, 158 U/L (reference range, 120-245); urea nitrogen, 12 mg/dL; creatinine, 0.8 mg/dL; uric acid, 5.9 mg/dL; Na, 136 mEq/L; K, 4.0 mEq/L; Cl, 101 mEq/L; and Ca, 12.2 mg/dL. Immunological tests show CRP, 0.1 mg/dL. A protein electrophoresis photograph is shown separately. Which of the following treatments should be considered immediately? Select three.", "choices_en": ["Administration of G-CSF", "Opioid administration", "Albumin preparation administration", "Massive infusion of physiological saline solution", "Administration of bisphosphonate medication"], "answer": ["b", "d", "e"]}
{"problem_id": "116F59", "problem_text_en": "Read the following passage and answer the following question. A 42-year-old man was brought in by ambulance due to severe shortness of breath after being injured in a factory explosion. Present illness: He was injured in a factory explosion, and was transported to the hospital by ambulance. He got his right lower limb trapped in the collapsed machinery. He was rescued one hour after the injury and taken to the hospital. Past history: He had been healthy all his life. Lifestyle: He has been smoking 40 cigarettes per day for 22 years and drinking two cups of sake per day for 22 years. Family history: His father has hypertension and is undergoing treatment. Current symptoms: His consciousness level is JCS II-10. Height is 174 cm, weight is 78 kg. Body temperature is 37.2℃. Heart rate is 136/min, regular. Blood pressure is 80/60 mmHg. Respiratory rate is 32/min. SpO2 is 94% (with a reservoir mask at 10 L/min under oxygen administration). Hair and nasal hair are burned. The conjunctiva is pale, and no abnormalities are seen in the eyeball conjunctiva. The mucous membranes of the mouth and pharynx are covered with soot and are edematous. Hoarseness is observed. There is no neck vein distension. Deformation is observed in the right upper arm and right thigh. Active bleeding was significant from the open wound in the right thigh; therefore, hemostasis was performed using a tourniquet during pre-hospital care, and it has already been stopped. There are no abnormalities in heart sounds. There is no difference in breath sounds between the left and right sides, but wheezing is audible. The abdomen is flat and soft, and the liver and spleen are not palpable. Examination findings: Arterial blood gas analysis (with a reservoir mask at 10 L/min under oxygen administration): pH 7.30, PaCO2 30 Torr, PaO2 84 Torr, HCO3- 18 mEq/L. Carboxyhemoglobin concentration in the blood is 15% (normal: 1 or lower). Chest X-ray shows diffuse infiltration shadows on both sides. No abnormalities are found in the pelvic X-ray. The X-ray of the right thigh and right upper arm show fractures of the right femur and right humerus. Refer to the photos (①-⑤) separately. Which instrument should be used to secure the airway of this patient?", "choices_en": ["① (in Japanese) - This is not a word or phrase, but rather a symbol or character that is used in Japanese to indicate the number \"1\".", "This is not a word or phrase that can be translated without context. It appears to be a number or a symbol representing a choice in a multiple-choice question. Please provide more information or context.", "Sorry, I cannot translate the choice without more context. The number \"③\" by itself does not provide enough information. Please provide more context or information related to the multiple choice question.", "I'm sorry but ④ is a number or symbol and cannot be translated without context. Please provide more information or context so I can assist you better.", "It is not possible to translate ⑤ without additional context. It is simply a numbered choice and could represent any answer choice depending on the specific question it is associated with. Please provide more details to accurately translate it."], "answer": ["d"]}
{"problem_id": "116F60", "problem_text_en": "It was decided to perform a rapid bedside ultrasound examination after securing the airway. Which of the following areas is not appropriate for confirming bleeding?", "choices_en": ["Pericardium", "Perisplenic", "Rectovesical pouch", "Morrison's pouch (a space in the abdominal cavity)", "Pericolonic groove"], "answer": ["e"]}
{"problem_id": "116F61", "problem_text_en": "Thirty minutes have passed since admission, and the patient's vital signs have stabilized following initial trauma care. Reduction and fixation of the right femoral fracture and suturing of the right femoral artery were performed, and there was confirmation of hemostasis. Swelling was observed in the right thigh, with diffuse petechial bleeding and motor paralysis throughout the right leg. Palpation of the right dorsalis pedis artery was good. There was no motor paralysis or sensory disturbance observed in the left leg. Red urine was observed to be flowing from the urinary catheter. What is the most likely diagnosis?", "choices_en": ["Spinal cord injury", "Popliteal artery injury", "Avulsion injury", "Crush syndrome", "Degloving injury"], "answer": ["d"]}
{"problem_id": "116F62", "problem_text_en": "Read the following text and answer the question below.\n\nA 48-year-old woman was brought in by ambulance due to left abdominal pain. Current illness: three days ago, she fell at home and hit her left chest. She was diagnosed with left lower rib fracture at a clinic near her home and then returned home after being immobilized with a breast band. This morning, she suddenly developed left abdominal pain during a dog walk and also felt fatigued, so her husband called an ambulance. Past history: she had surgery for acute appendicitis at the age of 35. Personal history: She lives with her husband and teenage son. She does not smoke and drinks occasionally. Family history: Her mother is being treated for diabetes. Current status: Consciousness is clear. Height 160cm, weight 53kg. Body temperature: 37.0°C. Heart rate: 104/min, regular. Blood pressure: 110/62mmHg. Respiratory rate: 20/min. SpO2: 98% (room air). No abnormalities in the conjunctiva or eyeball. No abnormalities in heart sounds and breath sounds. Tenderness and muscular defensive reaction were found on the left side of the abdomen. No abnormalities in bowel sounds or gait. Examination findings: Urine: protein (-), glucose (-), occult blood (-), no red blood cells in sediment. Blood test results: red blood cells 3.85 million/mm³, Hb 11.4g/dL, Ht 34%, white blood cells 12,600/μL, and platelets 190,000/μL. Blood biochemistry data: Total protein 7.2g/dL, albumin 4.2g/dL, total bilirubin 0.6mg/dL, direct bilirubin 0.3mg/dL, AST 32U/L, ALT 20U/L, LD 230U/L (reference range 120-245), ALP 103U/L (reference range 38-113), blood urea nitrogen 20mg/dL, creatinine 0.8mg/dL, uric acid 5.4mg/dL, blood glucose 88mg/dL, Na 140mEq/L, K 4.5mEq/L, and Cl 105mEq/L. CRP: 0.1mg/dL. Chest X-ray showed no pleural effusion. Electrocardiogram (ECG) revealed sinus rhythm with a heart rate of 104/min and no ST-T changes. Abdominal ultrasound examination showed fluid accumulation in the left upper abdomen. Which test is most useful for determining the treatment plan?\n\nAnswer: Abdominal computed tomography (CT)", "choices_en": ["Abdominal paracentesis", "Abdominal MRI", "Abdominal contrast-enhanced CT scan", "Fluorodeoxyglucose-positron emission tomography", "99mTc scintigraphy"], "answer": ["c"]}
{"problem_id": "116F63", "problem_text_en": "Which of the following additional examinations has a lower priority at this point?", "choices_en": ["Blood type", "Blood culture", "Blood lactate", "Cross-matching test", "Prothrombin time"], "answer": ["b"]}
{"problem_id": "116F64", "problem_text_en": "The patient was hospitalized and closely monitored. The next day's vital signs were: body temperature 37.2°C, pulse rate 128/minute and regular, blood pressure 98/50 mmHg, and respiratory rate 20/minute. What are the appropriate responses at this point? Select two.", "choices_en": ["Blood cell count determination", "Splenectomy", "Abdominal ultrasound examination.", "Upper gastrointestinal endoscopy", "Intra-aortic balloon pumping (IABP)"], "answer": ["a", "c"]}
{"problem_id": "116F65", "problem_text_en": "Read the following text and answer the question below. A 59-year-old man was brought in by ambulance due to difficulty breathing. Present illness: a sudden onset of dyspnea occurred while he was at work. He did not complain of chest pain. He went home early and rested, but since the symptoms persisted, he requested an ambulance. Past medical history: he has been pointed out to have hypertension but has not received medication. Personal history: he works as a bank employee, has no smoking history, and drinks occasionally. Family history: there is nothing noteworthy. Current status: the patient is fully conscious. His facial expression is somewhat distressed. He is 167 cm tall and weighs 58 kg. His body temperature is 36.5℃. His heart rate is 108 beats per minute and regular. His blood pressure is 134/86 mmHg. His respiratory rate is 20 breaths per minute. His SpO2 is 99% (under oxygen administration at 5 L/min with a mask). No abnormality is detected in the conjunctiva or sclera of the eyes. No jugular vein distension is observed. Heart sounds show a III gallop and a holosystolic murmur, Levine grade 4/6, at the apex. Coarse crackles are heard in both lower chest areas. The abdomen is flat, soft, and non-tender. No hepatosplenomegaly is palpated. No lower leg edema is observed. Examination results: blood tests show red blood cell count of 4.42 million/mm3, Hb of 13.8 g/dL, Ht of 42%, white blood cell count of 7,300/mm3, and a platelet count of 200,000/mm3. Biochemical blood tests show LD 218 U/L (reference range: 120-245), CK 70 U/L (reference range: 30-140), BUN 19 mg/dL, creatinine 0.8 mg/dL, and blood glucose 158 mg/dL. The rapid troponin T test is negative. Chest X-ray shows pulmonary congestion. An electrocardiogram (A) and echocardiogram (B) are presented separately. In the echocardiogram, the ejection fraction of the left ventricle is 75%, with no regional wall motion abnormalities, but a fibrous structure is observed attached to the posterior mitral valve leaflet. What is the diagnosis?", "choices_en": ["Mitral stenosis", "Pulmonary valve stenosis", "Aortic valve stenosis", "Mitral valve regurgitation", "Aortic valve regurgitation"], "answer": ["d"]}
{"problem_id": "116F66", "problem_text_en": "What is the most likely cause of the valve disorder that has occurred in this patient?", "choices_en": ["Tendon rupture", "Papillary muscle rupture", "Atherosclerosis", "Marfan syndrome", "Infective endocarditis"], "answer": ["a"]}
{"problem_id": "116F67", "problem_text_en": "The patient is scheduled to undergo emergency surgery for valvular heart disease. Which interventions can be expected to improve the patient's hemodynamics prior to the surgery? Select two.", "choices_en": ["Administration of beta blockers", "Vasodilator administration", "Digitalis administration", "Implantation of an external pacemaker", "Insertion of intra-aortic balloon pumping (IABP)"], "answer": ["b", "e"]}
{"problem_id": "116F68", "problem_text_en": "Read the following paragraph and answer the question below. A 50-year-old woman presented to the hospital with a fever. Her medical history includes a diagnosis of colon cancer three months prior, for which she had undergone outpatient chemotherapy with a central venous port placed in the left subclavian vein. She had a fever with chills for the past three days, which prompted her to seek medical care. She has no significant medical history aside from the colon cancer diagnosis. She is independent with activities of daily living and lives with her husband. She has never smoked nor drank alcohol. Her mother died of breast cancer. On examination, she is conscious and alert with a height of 157 cm and a weight of 52 kg. Her temperature is 38.3 ℃, pulse rate is 102 beats per minute, regular, and blood pressure is 134/76 mmHg. Respiratory rate is 16 breaths per minute, and her oxygen saturation is 97% on room air. There is mild anemia in the conjunctiva palpebrarum, but no scleral icterus. No palpable thyroid or lymph nodes are observed. A holosystolic murmur grade 2/6 is heard at the apex of the heart, and there are no abnormal breath sounds. Her abdomen is flat, and liver and spleen are not palpable. There is no flank tenderness. No edema or tenderness is noted in the lower legs. . There is redness and pain at the left subclavian port site. Urinalysis shows no protein, glucose, or occult blood. Blood tests show a low red blood cell count of 3.6 million, Hb 8.5 g/dL, Ht 26%, and WBC 11,000 (84% neutrophils, 1% eosinophils, 1% basophils, 6% monocytes, and 8% lymphocytes). Platelet count is 180,000. Blood biochemistry shows total protein 6.0 g/dL, albumin 2.9 g/dL, total bilirubin 1.0 mg/dL, direct bilirubin 0.2 mg/dL, AST 42 U/L, ALT 58 U/L, and LD 321 U/L (normal range 120-245), and blood urea nitrogen 28 mg/dL, creatinine 1.0 mg/dL, glucose 98 mg/dL, Na 133 mEq/L, K 4.1 mEq/L, and Cl 97 mEq/L. CRP is 12 mg/dL. Echocardiography shows moderate mitral regurgitation. Multiple sets of blood cultures were obtained, and the central venous port was removed, and antibiotic treatment started. Gram-positive cocci that cluster like grapes were detected from both sets of blood cultures drawn on the day after admission. What is the most likely causative organism?", "choices_en": ["Clostridium perfringens", "Enterococcus faecalis", "Haemophilus influenzae", "Staphylococcus aureus", "Streptococcus mitis"], "answer": ["d"]}
{"problem_id": "116F69", "problem_text_en": "On the third day of hospitalization, the patient's fever persisted and they began to complain of difficulty breathing while lying down. A rash accompanied by pain also appeared on their toes. Which of the following tests should be performed next? Select two.", "choices_en": ["Head CT scan", "Blood culture", "Urinalysis", "Respiratory function test", "Echocardiography exam"], "answer": ["b", "e"]}
{"problem_id": "116F70", "problem_text_en": "Which of the following is incorrect regarding the reconstruction of a central venous port?", "choices_en": ["Perform the procedure after confirming negative blood cultures.", "Construct while avoiding the extracted site.", "Choose a site without obvious venous occlusion.", "Place the new central venous port after soaking it in antimicrobial agents.", "Verify the position using X-ray photographs after construction."], "answer": ["d"]}
{"problem_id": "116F71", "problem_text_en": "Read the following passage and answer the questions below. \nA 65-year-old woman came to the hospital after being found positive for fecal occult blood. Medical history: She visited the hospital for examination purposes after being found positive for fecal occult blood during a workplace health check-up. She has no awareness of abnormal bowel movements. History: She has been undergoing oral medication for hypertension since she was 55 years old, and insulin therapy for diabetes since she was 60 years old. Lifestyle: She works as a clerk and is doing telework from home. Family history: Her father underwent surgery for colorectal cancer at the age of 75. Current symptoms: Consciousness is clear. Height 155 cm, weight 48 kg. Body temperature 36.2℃. Pulse rate 60/min, regular. Blood pressure 120/84 mmHg. Respiratory rate 16/min. SpO2 96% (room air). No abnormalities were found in the palpebral conjunctiva and ocular conjunctiva. No cervical vein distension was observed. No cervical lymph nodes palpated. No abnormalities were found in heart sounds and breath sounds. The abdomen is flat and soft, and the liver and spleen are not palpable. No edema was observed in the extremities. Examination findings: Urine findings: Protein (−), glucose (−), ketone bodies (−), occult blood (−), no white blood cells observed in the sediment. Blood findings: Red blood cells 4.68 million, Hb 13.9 g/dL, Ht 42%, white blood cells 8,300 (segmented neutrophils 2%, band neutrophils 66%, eosinophils 1%, basophils 1%, monocytes 6%, lymphocytes 24%), platelets 210,000. Blood biochemistry findings: Total protein 7.5 g/dL, albumin 3.9 g/dL, total bilirubin 0.9 mg/dL, direct bilirubin 0.2 mg/dL, AST 26 U/L, ALT 28 U/L, LDH 104 U/L (reference range 120-245), ALP 102 U/L (reference range 38-113), γ-GTP 25 U/L (reference range 8-50), amylase 42 U/L (reference range 37-160), CK 42 U/L (reference range 30-140), blood urea nitrogen 12 mg/dL, creatinine 0.6 mg/dL, uric acid 6.9 mg/dL, blood glucose 98 mg/dL, HbA1c 7.2% (reference range 4.6-6.2), total cholesterol 226 mg/dL, triglycerides 110 mg/dL, HDL cholesterol 64 mg/dL, LDL cholesterol 126 mg/dL, Na 136 mEq/L, K 4.2 mEq/L, Cl 99 mEq/L, Ca 9.2 mg/dL, P 3.2 mg/dL, CRP 0.1 mg/dL. Progress: Sedatives were administered and a lower gastrointestinal endoscopy was planned. Which of the following should be done for this patient? Choose two.\n\n", "choices_en": ["Abdominal X-ray imaging on the day before the examination", "Stool occult blood test on the day before the examination", "Adjustment of insulin administration on the day of examination", "Adjustment of antihypertensive medication on the day of examination", "Laxative administration on the day after examination"], "answer": ["c", "d"]}
{"problem_id": "116F72", "problem_text_en": "Separately, a video/image of the lower gastrointestinal endoscopy is shown. Where is the lesion located?", "choices_en": ["Rectum", "Appendix", "Ascending colon", "Transverse colon", "Descending colon"], "answer": ["a"]}
{"problem_id": "116F73", "problem_text_en": "No obvious metastases were seen on abdominal contrast-enhanced CT. The patient was subsequently hospitalized and received treatment. A separate image of the lower gastrointestinal endoscopy taken during treatment is shown. What was done on this patient?", "choices_en": ["Endoscopic sclerotherapy", "Endoscopic foreign body removal procedure", "Endoscopic mucosal resection (EMR)", "Argon plasma coagulation", "Endoscopic submucosal dissection (ESD)"], "answer": ["e"]}
{"problem_id": "116F74", "problem_text_en": "The table shows the data from a case-control study investigating the preventive factors of disease A. The exposure level of the preventive factor is categorized into three levels. The values in the table indicate the number of individuals.\n\n\nCases (disease present)\nControls (disease absent)\n\n\nNo exposure\n50\n50\n\n\nLow exposure\n40\n70\n\n\nHigh exposure\n30\n80\n\nCalculate the odds ratio for \"high exposure\" compared to \"no exposure\" as the reference for disease A. Round the result to the nearest hundredth if the value has two or more decimal places. Answer: ①. 0.60 ②. 0.59", "choices_en": [], "answer": ["04"]}
{"problem_id": "116F75", "problem_text_en": "A 40-year-old multiparous woman (gravida 4, para 3) presented to the hospital at 14 weeks of gestation with lower abdominal pain and genital bleeding. An intra-vaginal examination revealed the presence of an embryonic sac and she was admitted to the hospital. Her abdominal pain worsened after admission and she delivered the fetus while still enclosed in the gestational sac. The weight of the fetus was 60g. Which combination of diagnosis and fetal death certificate is correct?", "choices_en": ["Early miscarriage --------- No need to submit a stillbirth report", "Early miscarriage --------- stillbirth notification required", "Late miscarriage --------- No stillbirth report required", "Late miscarriage --------- submission of a stillbirth report required", "Premature birth --------- No notification of stillbirth required", "Premature birth --------- Necessary to submit a stillbirth report"], "answer": ["d"]}
