{"problem_id": "116D1", "problem_text_en": "Which combination of factors requires administration of anti-D immunoglobulin after delivery in RhD-negative pregnant women?", "choices_en": ["Husband's blood type RhD (-), indirect Coombs test negative at 12 weeks of pregnancy, indirect Coombs test negative at 26 weeks of pregnancy, newborn's blood type RhD (-).", "Husband's blood type is RhD (+), indirect Coombs test negative at 12 weeks of pregnancy, indirect Coombs test negative at 26 weeks of pregnancy, baby's blood type is RhD (-) at birth.", "Husband's blood type is RhD (+), indirect Coombs test was negative at 12 weeks of pregnancy and at 26 weeks of pregnancy, and the baby's blood type was RhD (+) at birth.", "Husband's blood type is RhD (+), indirect Coombs test is negative at 12 weeks of pregnancy and positive at 26 weeks, newborn's blood type is RhD (+)", "Husband's blood type RhD (+), positive indirect Coombs test at 12 weeks of gestation, positive indirect Coombs test at 26 weeks of gestation, newborn's blood type RhD (+)"], "answer": ["c"]}
{"problem_id": "116D2", "problem_text_en": "Which statement made by a patient strongly suggests schizophrenia?", "choices_en": ["\"I am being controlled by radio waves\"", "\"Crawling with bugs\" (referring to stains on a wall)", "\"I am worried about having a seizure on the train.\"", "\"I get nervous in front of people and cannot speak as I want.\"", "\"I don't feel satisfied until I check several times if I have locked the door\""], "answer": ["a"]}
{"problem_id": "116D3", "problem_text_en": "Which classification of heart failure is defined by pulmonary artery wedge pressure and cardiac output (cardiac index)?", "choices_en": ["AHA (American Heart Association) heart failure stage classification", "Child classification", "Forrester classification", "Nohria-Stevenson classification", "NYHA functional classification of the heart"], "answer": ["c"]}
{"problem_id": "116D4", "problem_text_en": "Which of the following is the appropriate initial response when a patient with congenital adrenal hyperplasia on maintenance therapy develops a fever?", "choices_en": ["Fluid restriction", "Antibiotic administration", "Intravenous diuretic", "Increase in glucocorticoid dosage", "Glucose-insulin therapy"], "answer": ["d"]}
{"problem_id": "116D5", "problem_text_en": "Which of the following treatments is performed using upper gastrointestinal endoscopy?", "choices_en": ["Esophageal diverticulum", "Esophageal achalasia", "Esophageal candidiasis", "Hiatal hernia", "Non-Erosive Reflux Disease (NERD)"], "answer": ["b"]}
{"problem_id": "116D6", "problem_text_en": "Which of the following is not a cause of aortic aneurysm?", "choices_en": ["Syphilis", "Atherosclerosis", "Buerger's disease", "Takayasu arteritis", "Marfan syndrome"], "answer": ["c"]}
{"problem_id": "116D7", "problem_text_en": "Which test is most useful in distinguishing post-renal acute kidney injury from pre-renal or intrinsic acute kidney injury?", "choices_en": ["Renal biopsy", "Quantitative urine protein test", "Specific gravity measurement of urine", "Abdominal ultrasound examination", "Serum creatinine measurement"], "answer": ["d"]}
{"problem_id": "116D8", "problem_text_en": "Which of the following is an acute bacterial infection?", "choices_en": ["Leprosy", "Palmoplantar pustulosis", "Pustular psoriasis", "Suppurative Hidradenitis", "Impetigo contagiosa"], "answer": ["e"]}
{"problem_id": "116D9", "problem_text_en": "Which of the following is correct for adult femoral hernia?", "choices_en": ["Common in middle-aged men.", "Intussusception is rare.", "Surgical treatment is the principle.", "Accompanied by pain on the lateral side of the thigh.", "Escape from the cranial side of the inguinal ligament."], "answer": ["c"]}
{"problem_id": "116D10", "problem_text_en": "What is the most common cause of early miscarriage?", "choices_en": ["Uterine malformation", "Uterine fibroids", "Cervical insufficiency", "Chromosomal abnormality in embryos", "Antiphospholipid syndrome"], "answer": ["d"]}
{"problem_id": "116D11", "problem_text_en": "Which of the following symptoms suggest a possible retropharyngeal abscess in a child presenting with sore throat? Select two.\n\nNote: There is no selection to translate.", "choices_en": ["Hearing loss", "Nosebleed", "Rapid shallow breathing", "Facial paralysis", "Dysphagia"], "answer": ["c", "e"]}
{"problem_id": "116D12", "problem_text_en": "What are the causes of male infertility? Select three.", "choices_en": ["Epidemic parotitis in infancy and childhood (Mumps)", "Klinefelter syndrome", "Bilateral undescended testis", "Varicocele", "True phimosis"], "answer": ["b", "c", "d"]}
{"problem_id": "116D13", "problem_text_en": "Which of the following are used to determine the treatment strategy for prostate cancer? Select three.", "choices_en": ["PSA value", "TNM classification", "Gleason score", "Testosterone level", "International Prostate Symptom Score (IPSS)"], "answer": ["a", "b", "c"]}
{"problem_id": "116D14", "problem_text_en": "Which of the following are commonly observed in patients with pulmonary hypertension? Select three.", "choices_en": ["Arrhythmia", "Swelling of the feet", "Dilated Jugular vein", "Shortness of breath during exertion", "Attenuation of the second sound of the pulmonary artery"], "answer": ["b", "c", "d"]}
{"problem_id": "116D15", "problem_text_en": "Which of the following tests are useful for diagnosing urinary dysfunction? Select three.", "choices_en": ["Post-void residual measurement", "Uroflowmetry", "Renogram", "Abdominal ultrasound examination", "Nerve conduction study"], "answer": ["a", "b", "d"]}
{"problem_id": "116D16", "problem_text_en": "A 72-year-old man came to the hospital after being pointed out for abnormal shadows on his chest during lung cancer screening. The chest X-ray (A) and contrast-enhanced chest CT scan (B) are shown separately. What are the most likely symptoms that this patient has?", "choices_en": ["Hoarseness", "Arrhythmia", "Difficulty breathing", "Epigastric pain", "Cervical venous distention"], "answer": ["a"]}
{"problem_id": "116D17", "problem_text_en": "A man with the appearance of being around 40 years old was found crouching on the street and protected by a police officer. He was brought to the hospital because he said he did not know who he was. He had no belongings that could identify him. He could talk and spoke in a Kansai dialect, but had no memory of living in the Kansai region. There were no physical abnormalities on blood tests, brain imaging, and electroencephalography, and he had retained memories from after he was protected. What is the most likely characteristic seen in this patient?", "choices_en": ["Obsession with replacement ramen noodles", "Can perform basic actions such as buying a ticket.", "I am seriously worried about not having any memories.", "It is necessary to administer antipsychotic medication.", "It's an initial symptom of Alzheimer's type dementia."], "answer": ["b"]}
{"problem_id": "116D18", "problem_text_en": "A 77-year-old man visited the emergency department with chief complaints of chest pain and dizziness. He had been experiencing these symptoms since around 3 pm on the same day and arrived at the hospital at 8:50 pm with his family. A 12-lead electrocardiogram showed ventricular tachycardia, and his systolic blood pressure was in the 70 mmHg range. Electrical defibrillation was performed with 150 joules, which returned the rhythm to sinus without symptoms, and increased his systolic blood pressure to 120 mmHg. Blood tests revealed no electrolyte abnormalities, and no drugs that could cause arrhythmias were confirmed. Echocardiography showed no abnormalities, and emergency coronary angiography revealed no coronary artery lesions. Catheter ablation therapy is being considered in the future. Which of the following medications is not used in pharmacotherapy at the present time?", "choices_en": ["Alpha blocker", "Beta-blockers", "Class I antiarrhythmic drug", "Verapamil", "Diltiazem"], "answer": ["a"]}
{"problem_id": "116D19", "problem_text_en": "A 75-year-old man presented with dyspnea as his chief complaint. He had been aware of chronic cough and sputum production for 5 years but had ignored it. He began to feel short of breath when climbing stairs or doing light work one year ago. He visited the clinic because of increased dyspnea accompanying increased cough with sputum production, along with fever and sore throat, which began one week ago. His medical history is unremarkable. He has smoked 30 cigarettes per day for 45 years. At the time of his visit, his consciousness was clear, but he was still experiencing yellow sputum and a severe cough. He was observed to have pursed-lip breathing. His height was 165 cm, weight 50 kg, body temperature 37.4℃, pulse rate 84 beats per minute and regular, respiratory rate 21 per minute, and 87% SpO2 on room air. There were no abnormalities detected in his breath sounds. Which of the following is an inappropriate initial treatment for this patient?", "choices_en": ["Oxygen therapy", "Administration of antibiotics", "Administration of central cough suppressants", "Administration of adrenal cortex steroids", "Inhalation of short-acting β2 agonist"], "answer": ["c"]}
{"problem_id": "116D20", "problem_text_en": "A 32-year-old man presents with abdominal pain. He developed right lower abdominal pain yesterday, and came to the hospital for evaluation as it has not improved. He had appendectomy at the age of 18. His body temperature is 37.0°C, heart rate is 80 beats per minute and regular, and blood pressure is 132/80 mmHg. On examination, the abdomen is flat, with tenderness and mild rebound tenderness in the right lower quadrant. Bowel sounds are diminished. Laboratory findings reveal red blood cells 4.76 million/µL, Hb 15.3 g/dL, Hct 43%, white blood cells 12,400 (neutrophils 75%, eosinophils 1%, basophils 1%, monocytes 4%, lymphocytes 19%), and platelets 250,000/µL. Blood chemistry findings reveal AST 34 U/L, ALT 60 U/L, blood urea nitrogen 12 mg/dL, and creatinine 0.9 mg/dL. CRP is 3.6 mg/dL. Abdominal CT scan is shown separately. What is the most likely diagnosis based on the image findings?", "choices_en": ["Colorectal cancer", "Constipation", "Intestinal tuberculosis", "Ischemic enteritis", "Colon diverticulitis"], "answer": ["e"]}
{"problem_id": "116D21", "problem_text_en": "A 67-year-old man presents with recurrent fever. A heart murmur was noted during routine examination at 60 years of age. Further evaluation revealed moderate aortic valve regurgitation, and he had been regularly followed up. He visited the hospital due to repeated episodes of fever, around 38°C for seven weeks. He temporarily controls the fever by taking over-the-counter antipyretics but experiences recurrent fever. His consciousness is clear, body temperature is 37.6°C, pulse rate is 92/min and regular, blood pressure is 116/54 mmHg, respiratory rate is 20/min, and SpO2 is 94% on room air. Laboratory data show red blood cells of 4.52 million/μL, Hb of 12.4 g/dL, Hct of 36%, white blood cells of 14,800/μL (neutrophils 80%, eosinophils 1%, basophils 1%, monocytes 5%, and lymphocytes 13%), platelets of 150,000/μL, AST of 38 U/L, ALT of 36 U/L, BUN of 30 mg/dL, creatinine of 1.3 mg/dL, uric acid of 7.1 mg/dL, Na of 135 mEq/L, K of 4.6 mEq/L, Cl of 102 mEq/L, and CRP of 14 mg/dL. Transthoracic echocardiography showed aortic valve regurgitation and vegetations on the valve. Antibiotic treatment was initiated. Which of the following is not an indication for urgent aortic valve replacement in this patient's clinical course?", "choices_en": ["Complication of valve perforation", "Formation of peri-valvular abscess", "Comatose state following hemorrhagic stroke", "When warts increase and thrombosis is observed", "The onset of heart failure that is difficult to control medically"], "answer": ["c"]}
{"problem_id": "116D22", "problem_text_en": "A 68-year-old man came to the hospital because he was told by his family members that he talks in his sleep a lot at night. There is no significant medical or family history. According to his wife who came with him, he sometimes shouts loudly, or kicks her while lifting his leg while sleeping. There is no abnormality observed in his neurological examination, blood tests, blood biochemistry tests, or head MRI. What is the possible disease that he could have?", "choices_en": ["REM sleep behavior disorder", "Sleep apnea syndrome", "Lower extremity immobility syndrome", "Narcolepsy", "Night terror"], "answer": ["a"]}
{"problem_id": "116D23", "problem_text_en": "A 46-year-old female presented for further examination due to an abnormality detected on a chest X-ray during a workplace health screening. She has no symptoms and no smoking history but drinks alcohol occasionally. She is alert and oriented. Her height is 161cm and weight is 49kg. Her pulse is 72/min and regular, blood pressure is 132/80 mmHg, and SpO2 is 97% on room air. Lung and heart sounds are normal. Laboratory findings include RBC 4.28 million, Hb 12.1 g/dL, Ht 37%, WBC 3,700, and platelets 190,000. Biochemical examination results include a total protein of 7.2 g/dL, albumin of 4.1 g/dL, creatinine of 0.6 mg/dL, and HbA1c of 5.8% (reference range 4.6 to 6.2%). Based on a nodular shadow (indicated by an arrow) in the left lower lung field on chest X-ray (A), hospitalization was planned for further examination. Select the condition that is unlikely to be complicated by this disease. Additionally, selective pulmonary arteriography (B) and chest CT (C) are separately shown.", "choices_en": ["Hemoptysis", "Cerebral infarction (stroke)", "Brain abscess", "Uveitis", "Infective endocarditis"], "answer": ["d"]}
{"problem_id": "116D24", "problem_text_en": "A 68-year-old man presents with back pain as his chief complaint. Three months ago, he was diagnosed with pancreatic cancer involving the tail of the pancreas with liver metastases but had not continued treatment due to lack of desire for it. He presented now because of increasing back pain over the last 2 weeks. The pain is a constant dull ache and has been preventing him from sleeping. He spends most of his day lying down at home, eating a small amount of rice porridge, and has lost 2 kg in the last month. He has no significant medical history. He has never smoked and has been drinking one cup of sake per day for 40 years. He lives alone, he is 168 cm tall and weighs 48 kg. His pulse rate is 72 beats/minute and regular. His blood pressure is 126/60 mmHg. His respiratory rate is 14/minute. On examination, there is an irregular mass measuring 10 cm in diameter palpable in the midline of the upper abdomen. Bowel sounds are decreased. Laboratory studies reveal: red blood cells 3.34 million/μl, Hb 10.8 g/dL, Hct 31%, white blood cell count 9,800/μl, and platelets 140,000/μl. Blood chemistry tests reveal: total protein 5.6 g/dL, albumin 2.8 g/dL, total bilirubin 2.4 mg/dL, AST 134 U/L, ALT 140 U/L, γ-GT 124 U/L (normal range: 8-50), blood urea nitrogen 19 mg/dL, serum creatinine 0.4 mg/dL, CEA 16.4 ng/mL (normal range: <5), and CA19-9 580 U/mL (normal range: <37). The patient expresses a desire to remain at home if possible. Which of the following is the appropriate option for pain management with analgesic drugs in the future?", "choices_en": ["Patch medication cannot be used.", "Administer only when experiencing pain.", "Begin administration from injectable medication.", "Adjust the dosage according to the pain condition.", "Rescue uses long-acting drugs."], "answer": ["d"]}
{"problem_id": "116D25", "problem_text_en": "An 84-year-old man is hospitalized for evaluation of gastric cancer. Upon admission, a subcutaneous hematoma was noted on the left forearm, which has since spread from the left lateral chest and flank area to thigh. He has no history of bleeding symptoms and there is no significant family history. He is alert and oriented. His body temperature is 36.8℃, pulse rate is 110/min and regular, and blood pressure is 100/60 mmHg. The conjunctivae are pale but there is no jaundice of the sclerae. A Levine 2/6 holosystolic ejection murmur is audible at the second right cartilage margin. Lung sounds are normal. His abdomen is flat and there is tenderness in the epigastric region. The liver and spleen are not palpable. Subcutaneous hematomas and petechiae are scattered throughout his limbs and trunk. Laboratory findings show red blood cells of 2.98 million/μL, Hb of 7.2 g/dL, Ht of 23%, white blood cells of 7,400/μL, platelets of 330,000/μL, bleeding time of 3 min 30 sec (normal, less than 7 min), PT-INR of 1.0 (normal, 0.9–1.1), APTT of 70.4 sec (normal, control: 32.2 sec), plasma fibrinogen of 398 mg/dL (normal, 186–355), and serum FDP of 5 μg/mL (normal, less than 10). What is the most likely diagnosis?", "choices_en": ["Acquired hemophilia", "Vitamin K deficiency", "von Willebrand disease", "Antiphospholipid antibody syndrome", "Disseminated intravascular coagulation (DIC)"], "answer": ["a"]}
{"problem_id": "116D26", "problem_text_en": "A 39-year-old man complains of double vision. He sometimes sees a double center line during long periods of truck driving. His visual acuity is 1.2 in both eyes without correction, and no abnormalities are observed in the anterior and posterior segments of the eyes. Cover testing using a penlight and occluding paddle reveals the right eye movement shown in the figure. The left eye also shows a similar movement with occlusion. Which of the following explanations for this pathology is correct?", "choices_en": ["Caused by farsightedness.", "Caused by an intracranial lesion.", "Accompanied by oculomotor nerve paralysis.", "Observed in intermittent exotropia.", "There is an inward gaze deviation during occlusion."], "answer": ["d"]}
{"problem_id": "116D27", "problem_text_en": "A 64-year-old man presented with swelling, redness, and pain in the scrotum. He had noticed swelling and redness of the scrotum 5 days ago, but visited the hospital 2 days ago when the area rapidly expanded and the pain became severe. He is currently receiving oral medication for diabetes. He is alert and conscious, has a body temperature of 38.6℃, a pulse rate of 104 bpm, regular blood pressure at 96/57 mmHg, and a respiratory rate of 20 bpm. Palpation reveals hardness spreading from the scrotum to the perineum and anal area. Hemoglobin is 12.2 g/dL, the hematocrit is 36%, the white blood cell count is 15,800, and the platelet count is 140,000. Blood chemistry revealed total bilirubin at 1.0 mg/dL, AST at 63 U/L, ALT at 32 U/L, LD at 302 U/L (normal range 120-245), γ-GT at 47 U/L (normal range 8-50), CK at 290 U/L (normal range 30-140), blood urea nitrogen at 25 mg/dL, creatinine at 1.0 mg/dL, blood sugar at 230 mg/dL, and HbA1c at 8.2% (normal range 4.6-6.2). Which test should be performed first?", "choices_en": ["Stool culture", "Lower gastrointestinal endoscopy", "Continuous glucose monitoring", "Gallium scintigraphy", "CT scan of pelvis to thigh"], "answer": ["e"]}
{"problem_id": "116D28", "problem_text_en": "A 3-year-old boy was found coughing and looking unwell in the living room by his mother, who took him to the emergency room. He was conscious and not crying. According to the mother, there were ashtrays and cigarette butts around the child, and coins such as 1 yen and 10 yen were scattered with his wallet. Which of the following information is of low usefulness in determining treatment for ingestion?", "choices_en": ["\"Did you make them vomit?\"", "\"Did you give them water to drink?\"", "\"Was something inside your mouth?\"", "\"How much time has passed?\"", "\"Has something like this happened before?\""], "answer": ["e"]}
{"problem_id": "116D29", "problem_text_en": "A 64-year-old man presented with a chief complaint of tongue tumor. He noticed pain on the left side of his tongue and pharynx one week ago. There is no notable medical history, no smoking history, and he drinks 350mL of beer once a week. No palpable lymph nodes are found in his neck. Biopsy revealed squamous cell carcinoma. Oral endoscopy (A) and contrast-enhanced MRI of the head and neck region (B) are shown separately. FDG-PET shows no evidence of distant metastasis. What should be the first step in managing this patient?", "choices_en": ["Surgical treatment", "Particle radiation therapy", "Permanent tracheostomy", "Percutaneous gastrostomy", "Anti-cancer treatment using medication"], "answer": ["a"]}
{"problem_id": "116D30", "problem_text_en": "A 62-year-old female patient comes to the hospital complaining of fever and cough. She has been aware of a slight increase in fever and cough for the past 2 months, which has gradually worsened, and she has lost 5 kg in weight in 2 months. Ten years ago, she was told that she might have diabetes during a health checkup but has not visited a medical institution since then. She is alert and conscious. She has a height of 156 cm and weighs 40 kg. Her body temperature is 37.3°C, pulse rate is 84 bpm and regular, blood pressure is 124/82 mmHg, and respiratory rate is 16/min. Her SpO2 is 98% on room air, and no abnormalities are noted in her heart sounds. Coarse crackles are heard bilaterally in the lung fields. Chest X-ray (A) and chest contrast CT (B) at the time of admission are shown separately. Which is the most important infection prevention measure during the outpatient examination?", "choices_en": ["Examination in a negative pressure room.", "Single-use of a stethoscope", "Wearing a water-resistant gown", "Wearing a surgical mask", "Examination conducted by staff who have received measles vaccinations"], "answer": ["a"]}
{"problem_id": "116D31", "problem_text_en": "A 52-year-old woman presented with a chief complaint of decreased vision. She had tinnitus and headaches for three days and her vision had worsened in both eyes since yesterday. Her visual acuity was 0.02 in her right eye (0.05 x +2.5D) and 0.02 in her left eye (0.06 x +1.75D). The intraocular pressure was 12 mmHg in the right eye and 13 mmHg in the left eye. Fundus photograph of the right eye (A), fluorescein angiography photograph of the right eye (B), and optical coherence tomography (OCT) image of the macula (C) are separately shown. The same findings were observed in the left eye. What is the useful examination for the definitive diagnosis?", "choices_en": ["Positive reaction to a skin prick test", "Cerebrospinal fluid examination", "Patch test", "Tuberculin skin test", "Chest X-ray examination"], "answer": ["b"]}
{"problem_id": "116D32", "problem_text_en": "A 30-year-old man presented with a chief complaint of cough and shortness of breath on exertion. The cough had started 14 days before and had gradually worsened. He sought medical attention because it had become associated with shortness of breath on exertion. He had traveled frequently to Southeast Asia for business over the past 7 years. His body temperature was 36.5°C, pulse rate was regular at 80/minute, blood pressure was 118/78 mmHg, and respiratory rate was 24/minute; his room air oxygen saturation was 91%. Fine crackles were heard bilaterally at the lung bases. Laboratory findings showed red blood cell count of 4.14 million/μL, hemoglobin level of 12.7 g/dL, hematocrit level of 25%, white blood cell count of 13,700/μL (92% neutrophils, 3% monocytes, 5% lymphocytes), and platelet count of 370,000/μL. Immunological examination showed a CRP level of 0.4 mg/dL and a β-D-glucan level of 185 pg/mL (reference value, ≤10). Chest radiograph (A), chest computed tomography under lung conditions (B), and Grocott staining of bronchoalveolar lavage fluid (C) are separately shown. What is the appropriate treatment?", "choices_en": ["Oral administration of ST-segment elevation drugs", "Intravenous infusion of Meropenem", "Intravenous drip infusion of voriconazole", "Intravenous infusion of levofloxacin", "Oral administration of amoxicillin/clavulanic acid"], "answer": ["a"]}
{"problem_id": "116D33", "problem_text_en": "A 2-month-old female infant is brought in by ambulance due to sudden loss of consciousness. She was born at 40 weeks' gestation with a birth weight of 3,300 g and has been breastfed since birth. She had poor breastfeeding in the afternoon but was sleeping as usual, and when her mother tried to breastfeed her, she had a convulsion and became limp. Her mother called for an ambulance. The infant is 56 cm tall and weighs 4.8 kg. Her body temperature is 36.8°C. Her pulse rate is 160/min and regular, her blood pressure is 90/52 mmHg, her respiratory rate is 36/min, and her SpO2 is 98% (under a mask with 5 L/min oxygen). The fontanelle is bulging. Bilateral pupillary reflexes are delayed. The liver is palpable 6 cm below the right costal arch. Blood tests show 4.5 million red blood cells, Hb 9.5 g/dL, Hct 36%, WBC 10,800, platelets 250,000, PT-INR 4.2 (reference range 0.9-1.1), APTT 45.4 seconds (reference range 32.2), total protein 5.4 g/dL, albumin 3.3 g/dL, total bilirubin 11.0 mg/dL, direct bilirubin 6.8 mg/dL, AST 130 U/L, ALT 74 U/L, ALP 203 U/L (reference range 114-339 U/L), and γ-GT 410 U/L (reference range 8-50 U/L), and blood sugar of 90 mg/dL. CRP is 0.1 mg/dL. A head CT is shown separately. What is the immediate treatment that should be performed?", "choices_en": ["Iron infusion", "Oral administration of vitamin K", "Normal saline infusion", "Fresh frozen plasma transfusion", "Hematoma removal by craniotomy"], "answer": ["d"]}
{"problem_id": "116D34", "problem_text_en": "A 59-year-old woman presents with gait disturbance as the chief complaint. She has been experiencing dizziness and staggering during walking, which caused her to frequently bump into walls, for the last 6 months. She has also been suffering from severe constipation and urinary incontinence around the same time. The gait disturbance has gradually worsened, and she fell one week ago. Recently, she has also had difficulty using chopsticks. She has no significant medical or family history. Her blood pressure is 110/70 mmHg and heart rate is 60 beats per minute in supine position. Two minutes after standing, her blood pressure is 80/60 mmHg and heart rate is 62 beats per minute. There are no abnormalities in heart sounds or respiratory sounds, chest and abdominal examinations. Neurological examinations reveal dysarthria. Bilateral measurement difficulty is observed with the finger-nose-finger examination of the upper limbs, and transformation movement disorder is also identified in the pronation-supination test. Both sides of the limbs show equivalent muscle stiffness, but no tremors are observed. Body trunk sway is observed during walking. What is the possible disease?", "choices_en": ["Parkinson's disease.", "Multiple system atrophy", "Huntington's disease", "Amyotrophic lateral sclerosis (ALS)", "Cortico-basal ganglionic degeneration (CBGD)"], "answer": ["b"]}
{"problem_id": "116D35", "problem_text_en": "A 38-year-old woman presents with a chief complaint of cough. Dry cough has been present for three weeks and has not improved. The cough is worse during the day while she's at work, but improves at night. The patient has never been diagnosed with asthma, but has a history of hay fever since age 18. She has been working part-time, five days a week, at a bakery for a year. When she's at home on weekends, she has no symptoms during the day. However, on Mondays when she returns to work, she develops a cough. The patient has never smoked and doesn't own any pets. Her temperature is 35.2℃, her respiratory rate is 16/min, and her SpO2 is 96% (room air). Lung sounds are normal. Blood tests reveal RBC 3.6 million, Hb 11.4 g/dL, WBC 5,700 (segmented neutrophils 56%, eosinophils 12%, basophils 0%, lymphocytes 32%), and platelets 320,000. CRP is 0.2 mg/dL. Chest X-ray is normal. Which of the following tests, useful for diagnosis, is incorrect in this case?", "choices_en": ["Pulmonary diffusion testing", "Airway hyperresponsiveness test", "Specific IgE antibody", "Reversible airway test", "Peak flow diurnal variation"], "answer": ["a"]}
{"problem_id": "116D36", "problem_text_en": "A 62-year-old woman presented with a chief complaint of discomfort in her right breast. A palpable mass with a diameter of approximately 4 cm was detected upon physical examination. The surface of the mass was uneven and the texture was hard with poor mobility, but no tenderness was observed upon pressure. There was no secretion from the nipple. A mammogram (oblique view) is also shown. What is the most likely condition?", "choices_en": ["Breast cancer.", "Mastitis", "Follicular tumor", "Breast fat necrosis", "Fibroadenoma of the breast"], "answer": ["a"]}
{"problem_id": "116D37", "problem_text_en": "A 67-year-old man presented with dysphagia for the past two months and a weight loss of 6 kg during that period. Upper gastrointestinal endoscopy and pathological examination revealed squamous cell carcinoma in the upper thoracic esophagus. Concurrent chemoradiotherapy was performed, but after the treatment, he began to have repeated episodes of pneumonia. Separate chest CT scans were obtained before and after treatment. What is the likely cause of pneumonia in this patient?", "choices_en": ["Recurrence of mediastinal lymph nodes", "Local recurrence of esophageal cancer", "Tracheoesophageal fistula", "Esophageal stenosis/narrowing", "Mediastinitis"], "answer": ["c"]}
{"problem_id": "116D38", "problem_text_en": "A 6-month-old girl is brought to the hospital by her mother because she is not moving her left leg. Two days prior, she had a fever in the high 38℃ range, and was diagnosed with pharyngitis at a nearby clinic and prescribed acetaminophen suppositories. The following day, her mother noticed that the baby cried intensely when her diaper was changed. No abnormalities were noted in the neonatal period. The child's height is 68 cm, weight is 7.2 kg, body temperature is 37.8℃, pulse rate is 132/min (regular), blood pressure is 96/68 mmHg, and respiratory rate is 14/min. There is no automatic movement in the left leg, and the baby cries when the left hip joint is moved by someone else. There is limited range of motion in the right hip. Blood tests show red blood cells at 4.5 million, Hb at 12.0 g/dL, Ht at 38%, WBC at 12,600 (neutrophils; segmented 80%, band 4%, eosinophils 1%, basophils 1%, monocytes 5%, lymphocytes 10%), and platelets at 260,000. The CRP level is 15 mg/dL. Gram-positive cocci are detected in the joint fluid obtained by aspiration of the left hip joint. What is the appropriate treatment?", "choices_en": ["Oral administration of NSAIDs (nonsteroidal anti-inflammatory drugs)", "Left hip joint incision and lavage", "Bilateral overhead traction of the lower limbs", "Wearing a Rheinberg or Limburg's inter-pupillary pupillary distance measuring appliance.", "Intra-articular administration of adrenal cortical steroid into the left hip joint."], "answer": ["b"]}
{"problem_id": "116D39", "problem_text_en": "A 28-year-old woman complains of visible hematuria. She was first pointed out to have hematuria during a university entrance exam at age 19, but left it unattended. Three days ago, she noticed that her urine was darker than usual and came for a consultation after watching the progression. The patient's mother died of subarachnoid hemorrhage 3 years ago. Her brother, maternal grandmother, and uncle all receive dialysis, and all of them developed renal impairment as adults. There are no palpable superficial lymph nodes, and no abnormalities are apparent in the chest. A lump is palpable on both sides of her flank. Urinalysis shows negative for protein, positive for occult blood 3+, more than 100 RBCs/HPF in the urine sediment, 0-2 WBCs/HPF, and no casts. Blood chemistry test shows total protein of 6.0g/dL, albumin 4.0g/dL, urea nitrogen 30mg/dL, creatinine 2.5mg/dL, eGFR 20.2mL/min/1.73m2, Na 142mEq/L, K 5.1mEq/L, and Cl 101mEq/L. Abdominal MRI shows both kidneys to be enlarged with multiple cysts. The patient has a 17-year-old brother who has never received a medical examination and shows no symptoms. What is the probability that the patient's brother has the same condition?", "choices_en": ["0%", "25%", "33% (thirty-three percent)", "50 percent", "1"], "answer": ["d"]}
{"problem_id": "116D40", "problem_text_en": "A 53-year-old man has had poorly controlled asthma for three years, with frequent exacerbations and repeated episodes of pneumonia. He was referred to the hospital because of poor response to antibiotics for pneumonia diagnosed two weeks ago in a nearby medical institution. He has been treated for bronchial asthma since he was two years old. He is 168 cm tall, weighs 64 kg, and has a body temperature of 36.4 ℃. His pulse rate is 68 bpm and regular, and his blood pressure is 118/68 mmHg. He has wheezing on both sides of the lung fields. Blood tests on admission showed: 4.65 million red blood cells, hemoglobin 12.8 g/dL, hematocrit 39%, white blood cells 13,100 (neutrophils 51%, eosinophils 27%, basophils 2%, lymphocytes 20%), and 270,000 platelets. Biochemical blood tests showed: total bilirubin 0.6 mg/dL, AST 22 U/L, ALT 27 U/L, LD 150 U/L (normal range 120-245), ALP 46 U/L (normal range 38-113), γ-GT 36 U/L (normal range 8-50), blood urea nitrogen 8.5 mg/dL, creatinine 0.7 mg/dL, and IgE 2,540 IU/mL. Immunological blood tests showed: CRP 0.2 mg/dL, positive Aspergillus precipitating antibody, and β-D-glucan 120 pg/mL (normal range 10 or less), and Aspergillus fumigatus was detected in sputum culture. What is the appropriate treatment for this patient?", "choices_en": ["Cyclosporine", "Cephalosporin antibiotics", "High-dose inhaled steroids", "Oral corticosteroids", "Aspergillus desensitization therapy"], "answer": ["d"]}
{"problem_id": "116D41", "problem_text_en": "A 52-year-old man was found to have a renal tumor on ultrasound during a medical check-up and presented for examination. He is conscious and alert. He is 172 cm tall, weighs 76 kg, and has a body temperature of 36.5°C. His pulse rate is 72 beats per minute and regular, and his blood pressure is 128/82 mmHg. His abdomen is flat and the tumor cannot be palpated. Urinalysis shows protein (-), glucose (-), ketones (-), occult blood (+), and no abnormalities in sediment. His blood tests show red blood cells 5.51 million/uL, Hb 14.8 g/dL, Hct 45%, WBC 5,600/uL, and platelets 220,000/uL. His blood chemistry shows total protein 7.3 g/dL, albumin 4.8 g/dL, total bilirubin 0.9 mg/dL, AST 18 U/L, ALT 24 U/L, LD 179 U/L (reference range 120-245), urea nitrogen 11 mg/dL, creatinine 0.9 mg/dL, uric acid 4.9 mg/dL, blood glucose 103 mg/dL, Na 143 mEq/L, K 4.2 mEq/L, Cl 105 mEq/L, and Ca 9.1 mg/dL. A contrast-enhanced CT scan of the abdomen is shown separately. There are no abnormalities on chest CT or bone scintigraphy. Which of the following is the most appropriate treatment?", "choices_en": ["Bactericidal agent", "Partial nephrectomy", "Total nephroureterectomy", "Microwave coagulation therapy", "Immune checkpoint inhibitors"], "answer": ["b"]}
{"problem_id": "116D42", "problem_text_en": "A 48-year-old woman presented with complaints of muscle weakness in both lower extremities. She had experienced reduced vision in her right eye a year earlier and had been treated by an ophthalmologist with improvement in symptoms. Three days ago, she noticed weakness and numbness in both legs. These symptoms gradually worsened and she had difficulty getting up from bed this morning, so her husband called an ambulance, and she was admitted to the hospital. She was alert and fully conscious. Blood pressure was 112/64 mmHg. Pulse was regular at 80 beats per minute. Chest and abdominal examinations were unremarkable. Neurological examination showed no abnormalities in the cranial nerve area. There was no paralysis in the upper extremities and the tendon reflex was normal. Muscle strength of both proximal and distal muscles of the lower extremities was reduced to a grade of 2 on manual muscle testing. Tendon reflexes in the lower extremities were hyperactive and Babinski's reflex was positive bilaterally. Hypoalgesia was observed below the sternal margin. Blood tests and blood biochemistry tests were normal. Cerebrospinal fluid (CSF) analysis showed a cell count of 69/mm3 (60 polymorphonuclear leukocytes, 9 mononuclear cells) (normal range 0-2), protein of 62 mg/dL (normal range 15-45), and glucose of 62 mg/dL. The T2-weighted sagittal image (A) and horizontal image (B) of the thoracic MRI are shown separately. What is the most appropriate diagnosis?", "choices_en": ["Myeloperoxidase-antineutrophil cytoplasmic antibody (MPO-ANCA)", "Anti-aquaporin 4 antibody", "Anti-ganglioside antibodies", "Anti-muscle-specific tyrosine kinase antibody (anti-MuSK antibody)", "Anti-amino acyl tRNA synthetase antibody (anti-ARS antibody)"], "answer": ["b"]}
{"problem_id": "116D43", "problem_text_en": "A 55-year-old man came to the hospital today with a fever, palpitations, and swelling and pain in the anterior neck, which appeared since yesterday. He had a sore throat a week ago and had been taking cold medicine. His body temperature is 37.6℃, pulse rate 96 beats/min and regular, blood pressure 132/78 mmHg. No enlargement is observed in cervical lymph nodes, but the thyroid gland is diffusely enlarged and tenderness is noted in the right lobe. Blood test results: TSH 0.1 μU/mL (reference range 0.2-4.0), FT4 2.7 ng/dL (reference range 0.8-2.2), CRP 8.4 mg/dL. What is the most likely diagnosis?", "choices_en": ["Graves' disease", "Plummer's disease", "Chronic thyroiditis", "Subacute thyroiditis", "Acute suppurative thyroiditis"], "answer": ["d"]}
{"problem_id": "116D44", "problem_text_en": "A 53-year-old woman presented with rash and fever. She developed a rash on her fingers a month ago. She visited the clinic because of intermittent fever that had persisted in the high 38 °C range for two weeks. Her temperature was 37.8 °C, pulse rate 92 beats per minute regular, blood pressure 118/78 mmHg, respiratory rate 18 breaths per minute, and SpO2 97% on room air. There were no abnormal findings on the oral mucosa or in the heart sounds. Fine crackles were heard in both lungs. The muscle strength was not decreased. A rash was observed on her fingers, and erythematous lesions on the posterior cervical area, both upper scapulae, and both elbow joints were observed. Her urine test results were normal. Hematological examination revealed red blood cells 3.93 million/μL, hemoglobin 11.7 g/dL, hematocrit 35%, white blood cells 5,400 (neutrophils 5%, bands 76%, eosinophils 1%, monocytes 7%, lymphocytes 11%), and platelets 310,000/μL. Hematological chemistry findings were total protein 7.1 g/dL, albumin 3.4 g/dL, aspartate aminotransferase 31 U/L, alanine aminotransferase 21 U/L, lactate dehydrogenase 390 U/L, creatine kinase 75 U/L, and creatinine 0.6 mg/dL. Immunological examination findings were C-reactive protein (CRP) 0.8 mg/dL, β-D-glucan 4.0 pg/mL (normal <10), ferritin 875 ng/mL (normal 20-120), Krebs von den Lungen-6 (KL-6) 520 U/mL (normal <500), surfactant protein-D 115 ng/mL (normal <110), antinuclear antibody 40 times (normal <20), anti-Mi-2 antibody negative, anti-MDA5 antibody positive, and anti-TIF1-γ antibody negative. What is the most concerning complication to watch out for in this patient?", "choices_en": ["Heart failure", "Malignant tumor/cancer", "Dysphagia", "Interstitial pneumonia", "Pulmonary hypertension"], "answer": ["d"]}
{"problem_id": "116D45", "problem_text_en": "A 69-year-old woman came to the hospital to consult about the management of IgA nephropathy. She was diagnosed with IgA nephropathy at 42 years old and has been receiving regular checkups at a nearby clinic since then. She has been taking calcium channel blocker due to hypertension diagnosed at the age of 50. She receives regular nutrition guidance and her recent dietary survey showed a daily salt intake of 5.5 g and a daily protein intake of 35 g. She has no smoking history. She drinks 2 glasses of red wine per day, twice a week. She walks in a swimming pool for about 30 minutes, three times a week. She is 160 cm tall and weighs 55 kg. Her pulse rate is 72 beats per minute and regular. Her blood pressure is 140/70 mmHg. No abnormality is found in chest and abdomen. No swelling is observed in both lower legs. Urinalysis shows protein 2+, occult blood 2+, urine protein/creatinine ratio is 1.2 g/gCr (normal value <0.15), with 8-12 red blood cells, 1-2 white blood cells, and a few granular casts seen in the sediment. Blood test reveals a total protein of 6.0 g/dL, albumin of 4.0 g/dL, blood urea nitrogen of 18 mg/dL, creatinine of 0.7 mg/dL, estimated glomerular filtration rate of 62.8 mL/min/1.73m2, sodium of 142 mEq/L, potassium of 4.2 mEq/L, and chloride of 100 mEq/L. Which of the following is the first step to suppress this patient's renal function decline?", "choices_en": ["Abstinence from alcohol.", "Limitation of physical activity", "Addition of diuretic medication", "Doubling protein intake", "Addition of renin-angiotensin system inhibitors"], "answer": ["e"]}
{"problem_id": "116D46", "problem_text_en": "A 72-year-old man presented to the hospital with sudden severe headache and rapid bilateral vision loss. He is alert and conscious, with a height of 169cm, weight of 69kg, and a temperature of 36.8℃. His pulse rate is 80 beats per minute and regular, and his blood pressure is 154/92 mmHg. There is no limb paralysis. The coronal (A) and sagittal (B) views of a head CT scan are shown. What is the appropriate treatment?", "choices_en": ["Endovascular therapy", "Decompression craniotomy", "Transsphenoidal surgery", "Open craniotomy with clipping of aneurysm.", "Lumbar puncture (cerebrospinal fluid drainage)"], "answer": ["c"]}
{"problem_id": "116D47", "problem_text_en": "A 5-month-old boy has been constipated for several days and his milk intake has decreased since this morning, so his mother brought him to the hospital. He had no abnormalities during the perinatal period, and his growth and development were good until the 4-month health checkup. He is exclusively breastfed, but has been given honey recently. At the time of the visit, he made eye contact, but had a poor facial expression, and showed ptosis and mydriasis. Pupillary light reflexes were delayed bilaterally. He had difficulty maintaining a neck posture and his limb tendon reflexes were absent. What is the most likely condition in the patient?", "choices_en": ["Cerebral palsy", "Severe myasthenia gravis", "Botulism", "Congenital myopathy", "Werdnig-Hoffmann disease"], "answer": ["c"]}
{"problem_id": "116D48", "problem_text_en": "An 85-year-old man is hospitalized with pneumococcal meningitis. Since his overall condition has deteriorated, a urinary catheter has been placed. He was agitated last night and disturbed the urinary catheter. He has a history of right hip joint replacement surgery. His vital signs are: temperature 36.8℃, pulse rate 76/min, blood pressure 120/80 mmHg, respiratory rate 16/min, and SpO2 98% on room air. He has bleeding from the external urethral meatus, and it has been found that no urine has been drained into the urine collection bag attached to the urinary catheter. Abdominal CT sagittal image (A) and coronal image (B) are shown separately. What is the appropriate first step in managing this patient?", "choices_en": ["Insert a urinary catheter.", "To kink the urethral catheter.", "Remove the water used to fix the urinary catheter.", "Insert another catheter into the lumen of the urethral catheter.", "To remove the urinary catheter by pulling it out directly."], "answer": ["c"]}
{"problem_id": "116D49", "problem_text_en": "A 77-year-old woman was transported by ambulance due to impaired consciousness. She was residing in a nursing home for the elderly. Three days ago, her forgetfulness had worsened and she no longer knew where she was. According to information provided by the facility staff, she had received treatment for non-Hodgkin lymphoma at a medical institution near her home until one year ago, and was told that she had “cured.” However, since entering the facility, she had not been attending medical appointments because it was located far from the facility. She responds to calls but is in a drowsy state. There is no urinary incontinence. Her body temperature is 37.2°C. Her heart rate is 96 beats/min and regular. Her blood pressure is 96/62 mm Hg, and respiratory rate is 14 breaths/min. Her SpO2 is 96% (room air). Laboratory findings: Red blood cell count 3.98 million/μL, hemoglobin 12.5 g/dL, hematocrit 40%, white blood cell count 6,300/μL, platelet count 160,000/μL, prothrombin time-international normalized ratio (PT-INR) 2.1 (reference range 0.9-1.1), fibrin/fibrinogen degradation product (FDP) 25 μg/mL (reference range ≤10), total protein 6.4 g/dL, albumin 3.5 g/dL, total bilirubin 3.2 mg/dL, direct bilirubin 1.8 mg/dL, aspartate aminotransferase (AST) 3,956 U/L, alanine aminotransferase (ALT) 2,824 U/L, lactate dehydrogenase (LD) 986 U/L (reference range 120-245), alkaline phosphatase (ALP) 158 U/L (reference range 38-113), gamma-glutamyltransferase (γ-GT) 686 U/L (reference range 8-50), amylase 130 U/L (reference range 37-160), blood urea nitrogen 13 mg/dL, creatinine 1.0 mg/dL, blood glucose 121 mg/dL, sodium 134 mEq/L, potassium 3.8 mEq/L, calcium 9.0 mg/dL, phosphorus 4.1 mg/dL, ammonia 186 μg/dL (reference range 18-48). Immunological findings: Positive for hepatitis B surface antigen (HBsAg) and HBV-DNA, negative for hepatitis C virus antibodies (HCVAb). Before treatment for the non-Hodgkin lymphoma, she was negative for HBsAg and positive for hepatitis B surface antibody (HBsAb) and hepatitis B core antibody (HBcAb). What is the possible diagnosis?", "choices_en": ["Primary sclerosing cholangitis", "Encapsulated pancreatic necrosis", "Acute pancreatitis", "Acute hepatitis", "Acute hepatitis"], "answer": ["e"]}
{"problem_id": "116D50", "problem_text_en": "A 77-year-old woman presents with complaints of poor appetite, vomiting, and diarrhea. She has been treated for rheumatoid arthritis for the past 20 years. She has been experiencing poor appetite and fatigue for the past two weeks, and oral ulcers appeared last week. Three days ago, she visited the emergency department due to vomiting and diarrhea that occurred after continuing methotrexate, and now she is conscious. She is 145 cm tall and weighs 40 kg. Her temperature is 37.4°C, pulse rate is 108/min regular, blood pressure is 120/70 mmHg, respiratory rate is 20/min, and SpO2 is 99% on room air. Oral ulcers are observed, but there is no superficial lymphadenopathy. Heart sounds and breath sounds are normal. Mild swelling and deformity are noted in both wrist joints. Her abdomen is flat and soft, and the liver and spleen are not palpable. Laboratory findings reveal a red blood cell count of 2.97 million/μL, hemoglobin of 10.0 g/dL, hematocrit of 32%, reticulocyte count of 0.1%, total white blood cell count of 1,800/μl with 52% neutrophils, 12% eosinophils, 1% monocytes, and 35% lymphocytes, and a platelet count of 80,000/μL. Her fibrinogen level is 460 mg/dL, APTT is 27.3 seconds, INR is 1.0, and D-dimer is 6.4 μg/mL. Her serum albumin level is 3.0 g/dL, AST level is 25 U/L, ALT level is 82 U/L, and LD level is 280 U/L. Her CRP level is 16 mg/dL. Chest X-ray is normal. Methotrexate is discontinued and blood cultures are obtained, and carbapenem antibiotics are initiated. Which medication is appropriate to administer next?", "choices_en": ["ST segment elevation drugs", "Antifungal agents", "Active folic acid", "Vitamin B12", "Adrenal cortex steroids"], "answer": ["c"]}
{"problem_id": "116D51", "problem_text_en": "A 32-year-old woman presents with a chief complaint of diarrhea and abdominal pain. She reports experiencing diarrhea on days she plans to go out, about twice a week for the past 6 months, and has started experiencing abdominal pain during diarrhea for the past 3 months. She has normal stool consistency and frequency (1 time per day) on days without symptoms, but watery stool and increased frequency (5 times per day) on symptomatic days. Symptoms improve temporarily after defecation. There is no relevant family or medical history. She is 160 cm tall, weighs 48 kg (no change for the last 6 months), and her body temperature is 36.4°C. No anemia is observed on her conjunctivae. Her abdomen is flat with mild tenderness in the lower center but no rebound tenderness. There is no joint pain throughout her body. Colonoscopy did not reveal any abnormalities. Anticholinergic medication for abdominal pain did not improve her symptoms. Which of the following treatments would not be appropriate for this patient?", "choices_en": ["Administration of antidiarrheal medication", "Dietary fiber intake", "Administration of narcotic analgesics", "Intake of probiotics", "Administration of serotonin 5-HT3 receptor antagonist"], "answer": ["c"]}
{"problem_id": "116D52", "problem_text_en": "A 48-year-old woman (gravida 1, para 1) visited the hospital with the chief complaint of abdominal distension. She noticed an increase in abdominal circumference three months ago and came to the hospital because the abdominal distension had become more severe one week ago. There is no significant family history, and she underwent a cesarean section at 29 years of age. Her height is 162 cm, weight is 54 kg, body temperature is 36.8°C, pulse rate is 84 beats per minute and regular, blood pressure is 106/66 mmHg, and respiratory rate is 18 breaths per minute. A non-mobile elastic tumor is palpated in the lower abdomen, and there is no tenderness in the uterus on pelvic examination. The tumor markers are CA19-9: 87 U/mL (reference range, ≤37 U/mL) and CA125: 235 U/mL (reference range, ≤35 U/mL). A sagittal T2-weighted magnetic resonance image of the pelvis is shown separately. No metastasis or dissemination is observed on chest and abdominal computed tomography. What should be the first step in managing this patient?", "choices_en": ["Open surgery", "Radiation exposure", "Cyst puncture aspiration", "Chemotherapy with medication", "GnRH agonist administration"], "answer": ["a"]}
{"problem_id": "116D53", "problem_text_en": "A 51-year-old man underwent reconstruction surgery for a right anterior cruciate ligament injury. No postoperative bleeding or abnormal wound was observed, and he started eating meals from the day after the surgery. On the morning of the third day after the surgery, he felt discomfort in the epigastric region and began sweating while removing the knee joint fixation device to go to the bathroom. After resting for a while, his symptoms improved. However, he subsequently developed nausea and loss of appetite and could not eat lunch. There is no significant medical or family history before the surgery. His body temperature is 36.4°C, pulse rate is 84 beats per minute and regular, blood pressure is 114/70 mmHg, and respiratory rate is 18 breaths per minute. His oxygen saturation is 92% on room air and improves to 99% with 2 L/min nasal cannula oxygen supplementation. There are no abnormalities in heart and lung sounds. His abdomen is flat and liver and spleen cannot be palpated. No bleeding is observed from the surgical wound. A chest contrast-enhanced CT scan is obtained. What is the most appropriate immediate action to take?", "choices_en": ["ECMO (Extracorporeal Membrane Oxygenation)", "Emergency surgery", "Coronary angiography", "Administration of heparin", "Insertion of inferior vena cava filter"], "answer": ["d"]}
{"problem_id": "116D54", "problem_text_en": "A 21-year-old man presents with a chief complaint of facial edema and dyspnea on exertion that started a month ago. There is no significant medical history. He has facial, neck, and upper limb edema along with jugular vein distension. He is diagnosed with a mediastinal primary germ cell tumor through percutaneous needle biopsy. A chest CT scan is also shown. Which area of constriction is likely causing the patient's symptoms?", "choices_en": ["Superior vena cava", "Brachial artery", "Pulmonary artery", "Trachea", "Esophagus"], "answer": ["a"]}
{"problem_id": "116D55", "problem_text_en": "A 54-year-old woman came to the clinic after being pointed out for erythrocytosis during a health check. She often complains of loud snoring from her husband, and she has been told she occasionally stops breathing for a few seconds during sleep. She is 153 cm tall and weighs 80 kg. Her pulse is 76 beats/min and regular, and her blood pressure is 148/98 mmHg. There is no conjunctival congestion or scleral icterus. No abnormalities are detected in heart or respiratory sounds. Her abdomen is flat, soft, and there is no palpable liver or spleen. Blood test results show erythrocytosis with a red blood cell count of 6.5 million/µL, Hb of 19.0 g/dL, and Ht of 52%. The leukocyte count is 7,600/µL, with 4% segmented neutrophils, 64% band neutrophils, 1% eosinophils, 0% basophils, 9% monocytes, and 22% lymphocytes. The platelet count is 380,000/µL. Blood biochemistry test results show a total protein of 6.8 g/dL, albumin of 3.5 g/dL, total bilirubin of 0.8 mg/dL, AST of 36 U/L, ALT of 32 U/L, LD of 180 U/L (reference range: 120-245), BUN of 16 mg/dL, creatinine of 0.8 mg/dL, and blood glucose of 108 mg/dL. Which of the following test results is likely in this patient?", "choices_en": ["Increase in histamine", "Increased vitamin B12", "JAK2 gene mutation positive", "Increase in erythropoietin", "Philadelphia chromosome positive."], "answer": ["d"]}
{"problem_id": "116D56", "problem_text_en": "A 69-year-old man presented with a complaint of skin rash for the past month and general malaise and loss of appetite for the past week. His sister died of a hematologic disorder. His body temperature was 37.1°C, his pulse rate was 68 beats/min and regular, and his upper body showed erythema. No superficial lymph nodes were palpable. Laboratory findings showed a red blood cell count of 4.46 million/μL, Hb of 14.9 g/dL, Ht of 44%, white blood cell count of 14,800/μL, and platelet count of 200,000/μL. Biochemical findings showed a total protein level of 6.9 g/dL, albumin level of 4.1 g/dL, total bilirubin level of 1.5 mg/dL, AST level of 95 U/L, ALT level of 53 U/L, LD level of 1916 U/L (normal range: 120-245), and creatinine level of 1.4 mg/dL. A peripheral blood smear stained with May-Giemsa is shown separately. What is the complication to be particularly careful about in this patient?", "choices_en": ["Hyperphosphatemia", "Hyperchloremia", "Hypercalcemia", "Hypernatremia", "Hypermagnesemia"], "answer": ["c"]}
{"problem_id": "116D57", "problem_text_en": "An 82-year-old woman complained of brownish discoloration on her right big toenail. The brown discoloration had been present in the same site for the past 20 years. She visited a clinic near her home 10 years ago and was diagnosed with a benign skin disease. She visited the current clinic because the brown discoloration had been expanding over the past six months and started to bleed spontaneously. She has no itching or pain. A rash was observed on the right big toe, and there was no tenderness. The right inguinal lymph node was palpable. A photograph of the right big toe (A) and dermoscopy image (B) are presented separately. What is the most likely condition?", "choices_en": ["Bowen disease", "Malignant melanoma", "Basal cell carcinoma", "Café-au-lait spot(s)", "Extramammary Paget's disease"], "answer": ["b"]}
{"problem_id": "116D58", "problem_text_en": "A 22-year-old woman presents with a chief complaint of fever and sore throat. She has had sore throat for one week, which has not resolved despite taking analgesics and is unable to consume adequate fluids. Examination reveals white patches on both tonsils, and multiple tender lymph nodes in both posterior cervical chains are palpable. Her temperature is 37.8℃. Laboratory data: WBC 11,000 (neutrophils 40%, lymphocytes 55%, monocytes 3%, eosinophils 1%, basophils 1%), AST 105 U/L, ALT 125 U/L, CRP 10 mg/dL. What would be the most appropriate response to this patient?", "choices_en": ["Infusion (intravenous fluids)", "Tonsillectomy.", "Administration of penicillin", "Administration of antiviral drugs", "Administration of antiallergic medication"], "answer": ["a"]}
{"problem_id": "116D59", "problem_text_en": "A 19-year-old male suffered a head injury during a sports game and was brought to the hospital by the on-duty physician at the venue due to a chief complaint of disturbed consciousness. He lost consciousness for several minutes immediately after the injury and had a Japan Coma Scale (JCS) score of I-3 upon initial examination by the physician. Thirty minutes after being injured, he had a JCS score of I-1 upon arrival at the emergency department. His body temperature was 36.6℃, blood pressure 120/80mmHg, heart rate 70 beats/min regular, respiratory rate 14 breaths/min, and SpO2 99% on room air. Pupils were 3 mm in diameter bilaterally with brisk light reflexes. He had mild headache and dizziness without nausea or vomiting. He had no memory of the period from the game to his arrival at the emergency department. No abnormalities were detected on plain X-rays or head CT. Which of the following is the appropriate decision for his return to sports activities?", "choices_en": ["Promptly return to the game.", "Allowing the athlete to return to the game after waiting for three hours since the injury.", "Allowing the athlete to return to the game after 12 hours following the injury.", "Gradually allow return based on the return program for each type.", "We will not allow a return to the same sport in the future."], "answer": ["d"]}
{"problem_id": "116D60", "problem_text_en": "An 11-year-old boy presented with complaints of right shoulder pain. He noticed a tumor in the proximal right upper arm two months ago. As the tumor gradually increased in size and movement pain occurred, he decided to seek medical attention. He has no significant medical history. His height is 132cm, weight is 26kg, and his body temperature is 36.2℃. A hard tumor is palpated in the proximal right upper arm. Laboratory findings: red blood cells - 4.68 million, Hb - 13.9g/dL, white blood cells - 4,300, and platelets - 180,000. Blood biochemistry: total protein - 7.5g/dL, albumin - 3.9g/dL, total bilirubin - 0.9mg/dL, direct bilirubin - 0.2mg/dL, AST - 28U/L, ALT - 16U/L, LD - 177U/L (normal range: 120-245), ALP - 566U/L (normal range: 38-113), γ-GT - 32U/L (normal range: 8-50), CK - 42U/L (normal range: 30-140), blood urea nitrogen - 12mg/dL, creatinine - 0.3mg/dL, uric acid - 4.9mg/dL, Na - 136mEq/L, K - 4.4mEq/L, Cl - 97mEq/L. CRP - 0.9mg/dL. X-ray image (A) and magnetic resonance imaging (MRI) fat-suppressed T1-weighted coronal section image (B) of the right humerus are shown separately. Which of the following is an appropriate response to be executed next?", "choices_en": ["Administration of antimicrobial agents (antibiotics)", "Administration of analgesics", "Gypsum fixation (referring to the use of a plaster cast to immobilize a broken bone)", "Tissue biopsy", "Local cooling"], "answer": ["d"]}
{"problem_id": "116D61", "problem_text_en": "A 23-year-old nulliparous woman was found to have an abnormality on her first cervical cancer screening. She has no symptoms. She is 158 cm tall and weighs 50 kg. Her body temperature is 36.2℃, and her pulse is 84 beats per minute and regular. Her blood pressure is 106/66 mmHg, and her respiratory rate is 16 breaths per minute. On pelvic exam, the uterus is of normal size and has good mobility. No masses are felt on either adnexa. Cervical cytology results (A) and colposcopy image (B) are shown separately. Which test is necessary to confirm the diagnosis?\n\n(Note: A and B are not provided in the original text and referred to another source)", "choices_en": ["Hysteroscope", "Cystoscope", "Endometrial cytology", "Lower gastrointestinal endoscopy", "Cervical biopsy"], "answer": ["e"]}
{"problem_id": "116D62", "problem_text_en": "A 54-year-old man visits the hospital for a detailed examination of complications related to diabetes. He was first diagnosed with high blood glucose and hypertension 10 years ago during a health checkup, and has been taking oral hypoglycemic and antihypertensive drugs prescribed by a clinic near his home. His HbA1c has been around 8% for the past 3 years, and he is aware of a diminished sensation on the soles of both feet. Last month, he was diagnosed with nonproliferative diabetic retinopathy at an ophthalmological examination. He is 168 cm tall, weighs 65 kg, and has a body temperature of 36.1℃. His pulse rate is 64 beats/min and regular. Blood pressure is 128/76 mmHg. No abnormalities are detected in his chest or abdomen. His patellar tendon reflexes are normal, but his Achilles tendon reflex is decreased on both sides. Urinalysis shows protein (−), glucose 2+, ketone bodies (−), and occult blood (−). What examination is necessary to diagnose diabetic nephropathy in this patient?", "choices_en": ["Renal ultrasound examination", "Measurement of serum creatinine level", "Measurement of serum cystatin C", "Measurement of urine albumin/creatinine ratio", "Measurement of β2-microglobulin/creatinine ratio in urine"], "answer": ["d"]}
{"problem_id": "116D63", "problem_text_en": "A 28-year-old male patient presents with complaints of nasal congestion and runny nose. He has been suffering from persistent year-round nasal congestion, watery nasal discharge, and sneezing for the past 8 years. His body temperature is 36.0℃. Nasal mucosa appears pale and swollen, and the entire nasal cavity is obstructed. Maxillary sinus mucosal thickening is observed on sinus X-ray. Which of the following treatments is not appropriate?", "choices_en": ["Oral administration of antibiotics", "Desensitization therapy", "Nasal laser surgery", "Taking antihistamines orally", "Nasal corticosteroid"], "answer": ["a"]}
{"problem_id": "116D64", "problem_text_en": "A 24-year-old woman visits with a chief complaint of persistent fever. She experienced a fever in the high 37s two months ago, with no other symptoms. However, as the fever remains, she visited the clinic. Her body temperature is 37.8℃. Her pulse is 92 beats per minute and regular, and her blood pressure is 110/72 mmHg. There are no abnormalities in the conjunctiva or eyeball conjunctiva. She feels tenderness and hears vascular murmur that corresponds to the course of the artery in the right neck. There are no abnormalities in her heart sounds or breath sounds. Her abdomen is flat, soft, with no palpable liver or spleen. There are no palpable superficial lymph nodes. Blood test results: red blood cells 3.92 million, Hb 9.8 g/dL, Ht 30%, white blood cells 14,300, and platelets 420,000. Biochemical blood test results: urea nitrogen 13 mg/dL, creatinine 0.5 mg/dL, and CRP 8.0 mg/dL. Which of the following is not appropriate for evaluating this condition?", "choices_en": ["Contrast-enhanced CT", "Arterial biopsy", "Contrast-enhanced MRI", "Fluorodeoxyglucose-Positron Emission Tomography (FDG-PET)", "Carotid ultrasound examination"], "answer": ["b"]}
{"problem_id": "116D65", "problem_text_en": "A 21-year-old man complains of fever and general fatigue. He had a fever of 38.5 degrees and sore throat a week ago, for which he visited a clinic near his home. He was prescribed antipyretics and analgesics and the sore throat improved, but the fever continued. Three days ago, he began to feel general fatigue, which worsened, so he came to the hospital. He is 165 cm tall, weighs 58 kg, and his pulse is 112 beats per minute and regular. His blood pressure is 108/58 mmHg. Conjunctivae are anemic, and yellowing is observed in the sclera of the eyes. His pharynx is red, and several lymph nodes approximately 1.5 cm in diameter with tenderness are palpable on both sides of the neck. A Levine grade 2/6 systolic ejection murmur at the maximum intensity point of the second rib on the right edge of the sternum is audible. Respiratory sounds are normal. His abdomen is flat, soft, and nontender. His liver is palpable 2 cm below the right costal margin, and his spleen is palpable 3 cm below the left costal margin. Petechiae are observed on his limbs. Laboratory findings: Red blood cells: 2.32 million, Hb 7.1 g/dL, Ht 22%, white blood cells 2200 (segmented neutrophils 21%, eosinophils 0%, basophils 0%, monocytes 19%, lymphocytes 40%, atypical lymphocytes 20%), platelets 18,000. Blood chemistry: Total protein 6.5 g/dL, albumin 3.1 g/dL, direct bilirubin 0.5 mg/dL, indirect bilirubin 2.2 mg/dL, AST 36 U/L, ALT 32 U/L, LD 1580 U/L (reference range: 120-245), blood urea nitrogen 16 mg/dL, creatinine 0.8 mg/dL, blood glucose 78 mg/dL. CRP 2.1 mg/dL. A bone marrow smear stained with May-Giemsa is shown separately. What is the most likely diagnosis in this patient?", "choices_en": ["Red blood cell hypoplasia", "BCR/ABL fusion gene", "Elevated serum ferritin levels", "Deficiency of GPI-anchored protein", "High serum haptoglobin"], "answer": ["c"]}
{"problem_id": "116D66", "problem_text_en": "A 38-year-old primigravida came to the hospital for evaluation of twin pregnancy at 24 weeks and 2 days of gestation. She became pregnant through in vitro fertilization-embryo transfer and received early pregnancy check-ups at an obstetrics clinic. At 9 weeks of gestation, dichorionic diamniotic twin pregnancy was diagnosed. Although there were no abnormalities noted until 18 weeks of gestation, the estimated fetal weight (EFW) began to show a significant difference, indicating the possibility of twin-to-twin transfusion syndrome (TTTS). At the time of referral, an ultrasound was performed and revealed an EFW discordance of approximately 20%, with a maximum vertical pocket (MVP) of 8 cm in the larger twin and 2 cm in the smaller twin and a cervical length of 25 mm. What information is necessary for the diagnosis of TTTS? Choose two.", "choices_en": ["① (Japanese numerical character)", "This is not a complete choice and cannot be translated without further context about the question and the other choices available. In general, \"②\" is a numerical or symbol used to represent a choice or an answer option in a multiple-choice format.", "Without additional context, it is not possible to accurately translate the choice \"③.\" It is likely a numeric label used in a multiple-choice question to indicate a specific option or answer. Could you please provide more information or context?", "I'm sorry, ④ is a number or symbol and it cannot be translated without context. Please provide me with more details or information so I can assist you better.", "I'm sorry, but ⑤ is not a word or phrase that can be translated into English. It is a numerical indicator, often used in multiple-choice questions to denote a specific answer choice."], "answer": ["b", "d"]}
{"problem_id": "116D67", "problem_text_en": "A 3-year-old boy presented with complaints of excessive hair growth and weight gain over the past six months, accompanied by his mother. His height is 92.5 cm and his weight is 18.5 kg. His temperature is 36.7℃. His pulse is 124/min, regular. Blood pressure is 134/86 mmHg. Respiratory rate is 24/min. Oxygen saturation is 99% (room air). The child is alert and has good color. No abnormalities are observed in heart sounds or breath sounds. The abdomen is flat, soft, and the liver and spleen are not palpable. The child has a full-moon face and central obesity. The growth curve of the child is shown separately. Which two hormone tests are necessary for diagnosis?\n \n(Note: The original text did not include the growth curve, so it cannot be shown separately here.)", "choices_en": ["Luteinizing hormone (LH)", "Parathyroid hormone (PTH)", "ACTH (Adrenocorticotropic hormone)", "Adrenaline", "Cortisol"], "answer": ["c", "e"]}
{"problem_id": "116D68", "problem_text_en": "A 23-year-old man comes to the hospital reporting sore throat, vomiting, and diarrhea. He had repeated sexual encounters with multiple partners in the past six months. He intermittently had a fever in the 39s for the past two weeks, and sore throat appeared a week ago. He sought medical attention two days ago because the vomiting and diarrhea persisted. Physical examination showed no obvious abnormalities, but HIV antigen/antibody combination screening test was positive in the blood test. Which of the following tests are necessary to confirm HIV infection? Select two.", "choices_en": ["Pharyngeal culture", "Blood culture", "Quantitative measurement of HIV RNA in blood test", "Measurement of CD4-positive T lymphocyte count", "Measurement of anti-HIV antibodies by Western blot method."], "answer": ["c", "e"]}
{"problem_id": "116D69", "problem_text_en": "A 71-year-old man presents with a chief complaint of fever and loss of appetite. He had watered his garden with rainwater collected a week earlier. He has had decreased appetite for a few days, and fever, malaise, and joint pain for two days. He has a clear consciousness. His height is 172 cm, and his weight is 68 kg. His temperature is 39.1°C. His pulse rate is 76/min and regular. His blood pressure is 104/66 mmHg. His respiratory rate is 24/min. Oxygen saturation on room air is 94%. Coarse crackles are heard in the right lower chest. His blood test results show a red blood cell count of 3.73 million, Hb of 11.9 g/dL, Hct of 35%, WBC count of 18,600 (93% neutrophils, 0% eosinophils, 1% basophils, 4% monocytes, and 2% lymphocytes), and platelet count of 160,000. His blood biochemical test results show an AST of 28 U/L, ALT of 16 U/L, LD of 177 U/L (reference range: 120-245), CK of 323 U/L (reference range: 30-140), urea nitrogen of 18.9 mg/dL, creatinine of 0.97 mg/dL, glucose of 169 mg/dL, Na of 127 mEq/L, K of 4.2 mEq/L, Cl of 93 mEq/L, and CRP of 24 mg/dL. A chest X-ray reveals infiltrative shadows in the right lower lung field. A sputum gram stain shows numerous polymorphonuclear leukocytes, but no definite pathogenic bacteria are identified. What are the appropriate antibiotics for treatment? Select two.", "choices_en": ["Cephalosporin-based", "Carbapenem antibiotics", "Macrolide antibiotics", "Fluoroquinolone-based", "Aminoglycoside antibiotics"], "answer": ["c", "d"]}
{"problem_id": "116D70", "problem_text_en": "A 66-year-old woman complains of insomnia and visits a clinic. She has been having difficulty falling asleep for the past three months and wakes up 2-3 times at night, hence her consultation. As cognitive impairment, depression or loss of appetite are not observed, the doctor has prescribed a benzodiazepine sleep aid. Which of the following explanations would be appropriate for the patient? Select two.\n\n- This medication may cause drowsiness or dizziness, so be careful when driving a car or operating heavy machinery.\n- Do not consume alcoholic drinks while taking this medication.", "choices_en": ["\"You may become more sensitive to the cold\"", "\"I sometimes feel unsteady on my feet.\"", "The gums may become swollen.", "\"You may experience breast swelling and lactation.\"", "\"After continuous consumption, sudden cessation may cause anxiety.\""], "answer": ["b", "e"]}
{"problem_id": "116D71", "problem_text_en": "A 47-year-old man was injured after falling from the stairs of a pedestrian bridge on his way back from a drinking party at work and was transported to the hospital by ambulance. At the time of arrival, his consciousness level was JCS II-10. His body temperature was 36.6℃, blood pressure was 126/88 mmHg, heart rate was 80 bpm and regular, and respiratory rate was 16/min. His SpO2 level was 99% under oxygen administration at a rate of 10L/min via a reservoir mask. Horizontal and coronal CT images (A) and (B) of the bones obtained by emergency examination at arrival are shown separately. What is the diagnosis? Select two.", "choices_en": ["Skull fracture", "Acute epidural hematoma", "Acute subdural hematoma", "Traumatic intracerebral hematoma.", "Diffuse axonal injury"], "answer": ["a", "b"]}
{"problem_id": "116D72", "problem_text_en": "A 66-year-old man presented with a complaint of hematuria. Macroscopic hematuria had been observed for 2 months. He is 165 cm tall and weighs 71 kg. His body temperature is 36.4℃, pulse rate is 72/min, regular. His blood pressure is 136/92 mmHg, and respiratory rate is 16/min. His abdomen is flat and there is no tenderness. Urinalysis reveals protein (-), glucose (-), ketone bodies (-), occult blood 3+, and over 100 red blood cells and 1-4 white blood cells per high-power fields in the urine sediment. Abdominal ultrasound examination (A) and cystoscopic examination findings (B) are shown separately. Which of the following complications are possible with surgical treatment for this patient by endoscopic urologic surgery? Select three.", "choices_en": ["Urethral stricture", "Bladder perforation", "Retrograde ejaculation", "Stress urinary incontinence", "Acute prostatitis"], "answer": ["a", "b", "e"]}
{"problem_id": "116D73", "problem_text_en": "A 76-year-old man presents with upper abdominal pain. He has been experiencing mild upper abdominal pain after meals for the last two months, and decided to seek medical attention as it did not improve. He has been taking medications for hypertension since the age of 60, but has no history of smoking or alcohol use. There are no abnormalities observed in the eyelid conjunctiva or eyeball conjunctiva. The abdomen is flat, soft, and the liver and spleen cannot be palpated. Blood test results: red blood cells 3.98 million, Hb 12.8 g/dL, white blood cells 8,100, and platelets 280,000. Blood biochemical test results: total bilirubin 1.4 mg/dL, AST 80 U/L, ALT 104 U/L, ALP 152 U/L (reference range 38-113), amylase 180 U/L (reference range 37-160), blood urea nitrogen 12 mg/dL, and creatinine 0.6 mg/dL. The following are shown separately: a duodenal descending image obtained from upper gastrointestinal endoscopy (A) and an H-E stained tissue section of a biopsy specimen (B). An abdominal ultrasound examination performed on the same day revealed dilation of the main pancreatic duct. Which of the following tests is appropriate to be performed next? Select three.", "choices_en": ["Abdominal contrast-enhanced CT scan", "Endoscopic ultrasound examination", "Small intestine balloon endoscope", "Small intestine capsule endoscopy", "Magnetic Resonance Cholangiopancreatography (MRCP)"], "answer": ["a", "b", "e"]}
{"problem_id": "116D74", "problem_text_en": "A 75-year-old woman presents with bilateral knee pain. She reports the pain began spontaneously six months ago and has had difficulty with walking and climbing stairs for the past three months despite being prescribed NSAIDs from a nearby medical facility. She is 152 cm tall, weighs 70 kg, and has a BMI of 30.3. Her body temperature is 36.4°C, her pulse rate is 84 beats per minute and regular, her blood pressure is 126/68 mmHg, and her respiratory rate is 14 per minute. Neurological examination shows no abnormalities, and there is no joint swelling in either knee. Tenderness is noted on the medial joint space of both knees. The range of motion of the right knee joint is 120 degrees of flexion and -10 degrees of extension. The range of motion of the left knee joint is 130 degrees of flexion and -5 degrees of extension. The X-rays of both knee joints in the upright position are provided separately. Which of the following are appropriate treatment options? Select three.", "choices_en": ["Weight loss", "Lower limb strengthening training", "Cultured cartilage transplantation surgery", "Total knee arthroplasty (TKA)", "Adrenal cortex steroid administration."], "answer": ["a", "b", "d"]}
{"problem_id": "116D75", "problem_text_en": "A 72-year-old woman presents with chief complaint of anemia. Though being treated for diabetes at a clinic near her home, she was found to be anemic and administered iron preparation which did not show improvement. She was referred for further examination. On arrival, she was alert with a body temperature of 36.2℃, height of 160 cm, weight of 64 kg, pulse rate of 104/min, regular and blood pressure of 142/82 mmHg. She appeared to have conjunctival pallor. Aside from abnormalities in blood tests (red blood cell count: 3.9 million/μl, hemoglobin: 9.6 g/dL, hematocrit: 30%, white blood cell count: 3,700/μl, and platelet count: 290,000/μl), other physical exam findings and laboratory data were generally unremarkable. Colonoscopy showed a tumor 45 cm from the anal verge, which was pathologically diagnosed as an adenocarcinoma. An abdominal contrast CT scan was scheduled to determine the indications for surgery. Which of the following findings should be confirmed by abdominal contrast CT to decide on the surgical indication? Select three.", "choices_en": ["Ascites", "Hepatic metastasis", "Intestinal adhesion", "Visceral fat amount", "Lymphadenopathy"], "answer": ["a", "b", "e"]}
