{"problem_id": "116A1", "problem_text_en": "Which of the following is incorrect regarding hypertension caused by obstructive sleep apnea?", "choices_en": ["It often becomes nocturnal hypertension.", "Weight loss is recommended for obese patients.", "Alpha-blockers are the first-choice drug.", "In household blood pressure measurements, it is common for hypertension to occur in the early morning.", "Decrease in blood pressure is expected with continuous positive airway pressure (CPAP)."], "asnwer": ["c"], "answer": ["c"]}
{"problem_id": "116A2", "problem_text_en": "When is the appropriate time to start administering penicillin-type antibiotics for the prevention of mother-to-child infections in a pregnant woman who tested positive for group B streptococcus (GBS) in the vaginal secretion bacterial culture test at the end of pregnancy?", "choices_en": ["At the time of positive confirmation", "At 37 weeks of pregnancy", "At the onset of labor (when contractions begin)", "Full dilatation of the cervix during labor", "Emergency delivery of the infant's head"], "asnwer": ["c"], "answer": ["c"]}
{"problem_id": "116A3", "problem_text_en": "Which of the following statements regarding central serous chorioretinopathy is incorrect?", "choices_en": ["I am aware of night blindness.", "Being aware of a visual disorder.", "It often resolves on its own.", "Fluorescein angiography is useful.", "Optical coherence tomography (OCT) is useful."], "asnwer": ["a"], "answer": ["a"]}
{"problem_id": "116A4", "problem_text_en": "Which of the following drugs when taken alone has a higher possibility of causing hypoglycemia?", "choices_en": ["DPP-4 inhibitors", "SGLT2 inhibitors", "Biguanide medication", "Sulfonylurea drugs", "Alpha-glucosidase inhibitor"], "asnwer": ["d"], "answer": ["d"]}
{"problem_id": "116A5", "problem_text_en": "Which of the following statements is correct regarding adult heart transplantation in our country?", "choices_en": ["The 10-year survival rate is approximately 10%.", "Performed about 1,000 times a year.", "The underlying disease is dilated cardiomyopathy, which is the most common.", "As a general rule, immunosuppressive drugs are not used after surgery.", "The average waiting period since 2015 is less than one year."], "asnwer": ["c"], "answer": ["c"]}
{"problem_id": "116A6", "problem_text_en": "What causes hyperkalemia?", "choices_en": ["Beta agonist", "Insulin", "Loop diuretic", "Glycyrrhizin", "Renin-angiotensin system inhibitor"], "asnwer": ["e"], "answer": ["e"]}
{"problem_id": "116A7", "problem_text_en": "Which of the following is not a cause of gastroesophageal reflux disease (GERD)?", "choices_en": ["Obesity", "Advanced age / Elderly", "Kyphosis", "Atrophic gastritis", "Calcium channel blocker"], "asnwer": ["d"], "answer": ["d"]}
{"problem_id": "116A8", "problem_text_en": "Which of the following is not consistent with cardiac sarcoidosis in patients presenting with heart failure?", "choices_en": ["Atrioventricular block", "Sustained ventricular tachycardia", "Decrease in left ventricular ejection fraction", "Asymmetric hypertrophy of the ventricular septum", "Abnormal accumulation in the myocardium with FDG-PET"], "asnwer": ["d"], "answer": ["d"]}
{"problem_id": "116A9", "problem_text_en": "Which of the following is not a risk factor for osteonecrosis?", "choices_en": ["Drinking alcohol", "Decompression sickness", "Radiation exposure", "Organophosphate pesticides", "Adrenal cortex steroids"], "asnwer": ["d"], "answer": ["d"]}
{"problem_id": "116A10", "problem_text_en": "What are the characteristics of secondary Raynaud's phenomenon due to systemic sclerosis?", "choices_en": ["It is unilateral.", "There is a family history.", "It commonly occurs in young people.", "Accompanied by finger swelling.", "Accompanied by a difference in blood pressure between the left and right sides."], "asnwer": ["d"], "answer": ["d"]}
{"problem_id": "116A11", "problem_text_en": "Which of the following is not a characteristic of autism spectrum disorder?", "choices_en": ["More common in boys.", "There is sensory hypersensitivity.", "Difficulty in interpersonal relationships.", "Symptoms are observed before starting school.", "Not very particular/attentive to small details."], "asnwer": ["e"], "answer": ["e"]}
{"problem_id": "116A12", "problem_text_en": "Which of the following is less likely to be the pathophysiology of a hypertensive emergency in a patient with sudden blood pressure elevation?", "choices_en": ["Acute aortic dissection", "Pheochromocytoma crisis", "Brain edema associated with papilledema", "Acute heart failure causing pulmonary edema", "Respiratory failure with pulmonary arterial hypertension"], "asnwer": ["e"], "answer": ["e"]}
{"problem_id": "116A13", "problem_text_en": "Which of the following is correct regarding vascular dementia? Select two.\n\n(Note: the original Japanese text is a question asking for correct statements about vascular dementia.)\n\n(Note 2: The following are possible correct answers, but the actual correct statements may depend on the available options in the exam or context.)\n\n- Vascular dementia is caused by reduced blood flow to the brain due to stroke or other vascular disorders.\n- The symptoms of vascular dementia often develop suddenly and may vary depending on the location and extent of brain damage.", "choices_en": ["Does not occur in people in their 50s.", "Often accompanied by motor dysfunction.", "It does not occur in the first attack of cerebral infarction.", "No abnormalities were observed on head MRI/MRA images.", "Abnormal blood flow distribution in brain blood flow SPECT does not show a specific pattern."], "asnwer": ["b", "e"], "answer": ["b", "e"]}
{"problem_id": "116A14", "problem_text_en": "Which of the following combinations of pathogen and malignancy is correct? Select two.", "choices_en": ["Human papillomavirus (HPV) ---------- endometrial cancer", "Adult T-cell leukemia virus --------- Lung cancer", "Hepatitis C virus --------- Hepatocellular carcinoma", "Helicobacter pylori - gastric cancer.", "EB virus - pancreatic cancer"], "asnwer": ["c", "d"], "answer": ["c", "d"]}
{"problem_id": "116A15", "problem_text_en": "Which of the following are indicators used in the diagnosis of acute kidney injury? Choose two.", "choices_en": ["Amount of urinary protein (proteinuria)", "Renal longitudinal diameter", "Total urine volume over a period of time", "Degree of urinary occult blood", "Rate of increase in serum creatinine level"], "asnwer": ["c", "e"], "answer": ["c", "e"]}
{"problem_id": "116A16", "problem_text_en": "A 76-year-old woman came to the hospital with high blood sugar and protein in her urine. She was told she had high blood sugar during her health checkup before retirement, but did not take any action. She had not received any health checkups since retiring at the age of 60. Her weight had increased by 10 kg over the past 3 years since her retirement. Her medical history was unremarkable except for her sister having diabetes. She currently lives alone and does not exercise. She was referred to this hospital after being diagnosed with proliferative diabetic retinopathy due to her vision loss and being pointed out her high blood sugar and protein in her urine. She is 154 cm tall and weighs 70 kg. Her pulse rate is 72 beats/min and regular. No abnormalities were detected in her chest or abdomen. Mild pitting edema was observed in both lower legs. Urinalysis revealed 2+ protein, 3+ glucose, and negative occult blood. Her protein to creatinine ratio was 1.2 g/gCr (reference <0.15) when tested at any time. There were 1-2 RBCs/HPF and 1-2 WBCs/HPF in her urine sediment, and no casts were observed. Blood chemistry analysis revealed a total protein level of 6.1 g/dL, albumin level of 4.2 g/dL, blood urea nitrogen level of 16 mg/dL, creatinine level of 0.6 mg/dL, eGFR of 72.3 mL/min/1.73m2, a blood glucose level of 201 mg/dL, an HbA1c level of 10.2% (reference 4.6-6.2%), a sodium level of 142 mEq/L, a potassium level of 4.5 mEq/L, a chloride level of 100 mEq/L, and a calcium level of 9.2 mg/dL. Anti-GAD antibodies were negative. The most suggestive finding indicating that the cause of her proteinuria is diabetic nephropathy is which of the following?", "choices_en": ["Sister's history of diabetes", "Negative anti-GAD antibodies", "Presence of diabetic retinopathy", "Random blood glucose level >200mg/dL", "Urine protein/creatinine ratio ≥ 1.0g/gCr"], "asnwer": ["c"], "answer": ["c"]}
{"problem_id": "116A17", "problem_text_en": "A 6-month-old boy was brought to the hospital by his mother with vomiting as the chief complaint. He fell from a bed about 50 cm high to the floor when he turned over in his sleep and subsequently developed vomiting and lethargy. He was diagnosed with hemophilia A in the neonatal period and has a family history of the same disorder. His height is 70 cm, weight is 9 kg, body temperature is 36.8°C, heart rate is 120/min regular, blood pressure is 86/56 mmHg, respiratory rate is 32/min, and SpO2 is 98% (room air). He appears lethargic and has a pale complexion. No abnormalities are detected in heart and breath sounds. His abdomen is flat and soft. Blood test results show red blood cells 3.2 million/mm3, Hb 10.2 g/dL, Hct 30%, WBC 14,000/mm3, platelet count 250,000/mm3, PT-INR 1.3 (reference range 0.9-1.1), APTT 98.3 seconds (reference range 26.1-37.1), and plasma fibrinogen 150 mg/dL (reference range 186-355). Blood biochemistry results show total protein 4.5 g/dL, albumin 2.8 g/dL, AST 30 U/L, ALT 26 U/L, LDH 774 U/L (reference range 120-245), blood urea nitrogen 12 mg/dL, creatinine 0.6 mg/dL, and blood glucose 120 mg/dL. A head CT scan is shown separately. What is the appropriate initial management?", "choices_en": ["Red blood cell transfusion", "Observation at home", "Fresh frozen plasma transfusion.", "Administration of coagulation factor IX product", "Administration of coagulation factor VIII product"], "asnwer": ["e"], "answer": ["e"]}
{"problem_id": "116A18", "problem_text_en": "A 23-year-old man visited a clinic because he frequently falls asleep while working and experiences sudden attacks of sleepiness even during important business negotiations or meetings. He has also noticed strong sleepiness during the day despite having sufficient sleep at night for several years. Recently, he has been experiencing sudden loss of muscle tone after a big laughter or being surprised. There were no abnormalities in neurological examination. Which of the following characteristics is most likely to be observed in this patient?", "choices_en": ["Experience sleep paralysis when falling asleep.", "Complicated by nocturnal delirium.", "Drowsiness remains even after a sleep attack.", "Experiencing panic attacks during sleep.", "The urge to move legs becomes stronger during sleep."], "asnwer": ["a"], "answer": ["a"]}
{"problem_id": "116A19", "problem_text_en": "A 62-year-old woman presents with dyspnea and overall fatigue. She had undergone catheter ablation for paroxysmal atrial fibrillation seven days ago and was discharged three days ago. The day after discharge, she developed dyspnea and overall fatigue, which gradually worsened, leading to her present visit. Her consciousness is clear, temperature is 36.2°C, pulse rate is 112 bpm regular, blood pressure is 88/72 mmHg, with a drop of systolic blood pressure of 18 mmHg upon inspiration. Respiratory rate is 18 breaths per minute. Oxygen saturation is 95% on room air. Lung auscultation reveals no abnormalities. Heart sounds are faint, but there is no murmur. Neck veins are distended. Laboratory tests show red blood cells of 4.62 million/uL, Hb of 13.2g/dL, Ht of 39%, WBC of 9700/uL, and platelets of 390,000/uL. Blood chemistry shows blood urea nitrogen of 44mg/dL, creatinine of 1.7mg/dL, Na of 141 mEq/L, K of 4.2 mEq/L, and Cl of 110 mEq/L. \nWhat is the most likely pathological condition?", "choices_en": ["Retoperitoneal hematoma", "Ventricular septal perforation", "Pulmonary embolism", "Cardiac tamponade", "Complete atrioventricular block (CAVB)"], "asnwer": ["d"], "answer": ["d"]}
{"problem_id": "116A20", "problem_text_en": "A 64-year-old man presents with a chief complaint of dyspnea. He developed left chest pain and dyspnea four days ago, which gradually worsened and prompted him to seek medical attention. Temperature is 36.2°C. Pulse rate is 100 bpm and regular. Blood pressure is 120/80 mmHg. Respiratory rate is 20 breaths/min. Oxygen saturation is 92% (room air). No abnormalities are detected on examination of the conjunctiva or sclera. No lymph nodes are palpable in the neck. No breath sounds are audible in the left chest. Laboratory findings show: red blood cell count 4.2 million/mm3, Hb 13.0 g/dL, Hct 37%, white blood cell count 4,400/mm3, and platelet count 210,000/mm3. CRP level is 0.4 mg/dL. Chest X-ray on admission (A) is separately shown. After admission, a chest tube is inserted, and cough and frothy sputum appear immediately. Chest X-ray at this time (B) is separately shown. Which of the following is correct regarding the clinical course after insertion of the chest tube?", "choices_en": ["Pneumonia", "Pulmonary edema", "Atelectasis", "Pulmonary alveolar hemorrhage", "Congestive heart failure"], "asnwer": ["b"], "answer": ["b"]}
{"problem_id": "116A21", "problem_text_en": "A 73-year-old man underwent endoscopic stone removal for the treatment of a common bile duct stone. Three hours later, he complained of persistent epigastric and back pain. His body temperature was 35.8℃, pulse rate was 104 beats/min and regular, blood pressure was 84/56 mmHg, respiratory rate was 20 breaths/min and his SpO2 was 93% on room air. His face appeared pale. His abdomen was flat with tenderness and muscular defense in the epigastric area. His laboratory data showed RBC count of 4.3 million/μL, Hb of 15.3 g/dL, Ht of 44%, WBC count of 11,000/μL, platelets of 230,000/μL, PT-INR of 1.0 (reference range 0.9-1.1). His blood biochemistry data showed a total bilirubin of 1.2 mg/dL, AST of 20 U/L, ALT of 19 U/L, LDH of 151 U/L (reference range 120-245), ALP of 110 U/L (reference range 38-113), γ-GT of 22 U/L (reference range 8-50), amylase of 1,495 U/L (reference range 37-160), and creatinine of 1.0 mg/dL. CRP was 1.0 mg/dL. Abdominal contrast-enhanced CT is shown separately. Which of the following treatments in addition to fluid therapy should be performed as initial treatment?", "choices_en": ["Plasma exchange", "Emergency laparotomy.", "Pancreatic enzyme inhibitor administration", "Steroid pulse therapy", "Endoscopic biliary drainage procedure"], "asnwer": ["c"], "answer": ["c"]}
{"problem_id": "116A22", "problem_text_en": "A 22-year-old man came to the clinic worried after being diagnosed with renal dysfunction during a health examination. His mother and uncle are undergoing dialysis treatment. Blood biochemistry reports show a blood urea nitrogen level of 28 mg/dL and a creatinine level of 1.5 mg/dL. An abdominal MRI (fat-suppressed T2-weighted coronal image) is also presented. Which of the following is incorrect regarding this condition?", "choices_en": ["There are many complications with liver cysts.", "It is autosomal dominant type.", "It develops from the neonatal period.", "Brain aneurysms have a high incidence rate.", "There is a therapeutic drug that is a vasopressin V2 receptor antagonist."], "asnwer": ["c"], "answer": ["c"]}
{"problem_id": "116A23", "problem_text_en": "A 38-year-old man presented to a hospital for further examination after being referred by a local clinic due to leukopenia and thrombocytopenia identified following the appearance of subcutaneous bleeding one week prior. The patient had a body temperature of 36.6°C, a pulse rate of 92 beats per minute, and blood pressure of 118/76 mmHg. Pallor was observed in the conjunctiva, but no jaundice was observed in the sclera. Heart and lung sounds were normal. The abdomen was flat and soft, with no palpable liver or spleen. Purpura was observed in both lower extremities. Blood test results were as follows: red blood cell count was 3.81 million/μL, hemoglobin was 12.6 g/dL, hematocrit was 36%, white blood cell count was 2400/μL (myeloblasts 9%, promyelocytes 60%, segmented neutrophils 12%, lymphocytes 19%), and platelet count was 16,000/μL. Biochemical blood test results were as follows: total protein was 7.7 g/dL, albumin was 4.8 g/dL, total bilirubin was 1.1 mg/dL, direct bilirubin was 0.1 mg/dL, AST was 29 U/L, ALT was 30 U/L, LD was 365 U/L (normal range: 120-245), ALP was 110 U/L (normal range: 38-113), blood urea nitrogen was 18 mg/dL, creatinine was 1.1 mg/dL, uric acid was 9.3 mg/dL, Na was 143 mEq/L, K was 3.9 mEq/L, Cl was 107 mEq/L, and Ca was 9.3 mg/dL. CRP was 0.3 mg/dL. A May-Giemsa-stained bone marrow smear is shown separately. Which drug should be administered to this patient?", "choices_en": ["Imatinib", "Gefitinib", "Cyclosporin", "Bleomycin", "All-trans retinoic acid"], "asnwer": ["e"], "answer": ["e"]}
{"problem_id": "116A24", "problem_text_en": "A 45-year-old man came to the clinic with a chief complaint of hoarseness. He has had hoarseness without cause for two years, along with a feeling of a foreign body in the throat and chronic cough. He has no history of smoking or drinking. A laryngoscopic image is shown separately. What is the most likely cause?", "choices_en": ["Laryngeal cancer", "Vocal cord nodule", "Laryngeal papilloma", "Vocal cord polyp", "Laryngeal leukoplakia (plaque) disease"], "asnwer": ["c"], "answer": ["c"]}
{"problem_id": "116A25", "problem_text_en": "A 13-year-old girl developed discomfort and abdominal pain during a basketball game and was brought to the hospital with a teacher. She had eaten a bento (boxed meal) provided at the venue and played the game about 1 hour after the meal. Ten minutes after the start of the game, she developed discomfort, widespread skin itching, and severe abdominal pain. The main side dish of the bento was squid, which she had not eaten for about a year. By the time of the examination, the peak of discomfort and abdominal pain had passed. She was conscious, with a body temperature of 36.8℃, a pulse rate of 80 beats per minute, a respiratory rate of 18 breaths per minute, and blood oxygen saturation of 100% on room air. There were no abnormal sounds in her breathing. Her abdomen was flat, soft, and showed mild erythema and wheals. Her blood test results were: red blood cells 4.3 million, Hb 12.5 g/dL, white blood cells 4,800 (neutrophils 42%, eosinophils 2%, lymphocytes 56%), and platelets 210,000. CRP was 0.3 mg/dL. Which of the following is the most appropriate response to this case?", "choices_en": ["To force someone to quit extracurricular activities.", "Prohibit the consumption of squid.", "Conduct a prick test.", "Eating before exercise is prohibited.", "Administering steroid medication before exercise."], "asnwer": ["c"], "answer": ["c"]}
{"problem_id": "116A26", "problem_text_en": "A 30-year-old man complains, \"I've been concerned about my poor work performance for about three months now,\" and wants a medical interview with the occupational health physician. Due to an outbreak of COVID-19, he has been working from home for about six months and his meetings are held online. He lives with his wife and three-year-old son, but he becomes irritated because of the noise around his home or caring for his son, and cannot concentrate on his work. He started drinking alcohol to sleep about a month ago, but since then he has become more depressed when he wakes up in the morning. He feels tired every day and says he finds himself lost in thought. Which of the following would not be an appropriate response from the occupational health physician?", "choices_en": ["Recommend consulting a psychiatrist.", "Advise to stop drinking alcohol before bed.", "Conduct an interview with the superior with the consent of the individual.", "Listen carefully to the details of how the work needs to be done and what it involves.", "Encourage to be patient until the epidemic of infectious disease subsides."], "asnwer": ["e"], "answer": ["e"]}
{"problem_id": "116A27", "problem_text_en": "An 81-year-old male is brought in by ambulance due to dyspnea. He was diagnosed with COPD at a nearby clinic and had been receiving treatment with bronchodilators. He developed dyspnea around 2:00 am today and was transported by ambulance at 8:00 am with oxygen administered via nasal cannula at a rate of 0.5 L/min. He is alert and conscious, has a temperature of 38.3°C, a heart rate of 72 beats per minute and regular, a blood pressure of 128/64 mmHg, and a respiratory rate of 16 breaths per minute. Bilateral breath sounds are diminished on pulmonary auscultation. Laboratory findings show a white blood cell count of 9,800/mm3 with 91% neutrophils, 0% eosinophils, 5% monocytes, and 4% lymphocytes. CRP is 4.0 mg/dL. Arterial blood gas analysis (with oxygen administered via a nasal cannula at a rate of 0.5 L/min) reveals a pH of 7.33, PaCO2 of 58 Torr, PaO2 of 62 Torr, and HCO3- of 30 mEq/L. Chest CT findings (A) and sputum Gram staining results (B) are shown separately. Which of the following should be the first step taken?", "choices_en": ["Administer vaccine for the causative organism.", "Start noninvasive positive pressure ventilation.", "Increase oxygen flow through nasal cannula.", "Begin respiratory rehabilitation.", "Administer an aminoglycoside antibacterial agent."], "asnwer": ["b"], "answer": ["b"]}
{"problem_id": "116A28", "problem_text_en": "A 23-year-old man presents with fatigue, loss of appetite, and nausea. Symptoms began a week ago, and yesterday he started to pass brown-colored urine. He has no diarrhea and drinks alcohol on occasion. He reported having had male-to-male sexual contact one month ago. He is conscious and alert with a body temperature of 37.2℃. Conjunctival icterus is noted. The liver is palpable 2 cm below the right costal margin, with mild tenderness. Laboratory tests reveal: RBC 4.9 million/μL, Hb 14.5 g/dL, Hct 42%, WBC 6,300 (neutrophils 42%, eosinophils 1%, basophils 1%, monocytes 9%, lymphocytes 45%, atypical lymphocytes 2%), platelets 280,000/μL, PT-INR 1.1 (normal range 0.9-1.1), total protein 7.2 g/dL, albumin 3.9 g/dL, IgG 1,140 mg/dL (normal range 960-1,960), IgM 473 mg/dL (normal range 65-350), total bilirubin 8.1 mg/dL, direct bilirubin 5.7 mg/dL, AST 984 U/L, ALT 822 U/L, LD 423 U/L (normal range 120-245), ALP 143 U/L (normal range 38-113), and γ-GT 266 U/L (normal range 8-50). Immunological tests reveal: HBs antigen negative, IgM-type HBc antibody negative, HCV antibody negative, HCV-RNA negative, IgM-type HA antibody positive, IgA-type HEV antibody negative, and RPR non-reactive (non-reactive at a dilution factor of less than 1), while TPHA is reactive at 320 times the dilution factor (normal range less than 80 times the dilution factor). What disease is most likely to cause these symptoms in the patient?", "choices_en": ["Hepatitis A", "Hepatitis B", "Hepatitis C", "Hepatitis D", "Hepatitis E"], "asnwer": ["a"], "answer": ["a"]}
{"problem_id": "116A29", "problem_text_en": "A 40-year-old male patient is complaining of difficulty writing. He noticed that he couldn't write well when signing documents three years ago, but gradually it began to affect his work. He has no other problems in his daily life. Neurological examination shows normal muscle tone and no involuntary movements. There is no limb weakness, and tendon reflexes are normal. There is no evidence of ataxia or sensory disturbance. When instructed to write with a pencil, the proximal and distal interphalangeal joints of the index and middle fingers flex strongly, resulting in distorted handwriting. \nWhat is the possible condition?", "choices_en": ["Writer's cramp", "Spasmodic torticollis", "Essential tremor", "Dyskinesia", "Asterixis"], "asnwer": ["a"], "answer": ["a"]}
{"problem_id": "116A30", "problem_text_en": "A 42-year-old man comes to the hospital with complaints of lower abdominal pain and nausea. He has been generally healthy and had no abnormalities detected in a routine check-up six months ago. He felt a sense of bloating on the right side of the abdomen after breakfast, which gradually worsened and rapidly became severe pain. After crouching and remaining still for a few minutes, the pain improved temporarily but worsened again in about 10 minutes, along with nausea and vomiting. The pain and nausea persisted in cycles of a few minutes to tens of minutes, and he came to the hospital by taxi. He has no fever. The pain has gradually shifted downward and he now complains of right lower quadrant pain, but he still feels a stiff discomfort from the right side of the abdomen to the back. What is the expected finding?", "choices_en": ["Urine occult blood 3+", "Bilateral hydronephrosis", "Red blood cell casts + in urine sediment", "Serum creatinine level of 10.2 mg/dL", "Urinary protein/creatinine ratio 5.5g/gCr"], "asnwer": ["a"], "answer": ["a"]}
{"problem_id": "116A31", "problem_text_en": "A 48-year-old woman presents with complaints of dry mouth and fatigue. She had a fever and abdominal pain five days ago, but her appetite is normal. She is alert and oriented, with a temperature of 36.8°C, heart rate of 84 bpm and blood pressure of 108/68 mmHg. There are no abnormalities in her eyelids or conjunctiva. Her abdomen is flat and soft, with no palpable liver or spleen. Urinalysis shows no protein, positive glucose and ketones, and negative occult blood. Blood tests reveal a hemoglobin level of 13.2 g/dL, white blood cell count of 9,500, and platelet count of 240,000. Biochemical analysis shows a blood glucose level of 440 mg/dL, HbA1c of 5.8% (reference range 4.6-6.2%), and C-peptide level of 0.2 ng/mL (reference range 0.8-2.5). Which of the following is an appropriate explanation for the patient?", "choices_en": ["\"You will get better with diet and exercise\"", "\"Immediately use insulin\"", "\"We will start the treatment of diabetes with oral medication first.\"", "\"Since the HbA1c is normal, it cannot be classified as diabetes.\"", "\"Please come back for a follow-up examination in six months.\""], "asnwer": ["b"], "answer": ["b"]}
{"problem_id": "116A32", "problem_text_en": "A male neonate, 10 hours old, was born at 39 weeks gestation with a weight of 2,960g and Apgar scores of 7 at 1 minute and 8 at 5 minutes. The midwife noticed cyanosis and reported it to the physician although it was not detected at birth. The baby has a body temperature of 36.9°C, a heart rate of 128 beats/minute, a respiratory rate of 38 breaths/minute, and SpO2 (room air) of 76% (upper limbs) and 75% (lower limbs). High-concentration oxygen therapy did not improve the cyanosis. Echocardiography revealed four cardiac chambers, but no blood flow was observed from the right ventricle to the pulmonary artery. A small amount of blood flow from the ductus arteriosus to the pulmonary artery was observed. Which is the most appropriate initial response for this neonate?", "choices_en": ["Administering diuretics", "Administration of dopamine", "Administration of digoxin", "Prolonged high-concentration oxygen therapy", "Administration of prostaglandin E1"], "asnwer": ["e"], "answer": ["e"]}
{"problem_id": "116A33", "problem_text_en": "A 73-year-old man presents with left lower extremity pain while walking. He has been experiencing pain in his left calf after walking approximately 400 meters for the past two months, but the pain disappears when he stops and rests. He has now come to the clinic because he has been experiencing symptoms after walking only about 200 meters. The patient has been receiving regular medication for diabetes since the age of 43. Seven years ago, he underwent coronary artery stenting for angina, and he has been undergoing dialysis treatment for the past five years. He has been smoking 20 cigarettes a day since he was 20 and drinks alcohol on occasion. He is alert and oriented. His height is 169 cm, weight is 57 kg, and his body temperature is 35.9°C. His pulse rate is 84 beats/min and regular, blood pressure is 158/92 mmHg, and respiratory rate is 20 breaths/min. His SpO2 is 95% on room air. On the ankle-brachial index (ABI) test, his right ABI value is 0.91 and left ABI value is 0.65. The following is a conversation between a resident and an attending physician: Attending Physician: \"How would you describe this patient's symptoms?\" Resident: \"①I think it's intermittent claudication.\" Attending Physician: \"What are some of the underlying conditions?\" Resident: \"②Neurological conditions such as lumbar spinal stenosis and ③vascular conditions such as femoral artery stenosis.\" Attending Physician: \"What does his ABI value suggest?\" Resident: \"④It suggests a high possibility of peripheral arterial occlusive disease.\" Attending Physician: \"What tests will you perform in the future?\" Resident: \"⑤We are planning to conduct gadolinium-enhanced MRI scan.\"Which of the following underlined statements is incorrect?", "choices_en": ["① (This is not a phrase or word, but a symbol meaning \"number one\" or \"first\")", "Sorry, ② is a number or symbol and cannot be translated without further context. Please provide more information or context.", "Sorry, but you have only provided the number ③ which can represent anything like an answer choice, page number or question number. Please provide more context so I can accurately translate it.", "Sorry, as number ④ can represent different things depending on the context, it cannot be accurately translated without further information about the question. Please provide more context or information for me to assist you better.", "Sorry, it is not possible to translate the choice ⑤ as it is a numeric character and it doesn't have any meaning on its own. We need more context or information about the question or answer choices to provide an accurate translation."], "asnwer": ["e"], "answer": ["e"]}
{"problem_id": "116A34", "problem_text_en": "A newborn on the day of birth. Full term at 40 weeks, weighing 3,020 g, and with Apgar scores of 8 at 1 minute and 9 at 5 minutes after birth. The midwife noticed some abnormal features of the external genitalia and reported to the doctor. A photograph of the external appearance is shown separately. No tumor is palpable in the inguinal region. What is the most appropriate information to provide to the parents?", "choices_en": ["\"The genitals are immature, making it impossible to determine the gender immediately\"", "\"We will determine the sex while observing about 1 year of growth\"", "\"We will confirm again later, but probably it is a female child.\"", "\"Sex can be determined by performing a chromosomal test\".", "\"It is a state referred to as intersex.\""], "asnwer": ["a"], "answer": ["a"]}
{"problem_id": "116A35", "problem_text_en": "A 52-year-old man visits the hospital with the chief complaint of general malaise. He was diagnosed with advanced lung adenocarcinoma six weeks ago and received initial treatment with immune checkpoint inhibitors three weeks ago. He accessed medical care because of the emergence of systemic fatigue. He is alert, but his replies are delayed. His temperature is 36.8°C. His pulse rate is 108 beats/min and regular. His blood pressure is 72/50 mmHg. His respiratory rate is 20 breaths/min. His SpO2 is 97% (room air). A mildly enlarged thyroid gland is palpable. His laboratory test results are as follows: red blood cells, 3.2 million/mm3; Hb, 12.0 g/dL; Ht, 38%. His biochemistry results are as follows: blood glucose, 104 mg/dL; TSH, 0.1 μU/mL (reference range, 0.2 to 4.0); ACTH 2.0 pg/mL (reference range, 0 to 60); FT4, 1.8 ng/dL (reference range, 0.8 to 2.2); cortisol, 0.1 μg/dL (reference range, 5.2 to 12.6). Chest radiography shows a reduction in the primary lesion. A thyroid ultrasound examination reveals no abnormalities other than mild thyroid gland enlargement. Which of the following is an appropriate treatment?", "choices_en": ["Red blood cell transfusion", "Insulin administration", "Administration of cell-killing anticancer drugs", "Thyroid hormone administration", "Adrenal cortex steroid administration"], "asnwer": ["e"], "answer": ["e"]}
{"problem_id": "116A36", "problem_text_en": "A 63-year-old man presents to the hospital with chief complaints of abdominal pain and distension. Two years ago, he had noticed a swelling near the umbilicus that had previously disappeared when he was in a supine position. However, three hours ago, he noticed that the swelling persisted and was associated with worsening abdominal pain. He has a history of alcohol-induced cirrhosis and has been admitted and discharged multiple times due to this. He has no history of abdominal surgery. On admission, he is alert and conscious. He is 169cm tall and weighs 68kg. His body temperature is 36.5℃. His pulse is 58 beats per minute and regular, and his blood pressure is 178/94 mmHg. There are no abnormalities in the conjunctiva or eyeballs. There are no abnormal heart or breath sounds. The abdomen is distended and tense, and a wave motion can be observed. Bowel sounds are increased. A protrusion can be seen near the umbilicus. Blood test results show a red blood cell count of 3.95 million, Hb of 12.0 g/dL, Ht of 36%, white blood cell count of 5,800, and platelet count of 90,000. Biochemical findings show a total protein level of 5.1 g/dL, albumin level of 2.1 g/dL, total bilirubin level of 0.5 mg/dL, AST level of 62 U/L, ALT level of 54 U/L, LD level of 252 U/L (reference range 120-245), ALP level of 85 U/L (reference range 38-113), γ-GT level of 59 U/L (reference range 8-50), amylase level of 90 U/L (reference range 37-160), blood urea nitrogen level of 25 mg/dL, serum creatinine level of 1.7 mg/dL, blood glucose level of 195mg/dL, Na level of 138 mEq/L, K level of 4.8 mEq/L, and Cl level of 107 mEq/L. His CRP level is 0.2 mg/dL. An abdominal CT scan is shown separately. Attempted manipulations did not succeed. Which of the following is an appropriate approach to managing this patient?", "choices_en": ["Perform emergency surgery.", "Administering a laxative.", "Administer pain relievers.", "Repeatedly performing manual therapy.", "Perform a puncture of the umbilical prominence."], "asnwer": ["a"], "answer": ["a"]}
{"problem_id": "116A37", "problem_text_en": "A 72-year-old woman initially underwent examination for thrombocytopenia at a medical facility near her home, but was hospitalized due to the onset of psychiatric symptoms. She visited a medical facility near her home with cold-like symptoms, where a decrease in platelets to 56,000 was noted. The next day, she developed inconsistent speech and behavior and was hospitalized. Her consciousness level is JCS I-2. Her body temperature is 37.9℃. Her pulse rate is 76/min and regular, and her blood pressure is 156/96 mmHg. Palpebral conjunctiva is pale, and mild jaundice is observed in the bulbar conjunctiva. A Levine grade 2/6 systolic ejection murmur is heard at the second right sternal border of the sternum. No abnormal respiratory sounds are observed. No abnormalities are found in the abdomen. Urine test: protein 2+, occult blood 3+. Blood test: red blood cells 2.3 million, Hb 6.1 g/dL, Ht 26%, white blood cells 9,700, platelets 47,000, PT-INR 1.1 (0.9-1.1), APTT 26.1 seconds (reference range 32.2), FDP 9 µg/mL (reference range ≤ 10). Biochemical test: total bilirubin 2.4 mg/dL, direct bilirubin 0.5 mg/dL, AST 50 U/l, ALT 40 U/l, LD 1,150 U/l (reference range 120-245), blood urea nitrogen 70 mg/dL, and creatinine 2.5 mg/dL. A peripheral blood smear May-Giemsa staining specimen is separately shown. Which of the following is the most appropriate treatment for this patient?", "choices_en": ["Antibiotics administration", "Heparin administration", "Plasma exchange therapy", "Platelet transfusion", "Administration of thrombopoietin receptor agonists"], "asnwer": ["c"], "answer": ["c"]}
{"problem_id": "116A38", "problem_text_en": "A 62-year-old man is diagnosed with descending colon cancer and is scheduled to undergo left hemicolectomy through laparotomy. He has a history of appendicitis with peritonitis and was hospitalized for one month when he was 28 years old. His height is 175 cm, weight is 60 kg, body temperature is 36.2°C, pulse rate is 76 beats/min and regular, blood pressure is 120/70 mmHg, and respiratory rate is 14 breaths/min. There are no abnormal findings in the conjunctiva or eyeball. No abnormalities are found in heart sounds or breathing sounds. His abdomen is flat, soft, and liver and spleen are not palpable. Surgical scars are visible on the lower right abdomen and midline of the abdomen. Blood test results showed red blood cells at 4.1 million, Hb 13.8 g/dL, Ht 42%, white blood cells 5,200, and platelets 160,000. PT-INR was 1.0 (reference range 0.9-1.1) and APTT was 29.0 seconds (reference range 32.2-45.7). Biochemical tests showed total protein 7.4 g/dL, albumin 4.0 g/dL, total bilirubin 0.8 mg/dL, AST 18 U/L, ALT 20 U/L, LD 196 U/L (reference range 120-245), ALP 102 U/L (reference range 38-113), creatinine 0.8 mg/dL, Na 140 mEq/L, K 3.8 mEq/L, Cl 100 mEq/L, and CEA 5.2 ng/mL (reference range 5 or lower). Which of the following is appropriate for the patient's perioperative management?", "choices_en": ["Solid food intake is allowed up to 2 hours before surgery.", "Bed rest is necessary for 3 days after the surgery.", "Begin liquid diet from the first week after surgery.", "Maintain the patient's body temperature at room temperature during surgery.", "Perform pain control with continuous epidural anesthesia."], "asnwer": ["e"], "answer": ["e"]}
{"problem_id": "116A39", "problem_text_en": "A 20-year-old woman presents to the clinic with abdominal rash. Multiple rashes on her abdomen have persisted for a month and have not disappeared. There is no itchiness or fever. Her mother also has a similar rash, which is often accompanied by Kaposi's varicelliform eruption since she was 15. The patient has multiple brown papules on her neck, axilla, costal margin, submammary area, abdomen, and groin. The same mutation in the ATP2A2 gene has been identified in the patient and her mother. Abdominal photographs (A) and H-E stained biopsy specimens (B) are presented separately. What is the most likely diagnosis?", "choices_en": ["Sweet's syndrome", "Darier disease", "Kaposi's sarcoma", "Pemphigus vulgaris", "Atopic dermatitis"], "asnwer": ["b"], "answer": ["b"]}
{"problem_id": "116A40", "problem_text_en": "A 15-year-old boy came to the hospital with his family complaining of pain in his lower limbs and dark red-brown colored urine. Three days prior, he participated in a baseball club practice and experienced headaches and weakness in his lower limbs during vigorous training under the hot sun, but improved with drinking water and rest. He continued his practice with feeling muscle pain in the anterior thigh of both legs 2 days ago. He visited the hospital because dark red-brown urine appeared from last night. His consciousness is clear. His height is 167 cm, weight is 62 kg, body temperature is 37.1°C, pulse rate is 84/min and regular, blood pressure is 134/62 mmHg, respiratory rate is 16/min, and SpO2 on room air is 98%. No abnormalities are found in heart sounds and breath sounds. He feels pain in the lower back and both thighs. There are no abnormalities in the neurological examination. Urinalysis revealed dark brown color, specific gravity of 1.022, pH of 6.5, positive for protein, 3+ for occult blood, and 1-4 red blood cells/HPF in the sediment. The blood test results showed red blood cells of 5.36 million/µL, hemoglobin of 16.0 g/dL, hematocrit of 45%, white blood cells of 9,000/µL, and platelets of 280,000/µL. The blood biochemistry results showed a total protein of 6.7 g/dL, albumin of 4.2 g/dL, AST of 1,927 U/L, ALT of 366 U/L, and CK of 155,150 U/L (reference range 30-140), urea nitrogen of 8.7 mg/dL, creatinine of 0.6 mg/dL, uric acid of 4.6 mg/dL, sodium of 142 mEq/L, potassium of 4.0 mEq/L, and chloride of 105 mEq/L. Which of the following is the appropriate composition of the initial fluid therapy to be administered to this patient?", "choices_en": ["5% glucose solution", "Na+ 154mEq/L, Cl- 154mEq/L", "Na+ 84mEq/L, K+ 20mEq/L, Cl- 66mEq/L, L-Lactate- 20mEq/L", "Na+ 84mEq/L, K+ 200mEq/L, Cl- 66mEq/L, L-Lactate- 20mEq/L", "Na+ 30mEq/L, Cl- 20mEq/L, L-Lactate- 20mEq/L"], "asnwer": ["b"], "answer": ["b"]}
{"problem_id": "116A41", "problem_text_en": "A 45-year-old man complains of hearing loss and tinnitus in his right ear. He suddenly began experiencing difficulty hearing from his right ear this morning and also began hearing a buzzing sound. He did not experience any dizziness. No abnormalities were found in his tympanic membrane. An audiogram is shown separately. A head MRI was normal. What is the appropriate treatment for this patient?", "choices_en": ["Antibiotics", "Diuretic", "Antiviral drugs", "Gamma globulin", "Adrenal cortex steroid"], "asnwer": ["e"], "answer": ["e"]}
{"problem_id": "116A42", "problem_text_en": "A 36-year-old woman (G2P0) complained of abdominal pain at 36 weeks and 4 days of gestation. At the time of presentation, she was 152 cm tall, weighed 68 kg, had a body temperature of 36.8°C, a pulse rate of 110 bpm (regular), and a blood pressure of 162/108 mmHg. Her abdomen was rigid, the cervical dilation was 6 cm, and a blood clot was observed in the vagina. The estimated fetal weight was 2,300 g, and the thickness of the placenta was 7 cm on ultrasound examination. Fetal heart rate and uterine contraction monitorings are shown separately. What is the appropriate management?", "choices_en": ["Emergency cesarean section", "Hemostatic agent intravenous injection", "Intravenous infusion of uterine contraction agent", "Corticosteroid injection into muscle", "Magnesium sulfate IV injection"], "asnwer": ["a"], "answer": ["a"]}
{"problem_id": "116A43", "problem_text_en": "A 28-year-old man presents with epigastric pain. He has experienced mild epigastric pain on an empty stomach for the past two weeks, but he came to the hospital because it worsened since yesterday. He has repeatedly received drug therapy for duodenal ulcer since he was 20 years old. He underwent transsphenoidal surgery for pituitary adenoma at the age of 25. He is 176 cm tall and weighs 64 kg. His temperature is 36.2°C, and his pulse rate is 96 bpm and regular. His blood pressure is 98/62 mmHg. His abdomen is flat and soft with slight tenderness in the upper abdomen. Digital rectal examination reveals black stool adhesion. Laboratory findings are as follows: red blood cell count: 3.6 million, Hb: 11.5 g/dL, Hct: 36%, white blood cell count: 8,800, and platelets: 290,000. Biochemical findings include a total protein of 6.9 g/dL, albumin of 3.6 g/dL, ALP of 192 U/L (reference range: 38-113), BUN of 20 mg/dL, creatinine of 0.8 mg/dL, Ca of 11.6 mg/dL, and P of 2.2 mg/dL. Upper gastrointestinal endoscopy shows multiple gastric and duodenal ulcers. Ultrasonography of the neck reveals a 0.5 cm tumor on the posterior side of the thyroid gland. Abdominal contrast-enhanced CT shows a strongly enhanced 1-cm tumor in the pancreatic body. What hormone is likely to be elevated in this patient?", "choices_en": ["Thyroid-stimulating hormone", "Adrenocorticotropic hormone", "Gastrin", "Catecholamines", "Testosterone"], "asnwer": ["c"], "answer": ["c"]}
{"problem_id": "116A44", "problem_text_en": "A 22-year-old woman presents with amenorrhea. She had her first menstrual period at the age of 12 years and developed irregular menstruation at 13 years, which progressed to amenorrhea at 14 years. She has no particular complaints, but visited a obstetrics and gynecology clinic on the recommendation of a coworker. There is no significant family or medical history. She is 164 cm tall, weighs 56 kg, and has a body temperature of 36.8°C. Her pulse rate is 72 beats per minute and regular, and her blood pressure is 106/76 mmHg. There is no thyroid enlargement. Her breast development is poor, but compressing the nipples yields milk secretion from both sides. Her external genitalia are female and there are no abnormalities in pubic or axillary hair growth. The uterine length is 3 cm and the endometrium is thin. Both ovaries are of normal size. Her basal body temperature is of the one-phase type. Which of the following is expected to be high?", "choices_en": ["GH stands for Growth Hormone.", "Follicle-stimulating hormone (FSH)", "Thyroid-stimulating hormone", "Adrenocorticotropic hormone (ACTH)", "Prolactin"], "asnwer": ["e"], "answer": ["e"]}
{"problem_id": "116A45", "problem_text_en": "A 38-year-old woman presented with right knee pain as her chief complaint. She injured her right knee three weeks ago while practicing volleyball, and came for a consultation because the pain did not improve. An MRI examination revealed a complete tear of the right medial meniscus. Separate arthroscopic views of the right knee joint (①-⑤) are shown below. Which image indicates the tear of the meniscus?", "choices_en": ["① - This is a number denoting one of the options or choices in a question or exam. In English, it is simply \"1\".", "② (This is not a word or phrase, but a numerical choice in a multiple-choice question. It would remain the same in English.)", "Sorry, ③ is a number or symbol and cannot be translated without context. Please provide more information.", "This is not a word or phrase, but rather a number or symbol. It cannot be translated into English without additional context. In a multiple-choice question, it likely represents one of the answer choices.", "Sorry, ⑤ alone doesn't have a meaning or context, as it is a number or symbol used for labeling choices or options in a multiple-choice question. Can you please provide more information about the question or the other choices?"], "asnwer": ["d"], "answer": ["d"]}
{"problem_id": "116A46", "problem_text_en": "A 53-year-old man visited a doctor complaining about snoring after being pointed out by his family. A friend he met for the first time in 10 years told him that his nose had become bigger, changing his appearance. He has been experiencing tightness in his shoes lately. He had carpal tunnel surgery two years ago. He is 173 cm tall and weighs 72 kg. His body temperature is 36.4°C. His pulse rate is 56 beats per minute and regular. His blood pressure is 156/90 mmHg. Blood biochemistry test showed AST at 38 U/L, ALT at 42 U/L, ALP at 256 U/L (normal range: 38-113), fasting blood glucose at 126 mg/dL, total cholesterol at 254 mg/dL, triglyceride at 216 mg/dL, and HDL cholesterol at 48 mg/dL. What endocrine examination is necessary for a definitive diagnosis of this patient?", "choices_en": ["GHRH stimulation test", "Oral glucose tolerance test", "Insulin tolerance test", "Glucagon stimulation test", "Dexamethasone suppression test"], "asnwer": ["b"], "answer": ["b"]}
{"problem_id": "116A47", "problem_text_en": "A 32-year-old woman who was forced into non-consensual sexual activity last night came to the hospital today with a police officer accompanying her. After receiving an explanation of the circumstances of the incident from the officer, the woman will be examined. Her menstrual cycle is 28 days long with regular and normal intervals. Her last menstrual period was five days from 12 days before today. Which of the following is NOT an appropriate response?", "choices_en": ["To conduct a test for sexually transmitted infections.", "To suggest emergency contraception.", "Obtain the individual's consent regarding gynecological examination.", "Collecting a sample for DNA diagnosis from inside the vagina.", "Reconfirm the situation of the damage by listening to the person again."], "asnwer": ["e"], "answer": ["e"]}
{"problem_id": "116A48", "problem_text_en": "A 10-month-old boy is brought to the hospital by his mother due to vomiting and bloody stools. He has been vomiting suddenly since this morning, occasionally crying intensely, and has had several instances of bloody stools during the day. He is conscious, but irritable and crying intensely. His body temperature is 37.2℃, pulse rate is 160/min and regular, blood pressure is 84/52 mmHg, respiratory rate is 30/min, capillary refill time is 1 second, and SpO2 is 99% on room air. No abnormality is detected in his heart sounds and breath sounds. The abdomen is soft and a mass is palpated in the right upper quadrant. Blood test results show no abnormality. Abdominal X-ray shows no intestinal gas image or air-fluid levels, and no free intraperitoneal gas image. Abdominal ultrasound image shows target sign. Which of the following is the appropriate explanation to give to the guardians?", "choices_en": ["\"If high-pressure enema can correct [the condition], you can go home.\"", "\"Antibiotics are necessary to suppress inflammation.\"", "\"Emergency surgery is necessary due to the complication of peritonitis.\"", "\"Let's confirm the state of the bowel movement by administering a glycerin enema.\"", "\"If reduction cannot be achieved with high-pressure enema, laparotomy will be performed.\""], "asnwer": ["e"], "answer": ["e"]}
{"problem_id": "116A49", "problem_text_en": "A 45-year-old man presents with chief complaints of shortness of breath and fatigue during physical exertion. He has been aware of shortness of breath during cycling trips for the past five years. Gradually, symptoms have begun to occur with lighter physical exertion, and for the past six months, he has experienced shortness of breath during a 15-minute commute and found it difficult to climb stairs rapidly. Although he was noted to have a heart murmur during his company’s health checkup, further examination was not performed. No significant family history was noted. He is alert and oriented. His body temperature is 36.0°C. His resting pulse rate is 88/min and regular. Blood pressure is 124/72 mmHg. Respiratory rate is 16/min. Oxygen saturation (SpO2) is 95% on room air. No abnormal respiratory sounds are detected. A Levine grade 4/6 systolic murmur is present. Electrocardiography shows left ventricular hypertrophy and triplet ectopic beats. Echocardiography shows an end-diastolic LV diameter of 60 mm, an LV ejection fraction of 40%, and a diagnosis of mitral valve stenosis. Continuous-wave Doppler measurement shows a maximum blood flow velocity across the aortic valve of 5.0 m/s and an estimated aortic valve area of 0.65 cm2. What is the appropriate response?", "choices_en": ["Aortic valve replacement surgery", "Implantation of implantable cardioverter defibrillator (ICD)", "Treadmill exercise stress ECG.", "Echocardiogram after 6 months without treatment", "Administration of human atrial natriuretic peptide (hANP)"], "asnwer": ["a"], "answer": ["a"]}
{"problem_id": "116A50", "problem_text_en": "A 35-year-old man presents with cough, fever, and dyspnea. He reports having had a nonproductive cough for 3 weeks and developed fever and dyspnea 5 days ago. He had cleaned his 30-year-old house 1 month ago. He is conscious and alert. His height is 168 cm, weight is 80 kg, temperature is 38.4°C, pulse rate is 104/min and regular, blood pressure is 112/62 mmHg, respiratory rate is 18/min, and oxygen saturation on room air is 90%. There are no abnormal heart sounds or breath sounds. Laboratory findings include hemoglobin of 12.6 g/dL, WBC of 10,500/μL with 74% neutrophils, 4% eosinophils, 0% basophils, 3% monocytes, and 19% lymphocytes, platelets of 300,000/μL, normal liver and kidney function, and CRP of 10 mg/dL. A chest X-ray (A) and chest CT scan (B) are shown. What is the most likely diagnosis?", "choices_en": ["Hypersensitivity pneumonitis", "Idiopathic pulmonary fibrosis", "Nontuberculous mycobacterial disease", "Mycoplasma pneumonia", "COVID-19 pneumonia"], "asnwer": ["a"], "answer": ["a"]}
{"problem_id": "116A51", "problem_text_en": "A 14-day-old male infant came to the hospital with his parents for chromosome testing results. He was born at 39 weeks of gestation with a birth weight of 2,800g and had Apgar scores of 8 at 1 minute and 9 at 5 minutes. He now weighs 3,300g and has a body temperature of 36.5℃, a heart rate of 120 beats per minute, a respiratory rate of 40 breaths per minute, and an SpO2 of 98% on room air. He exhibits facial abnormalities such as up-slanting palpebral fissures, a flat and low nasal bridge, and a tongue that protrudes from the mouth. There are no abnormalities in heart sounds or breath sounds, but mild abdominal distension is observed. He has a single palmar crease and decreased muscle tone. Additional results from the chromosome testing are also available. Which of the following is most likely to develop in this infant in the future?", "choices_en": ["Cerebral palsy", "Wilms tumor (a type of kidney cancer that usually affects children)", "Otitis media with effusion", "Intractable diarrhea syndrome", "Hyperthyroidism"], "asnwer": ["c"], "answer": ["c"]}
{"problem_id": "116A52", "problem_text_en": "A 19-year-old male was exposed to sodium hydroxide solution in the right eye during an experiment and sought emergency medical attention. The patient is conscious, with marked conjunctival edema and corneal opacification in the right eye. What should be done first?", "choices_en": ["Oral administration of painkillers", "Instillation of dilute hydrochloric acid solution", "Intravenous infusion of antibiotics.", "Eye irrigation with saline solution", "Intravenous infusion of high osmotic diuretics"], "asnwer": ["d"], "answer": ["d"]}
{"problem_id": "116A53", "problem_text_en": "A 76-year-old man is accompanied by caregivers from a nursing facility and presents with worsening sputum production as the chief complaint. He underwent total gastrectomy for gastric cancer eight years ago. Subsequently, he experienced weight loss and developed sputum production five years ago. He consulted now because of an increase in sputum production and difficulty expectorating for one week. He is 157 cm tall and weighs 41 kg. His body temperature is 37.5℃. His pulse rate is 72/min and regular. His blood pressure is 134/84 mmHg. His respiratory rate is 18/min and his SpO2 is 96% (room air). Coarse crackles are heard on both sides of his chest. His skin turgor is reduced. Laboratory findings are as follows: RBC 4.24 million/μL, Hb 13.6 g/dL, Ht 28%, WBC 11,400/μL (neutrophils 81%, monocytes 5%, lymphocytes 14%), and platelets 350,000/μL. Biochemical findings are as follows: total protein 7.9 g/dL, serum albumin 2.7 g/dL, blood urea nitrogen 37 mg/dL, and creatinine 0.8 mg/dL. The CRP level is 13 mg/dL. Gram staining of sputum is shown separately. Which of the following antibiotics should be started while waiting for the identification and drug susceptibility test results for this microorganism?", "choices_en": ["Cefazolin", "Piperacillin", "Vancomycin", "Clindamycin", "Benzylpenicillin"], "asnwer": ["b"], "answer": ["b"]}
{"problem_id": "116A54", "problem_text_en": "A 2-year-old boy accompanied by his mother visits the clinic because she is concerned that the TV volume is louder than before. One week ago, the child had ear pain and runny nose on both sides, which resolved within two days. Since then, the child has not been responding to calls frequently. The child's height is 90 cm, weight is 13 kg, and body temperature is 36.5°C. No abnormalities are detected in the auricle or external auditory canal, but the left tympanic membrane shows a different finding. Which of the following would be useful for making a definitive diagnosis?", "choices_en": ["Auditory verbal test", "Pure tone audiometry", "Auditory brainstem response", "Olfactometry", "Impedance audiometry"], "asnwer": ["e"], "answer": ["e"]}
{"problem_id": "116A55", "problem_text_en": "A 24-year-old medical worker accidentally stuck a used injection needle on a patient during blood collection. The test results for the patient and the medical worker are: Patient: HBs antigen (+), HBs antibody (-), HCV antibody (-) Medical worker:  HBs antigen (-), HBs antibody (-), HCV antibody (-). Which of the following is the appropriate response for the medical worker?", "choices_en": ["No medication (literally \"no medicine\")", "Monovalent administration of HB vaccine", "Administration of nucleic acid analog agents", "Monovalent Hepatitis B Immunoglobulin Administration", "Administration of HB vaccine and anti-HBs human immunoglobulin"], "asnwer": ["e"], "answer": ["e"]}
{"problem_id": "116A56", "problem_text_en": "An 18-year-old male presented with a chief complaint of general fatigue and fever. He had been aware of shortness of breath on exertion for two weeks prior to the visit. Three days ago, he had a fever of 38°C and general fatigue, prompting him to seek medical attention. His height was 170 cm, weight was 60 kg, and his temperature was 38.3°C. His pulse rate was 100 bpm, regular. His blood pressure was 118/64 mmHg. Pinpoint bleeding was observed on both lower legs. The conjunctiva was pale, but no jaundice was observed in the sclera. A Levine grade 2/6 systolic ejection murmur was heard at the right sternal border at the second intercostal space. No abnormal respiratory sounds were detected. His abdomen was flat, soft, and there was no palpable liver or spleen. No tenderness was present. Laboratory findings showed 2.3 million RBC, Hb of 6.8 g/dL, Hct of 20%, WBC of 1400 (neutrophils 24%, monocytes 2%, lymphocytes 74%), and platelet count of 12,000. Blood chemistry showed total protein of 6.8 g/dL, albumin of 3.4 g/dL, total bilirubin of 0.7 mg/dL, AST of 56 U/L, ALT of 71 U/L, LDH of 158 U/L (normal range 120-245), blood urea nitrogen of 14 mg/dL, creatinine of 0.7 mg/dL, and blood glucose of 98 mg/dL. The CRP level was 4.2 mg/dL. Bone marrow biopsy showed significant hypoplasia. Which of the following was decreased in this patient?", "choices_en": ["Ferritin", "Reticulocyte count", "Vitamin B12", "Erythropoietin", "Neutrophil alkaline phosphatase score"], "asnwer": ["b"], "answer": ["b"]}
{"problem_id": "116A57", "problem_text_en": "A 2-month-old female infant was brought in by ambulance due to status epilepticus. According to the mother, the infant was sleeping at night when the seizure began. The infant went into cardiac arrest in the ambulance, and despite undergoing cardiopulmonary resuscitation, there were no signs of a pulse upon arrival at the hospital, and the pupillary reflex had disappeared. Cardiopulmonary resuscitation was continued, but the infant was confirmed dead. The Maternal and Child Health Handbook showed no abnormalities in pregnancy and delivery history, but the infant did not receive a one-month checkup. There were scattered subcutaneous hemorrhages, old and new, on the face and trunk. A postmortem head CT scan showed bilateral subdural hematomas and diffuse brain edema. A whole-body X-ray showed a fracture of the left femur and a fracture of the right humerus. The mother had no history of trauma. What is the most likely cause of death?", "choices_en": ["Abuse", "Epilepsy", "Accidental injury/Unforeseen accident", "Febrile convulsions", "Bacterial meningitis"], "asnwer": ["a"], "answer": ["a"]}
{"problem_id": "116A58", "problem_text_en": "A 69-year-old man presented with left nasal bleeding and diplopia. He had experienced repeated left nasal bleeding for one month, and the left nasal obstruction had gradually worsened. He noticed double vision two days ago. The images show contrast-enhanced CT (A) and contrast-enhanced MRI (B) of the paranasal sinuses. A squamous cell carcinoma was identified on biopsy of the left nasal cavity. What is present in this patient?", "choices_en": ["Hearing loss", "Exophthalmos", "Trismus", "Dysgeusia or taste disorder", "Dysphagia"], "asnwer": ["b"], "answer": ["b"]}
{"problem_id": "116A59", "problem_text_en": "An 8-year-old girl presented with a significant itchy rash as the main complaint. Findings on the back are separately shown. Similar rashes are seen throughout the body, including the face, abdomen, elbow creases, and knee creases. White blood cell count is 8,600 (eosinophils 12%). IgE is 2,800 IU/mL (normal range is 250 or less). Antigen-specific IgE testing showed strong positive results for inhalant antigens such as house dust and cedar pollen, but negative for food antigens. What is the notable complication to be aware of?", "choices_en": ["Pneumothorax", "Anemia", "Cataract", "Keratoconus", "Anaphylaxis"], "asnwer": ["c"], "answer": ["c"]}
{"problem_id": "116A60", "problem_text_en": "An 80-year-old man came to the hospital with a complaint of a rash from his left temporal area to his left cheek. Three months ago, a purplish-red patch appeared on his left temple. It gradually enlarged, became raised, and started to bleed. He has been taking anticoagulant medication for atrial fibrillation for 10 years. He does not recall any trigger for the rash. A rash is observed on the left temporal area, but there are no scales. A palpable lymph node is found in the left neck. A photograph of the rash on the left temple is shown separately. What is the most likely condition?", "choices_en": ["Hemangiosarcoma", "Spiny cell carcinoma", "Senile purpura", "Granulomatosis with polyangiitis (GPA)", "Bruising due to anticoagulant medication"], "asnwer": ["a"], "answer": ["a"]}
{"problem_id": "116A61", "problem_text_en": "A 64-year-old man was brought to the emergency department due to left-sided paralysis and altered mental status. On physical examination, his level of consciousness was Glasgow Coma Scale (GCS) E4V4M6, blood pressure was 164/82mmHg, pulse rate was 96/min and irregular. Neurological examination revealed left-sided paralysis, but no carotid bruit was audible on either side. The figure shows the brain MRI (diffusion-weighted image). What is the most likely cardiac diagnosis based on the ECG findings?", "choices_en": ["心房細動 (Shinbou saido)", "Supraventricular tachycardia", "三度房室ブロック (Sande roushitsuburokku)", "心室細動 (Shinshitsu saido)", "心室頻拍"], "asnwer": ["a"], "answer": ["a"]}
{"problem_id": "116A62", "problem_text_en": "A 58-year-old woman presents with a complaint of lower leg edema. She underwent annual workplace health checkups, but no abnormalities were found. She was first found to have proteinuria 6 months ago, but since she had no symptoms, she left it as is. Edema in both lower legs appeared a month ago and gradually worsened, prompting her to seek medical attention. She is 160 cm tall and weighs 60 kg, and has a pulse rate of 64 beats/min, regular, and blood pressure of 132/90 mmHg. No abnormalities are observed in the chest or abdomen. There is pitting edema on both lower legs with no skin abnormalities. Urinalysis shows 3+ protein, negative glucose and occult blood, 0-2 red and white blood cells/HPF, and a small number of hyaline casts. Urine protein is 280 mg/dL and serum creatinine is 70 mg/dL. Blood test results show a red blood cell count of 4.6 million, Hb 13.1 g/dL, Hct 42%, total protein 5.3 g/dL, albumin 2.6 mg/dL, and IgG 1,100 mg/dL (reference range: 960-1,960), IgA 386 mg/dL (reference range: 110-410), IgM 188 mg/dL (reference range 65-350), and LDL cholesterol 213 mg/dL. Immunological blood tests show CRP 0.1 mg/dL and ANA titer 20-fold (reference range: ≤20). PAM staining specimen (A) and Fluorescent Antibody IgG Staining specimen (B) are shown separately in renal biopsy specimens. Congo-Red staining is negative. What is the most likely cause of urinary protein?", "choices_en": ["Membranous nephropathy", "Scleroderma renal crisis", "Diabetic nephropathy", "Amyloid nephropathy", "Minimal change nephrotic syndrome"], "asnwer": ["a"], "answer": ["a"]}
{"problem_id": "116A63", "problem_text_en": "A 78-year-old woman has had a persistent fever in the high 38s for one week and comes to the hospital due to systemic fatigue. She is 151 cm tall and weighs 42 kg. Her body temperature is 38.2°C. Her pulse rate is 92 beats per minute and regular. Her blood pressure is 84/50 mmHg. No abnormalities are observed in her chest or abdomen, and her skin is not dry and her limbs are not swollen. Blood tests show: blood urea nitrogen, 24 mg/dl; creatinine, 0.7 mg/dl; fasting blood sugar, 65 mg/dl; Na, 129 mEq/L; K, 5.1 mEq/L; antidiuretic hormone, 1.4 pg/mL (normal range: 0.5-2.0). Sodium levels in her urine, measured from time to time, were 16 mEq/L. What findings are seen in this patient?", "choices_en": ["Hypouricemia", "Hyporeninemic hypoaldosteronism", "Decreased urine osmolality", "Hypothyroidism", "Hypocortisolism"], "asnwer": ["e"], "answer": ["e"]}
{"problem_id": "116A64", "problem_text_en": "A 61-year-old man presents with a chief complaint of right knee pain. He walks with a single crutch due to the pain. He underwent surgery for colon cancer two months ago and is currently undergoing chemotherapy. His life expectancy is estimated to be over two years. He is alert and oriented. He is 172 cm tall and weighs 75 kg. His right knee has marked varus deformity with a range of motion restriction of 80 degrees of flexion and −20 degrees of extension. Plain X-rays of the right knee joint reveal degenerative knee joint disease and artificial knee joint replacement is indicated. Which of the following combinations of treatment options would be appropriate going forward?", "choices_en": ["Abandonment of cancer and knee treatment", "Knee-conserving treatment after the completion of cancer treatment", "Surgery on the knee after completing cancer treatment", "Conservative knee treatment while continuing cancer therapy.", "Knee surgery while continuing cancer treatment"], "asnwer": ["e"], "answer": ["e"]}
{"problem_id": "116A65", "problem_text_en": "A 35-year-old woman who has had three pregnancies and two deliveries presented for a routine prenatal check-up at 34 weeks and 2 days of gestation. She has received prenatal check-ups since the early stages of pregnancy. At 30 and 32 years of age, she underwent selective cesarean section for indications of breech presentation and a history of previous cesarean section, respectively. She is 157 cm tall and weighs 55 kg (46 kg before pregnancy). Her body temperature is 36.8°C, pulse rate is 80 bpm and regular, and blood pressure is 110/74 mmHg. She is aware of several uterine contractions per day. Fetal heart rate monitoring shows no abnormalities during contractions. A T2-weighted, sagittal MRI image taken one week ago is shown separately. Which of the following descriptions are appropriate? Select two.", "choices_en": ["\"A hematoma is observed on the back surface of the placenta.\"", "\"The placenta is covering the cervix.\"", "\"The umbilical cord vessels are running over the internal cervical os.\"", "\"Part of the placenta has detached from the uterine wall\"", "\"There may be a possibility that the placenta is penetrating the uterine muscle layer.\""], "asnwer": ["b", "e"], "answer": ["b", "e"]}
{"problem_id": "116A66", "problem_text_en": "A 34-year-old woman presents with complaints of anterior chest pain. The chest pain has been present for 3 months and gradually intensifying. Her temperature is 36.8℃, blood pressure is 118/64 mmHg, and SpO2 on room air is 98%. Heart and respiratory sounds are normal. Chest X-ray (A) and contrast-enhanced CT scan of the chest (B) are shown separately. What are the possible diagnoses? Select two.", "choices_en": ["Thymoma", "Neurofibroma", "Pericardial cyst", "Pleural mesothelioma", "Malignant lymphoma"], "asnwer": ["a", "e"], "answer": ["a", "e"]}
{"problem_id": "116A67", "problem_text_en": "A 44-year-old woman came to the clinic after being diagnosed with liver dysfunction during a health check-up. There is nothing noteworthy in her medical history, including transfusions, alcohol consumption, or family history. There is no jaundice in the conjunctiva. Blood test results show red blood cells at 4.96 million, Hb at 14.8 g/dL, Ht at 44%, white blood cells at 5,200, and platelets at 250,000. Blood chemistry shows total protein at 7.5 g/dL, albumin at 3.9 g/dL, AST at 26 U/L, ALT at 32 U/L, ALP at 238 U/L (reference range: 38-113), and γ-GT at 266 U/L (reference range: 8-50). Immunoserology examinations show negative HBs antigen and HCV antibody. A separate H-E stained specimen of the portal vein area of liver biopsy tissue is shown. Which of the following is the expected blood test result? Choose two.", "choices_en": ["High levels of IgM", "Low bile acid levels", "Low total cholesterol", "Anti-mitochondrial antibody positive", "High alpha-fetoprotein (AFP) level"], "asnwer": ["a", "d"], "answer": ["a", "d"]}
{"problem_id": "116A68", "problem_text_en": "A 38-year-old woman presented to the hospital with abdominal pain. She had not had a bowel movement for one week and had been experiencing worsening vomiting, abdominal pain, and abdominal distension. She was conscious and alert with a temperature of 37.2°C, a pulse of 72/min and regular, a blood pressure of 118/62 mmHg, a respiratory rate of 18/min, and a SpO2 of 97% on room air. Her abdomen was distended, with increased bowel sounds. A rectal examination revealed a hard mass in the rectouterine pouch (Douglas pouch). Abdominal X-ray showed dilated intestinal loops with haustration in the supine position, and fluid levels in the upright position. Abdominal CT scan showed dilatation of the small and large bowel with a small amount of fluid in the pelvic cavity. Upper gastrointestinal endoscopy revealed a type 4 gastric cancer. As she was unable to eat due to vomiting, peripheral infusion therapy was started, and she was admitted to the hospital. Which of the following is an appropriate management strategy? Select two.", "choices_en": ["Total gastrectomy", "Gastrostomy", "Swallowing training", "Nasogastric tube insertion", "Central venous nutrition"], "asnwer": ["d", "e"], "answer": ["d", "e"]}
{"problem_id": "116A69", "problem_text_en": "A 22-year-old man is admitted due to cervical spinal cord injury from an 8-week-old fall from a height. Both sides show an upper arm biceps strength of 5, radial wrist extensor strength of 5, triceps brachii strength of 4, deep finger flexion strength of 0, and ulnar deviation strength of the little finger of 0 on manual muscle testing. There is no muscle contraction in the trunk and leg muscles. Bilateral loss of sensation is noted in the ulnar, trunk, both lower limbs and perianal area. Which of the following activities are likely to be acquired? Select two.", "choices_en": ["Self-catheterization", "Wheelchair transfer technique", "Eating movements using chopsticks.", "Level-ground walking with both crutches", "Stair climbing using a long leg orthosis"], "asnwer": ["a", "b"], "answer": ["a", "b"]}
{"problem_id": "116A70", "problem_text_en": "A 68-year-old man presented with complaints of nosebleed and cough. He had been aware of nasal congestion and hearing loss for the past two months. He visited the hospital because of intermittent nosebleeds and coughing for the past three weeks. His consciousness was clear. His body temperature was 37.8℃. His pulse rate was 84/min, regular. Blood pressure was 142/78 mmHg. The respiratory rate was 22/min, oxygen saturation on room air was 97%. Redness and swelling were observed on both eardrums. There were no abnormal heart or breath sounds. His abdomen was flat and soft, with no palpable liver or spleen. There was no edema in his lower extremities, and no palpable superficial lymph nodes. On urinalysis, protein was 2+, occult blood was 2+, and the sediment contained 20-29 red blood cells/HPF, as well as granular and red blood cell casts. His blood test results showed a red blood cell count of 3.22 million, hemoglobin level of 9.9 g/dL, hematocrit of 28%, white blood cell count of 12,300 (72% neutrophils, 3% eosinophils, 1% basophils, 5% monocytes, and 19% lymphocytes), and a platelet count of 380,000. The results of his blood biochemistry test revealed a total protein of 6.8 g/dL, albumin of 3.3 g/dL, IgG of 1,200 mg/dL (reference range: 960-1,960), a blood urea nitrogen level of 44 mg/dL, and a creatinine level of 2.2 mg/dL. The immunological serum test showed a CRP level of 8.2 mg/dL and a CH50 level of 62 U/mL (reference range: 30-40). Chest X-ray showed multiple nodular shadows in both lung fields. Which of the following drugs is appropriate as a co-administered agent for induction therapy for this patient? Select two.", "choices_en": ["Colchicine", "Rituximab", "Cyclosporine", "Methotrexate", "Cyclophosphamide"], "asnwer": ["b", "e"], "answer": ["b", "e"]}
{"problem_id": "116A71", "problem_text_en": "A 5-year-old girl presents with a chief complaint of high fever for the past 3 days. She is accompanied by her mother. She has a sore throat and decreased appetite, but no cough or runny nose. Her temperature is 39.6℃, pulse 120/min and regular, respiratory rate 28/min, oxygen saturation on room air is 100%, and she appears alert and well-nourished. There is mild conjunctival injection, pharyngeal erythema, and white exudates on the palatine tonsils. There are 4 palpable lymph nodes on both sides of the neck with a diameter of 1.5cm each. Cardiac and pulmonary auscultation is normal. Her abdomen is flat, soft and non-tender, and liver and spleen are not palpable. Which of the following is the least likely diagnosis?", "choices_en": ["Kawasaki disease", "Streptococcal infection", "EB virus infection", "Adenovirus infection", "Parvovirus B19 infection"], "asnwer": ["e"], "answer": ["e"]}
{"problem_id": "116A72", "problem_text_en": "A 40-year-old man presents with epigastric pain. He has been aware of the pain in this area since yesterday. Today, in the evening, he suddenly experienced severe pain and could not move, so was brought in by ambulance. He is 172 cm tall and weighs 52 kg. His temperature is 37.0 °C. His heart rate is 116/min and regular, blood pressure is 138/60 mmHg, and respiratory rate is 18/min. Oxygen saturation is 97% on room air, and he is conscious and alert. His abdomen is flat, with diffuse muscle guarding, and he experiences tenderness and rebound tenderness in the upper abdomen. Bowel sounds are absent. His laboratory results are as follows: RBC count 4.88 million/μL, Hb 14.8 g/dL, Ht 44%, WBC count 12,200/μL, Platelet count 330,000/μL; serum total protein 6.1 g/dL, albumin 3.1 g/dL, total bilirubin 0.2 mg/dL, AST 18 U/L, ALT 19 U/L, LD 135 U/L (reference range 120-245), blood urea nitrogen 10 mg/dL, creatinine 0.7 mg/dL, CRP 1.7 mg/dL. A soft-tissue condition of the abdomen (A) and a lung condition (B) on abdominal CT are shown separately. Which of the following should be done first? Select three.", "choices_en": ["Fasting", "Fluid infusion", "Abdominal paracentesis", "Nasogastric intubation", "Upper gastrointestinal endoscopy"], "asnwer": ["a", "b", "d"], "answer": ["a", "b", "d"]}
{"problem_id": "116A73", "problem_text_en": "An 18-year-old male living in a dormitory was transported by ambulance due to fever and consciousness disturbance. He had a fever of 38.5°C and headache since the previous day. Today, his friend called for an ambulance because he began to exhibit incomprehensible speech and behavior. Consciousness level is JCS II-20, body temperature is 38.4°C, heart rate is 100/min, regular, blood pressure is 102/70 mmHg, respiratory rate is 24/min, and SpO2 is 99% (with mask oxygen administration at 5 L/min). He has neck stiffness and purpura on his limbs. Cerebrospinal fluid examination revealed turbid appearance, initial pressure of 220 mmH2O (normal range 70-170), 861/mm3 white blood cell count (polymorphonuclear leukocytes 790, monocytes 71), protein level of 100 mg/dL, and glucose level of 16 mg/dL (concurrently, blood glucose level is 128 mg/dL). Gram staining of the cerebrospinal fluid showed Gram-negative diplococci and phagocytosis by leukocytes. Which of the following choices are correct? Choose 3.\n", "choices_en": ["The first-choice medication for treatment is penicillin.", "Cerebrospinal fluid samples should be refrigerated until the start of cultivation.", "There is an inactivated vaccine available for this causative microorganism.", "It is necessary to report to the public health center within 7 days after the diagnosis.", "Prophylactic administration of antibiotics is given to healthcare workers who have come into contact with the patient."], "asnwer": ["a", "c", "e"], "answer": ["a", "c", "e"]}
{"problem_id": "116A74", "problem_text_en": "A 42-year-old man presents with abdominal pain. He had been experiencing epigastric pain since yesterday afternoon. He vomited this morning upon waking up. He gradually began to feel right lower abdominal pain and decided to seek medical attention. His height is 170 cm, weight is 78 kg. His temperature is 37.3°C. His pulse rate is 84 bpm and regular. His blood pressure is 126/78 mmHg. His respiratory rate is 16 bpm. His SpO2 is 99% on room air. His abdomen is flat with tenderness and rebound tenderness in the right lower quadrant. His laboratory results show a red blood cell count of 4.86 million/μL, Hb of 15.2 g/dL, Ht of 43%, and a white blood cell count of 16,200/μL, and platelets of 240,000/μL. Blood chemistry includes total protein of 6.4 g/dL, albumin of 4.2 g/dL, total bilirubin of 0.7 mg/dL, AST of 23 U/L, ALT of 18 U/L, LD of 147 U/L (normal range: 120-245), blood urea nitrogen of 20 mg/dL, and creatinine of 0.9 mg/dL. CRP is 0.9 mg/dL. Abdominal ultrasound examination was inconclusive. A transverse image (A) and oblique coronal image (B) of contrast-enhanced abdominal CT scan are shown separately. What are the three potential treatment options that should be considered?\n\n(Image link: https://i.jeded.com/i/p230114-23-.jpg)", "choices_en": ["Surgery", "Intravenous infusion", "High-pressure enema", "Antibiotic administration", "Ileus tube insertion"], "asnwer": ["a", "b", "d"], "answer": ["a", "b", "d"]}
{"problem_id": "116A75", "problem_text_en": "A 70-year-old woman with residual right hemiplegia following a stroke is currently admitted to a rehabilitation hospital for recovery. She had noticed weakness in the right upper and lower limbs 8 weeks ago and was diagnosed with a left internal capsule infarction, receiving conservative treatment at an acute hospital. She was transferred to the rehabilitation hospital 2 weeks ago. She is alert and oriented. Her blood pressure is 116/70 mmHg. She is right-handed. Her right upper limb is in flexion at the elbow joint at a 90-degree angle due to spasticity, with finger flexion, and passive extension is possible, but resistance is felt throughout the full range of motion. Voluntary finger movements are not observed. In manual muscle testing (MMT), her right iliopsoas muscle is scored as 4, right quadriceps muscle is scored as 4, right tibialis anterior muscle is scored as 0, and left upper and lower limb muscle strength is scored as 5. There are no abnormalities detected in superficial or deep sensation on the right side of the body. She is able to sit unsupported, stand up using the left handrail, and maintain a standing position. Which of the following rehabilitation treatments is appropriate? Select three.", "choices_en": ["Dressing training", "Handwriting training with the right hand", "Assisted range of motion training for the right upper limb", "Walking training with short lower limb orthoses and cane", "Seated training while using a reclining wheelchair."], "asnwer": ["a", "c", "d"], "answer": ["a", "c", "d"]}
